7767517
515 734
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Concat                   Concat_0                 2 1 in0 in1 onnx::Slice_193
Split                    splitncnn_0              1 3 onnx::Slice_193 onnx::Slice_193_splitncnn_0 onnx::Slice_193_splitncnn_1 onnx::Slice_193_splitncnn_2
Crop                     Slice_5                  1 1 onnx::Slice_193_splitncnn_2 img0 -23309=1,0 -23310=1,3 -23311=1,0
Split                    splitncnn_1              1 8 img0 img0_splitncnn_0 img0_splitncnn_1 img0_splitncnn_2 img0_splitncnn_3 img0_splitncnn_4 img0_splitncnn_5 img0_splitncnn_6 img0_splitncnn_7
Crop                     Slice_10                 1 1 onnx::Slice_193_splitncnn_1 img1 -23309=1,3 -23310=1,2147483647 -23311=1,0
Split                    splitncnn_2              1 8 img1 img1_splitncnn_0 img1_splitncnn_1 img1_splitncnn_2 img1_splitncnn_3 img1_splitncnn_4 img1_splitncnn_5 img1_splitncnn_6 img1_splitncnn_7
Crop                     Slice_15                 1 1 onnx::Slice_193_splitncnn_0 onnx::Mul_208 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_17                   1 1 onnx::Mul_208 onnx::Add_210 0=2 1=1
BinaryOp                 Add_19                   1 1 onnx::Add_210 onnx::Mul_212 1=1 2=1.000000e+00
BinaryOp                 Mul_20                   2 1 onnx::Mul_212 in2 onnx::Concat_213 0=2
Split                    splitncnn_3              1 8 onnx::Concat_213 onnx::Concat_213_splitncnn_0 onnx::Concat_213_splitncnn_1 onnx::Concat_213_splitncnn_2 onnx::Concat_213_splitncnn_3 onnx::Concat_213_splitncnn_4 onnx::Concat_213_splitncnn_5 onnx::Concat_213_splitncnn_6 onnx::Concat_213_splitncnn_7
Crop                     Slice_25                 1 1 img0_splitncnn_7 onnx::Concat_218 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_30                 1 1 img1_splitncnn_7 onnx::Concat_223 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_31                3 1 onnx::Concat_218 onnx::Concat_223 onnx::Concat_213_splitncnn_7 x
Interp                   Resize_32                1 1 x input.1 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_33                  1 1 input.1 onnx::PRelu_230 0=96 1=3 3=2 4=1 5=1 6=6048
PReLU                    PRelu_34                 1 1 onnx::PRelu_230 input.3 0=96
Convolution              Conv_35                  1 1 input.3 onnx::PRelu_234 0=192 1=3 3=2 4=1 5=1 6=165888
PReLU                    PRelu_36                 1 1 onnx::PRelu_234 input.7 0=192
Split                    splitncnn_4              1 2 input.7 input.7_splitncnn_0 input.7_splitncnn_1
Convolution              Conv_37                  1 1 input.7_splitncnn_1 onnx::PRelu_238 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_38                 1 1 onnx::PRelu_238 input.11 0=192
Convolution              Conv_39                  1 1 input.11 onnx::PRelu_242 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_40                 1 1 onnx::PRelu_242 input.15 0=192
Convolution              Conv_41                  1 1 input.15 onnx::PRelu_246 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_42                 1 1 onnx::PRelu_246 input.19 0=192
Convolution              Conv_43                  1 1 input.19 onnx::PRelu_250 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_44                 1 1 onnx::PRelu_250 input.23 0=192
Convolution              Conv_45                  1 1 input.23 onnx::PRelu_254 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_46                 1 1 onnx::PRelu_254 input.27 0=192
Convolution              Conv_47                  1 1 input.27 onnx::PRelu_258 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_48                 1 1 onnx::PRelu_258 input.31 0=192
Convolution              Conv_49                  1 1 input.31 onnx::PRelu_262 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_50                 1 1 onnx::PRelu_262 input.35 0=192
Convolution              Conv_51                  1 1 input.35 onnx::PRelu_266 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_52                 1 1 onnx::PRelu_266 onnx::Add_269 0=192
BinaryOp                 Add_53                   2 1 onnx::Add_269 input.7_splitncnn_0 onnx::ConvTranspose_270
Deconvolution            ConvTranspose_54         1 1 onnx::ConvTranspose_270 tmp 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   Resize_55                1 1 tmp onnx::Slice_276 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_5              1 2 onnx::Slice_276 onnx::Slice_276_splitncnn_0 onnx::Slice_276_splitncnn_1
Crop                     Slice_60                 1 1 onnx::Slice_276_splitncnn_1 onnx::Mul_281 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_62                   1 1 onnx::Mul_281 onnx::Mul_283 0=2 1=1 2=8.000000e+00
Crop                     Slice_69                 1 1 onnx::Slice_276_splitncnn_0 onnx::Add_290 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_74                 1 1 img1_splitncnn_6 onnx::Concat_295 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_79                 1 1 img0_splitncnn_6 onnx::Concat_300 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_81                   1 1 onnx::Concat_213_splitncnn_6 onnx::Concat_302 0=7 1=1 2=1.000000e+00
Concat                   Concat_82                3 1 onnx::Concat_295 onnx::Concat_300 onnx::Concat_302 x.3
Interp                   Resize_83                1 1 x.3 input.39 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_84                  1 1 input.39 onnx::PRelu_309 0=96 1=3 3=2 4=1 5=1 6=6048
PReLU                    PRelu_85                 1 1 onnx::PRelu_309 input.43 0=96
Convolution              Conv_86                  1 1 input.43 onnx::PRelu_313 0=192 1=3 3=2 4=1 5=1 6=165888
PReLU                    PRelu_87                 1 1 onnx::PRelu_313 input.47 0=192
Split                    splitncnn_6              1 2 input.47 input.47_splitncnn_0 input.47_splitncnn_1
Convolution              Conv_88                  1 1 input.47_splitncnn_1 onnx::PRelu_317 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_89                 1 1 onnx::PRelu_317 input.51 0=192
Convolution              Conv_90                  1 1 input.51 onnx::PRelu_321 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_91                 1 1 onnx::PRelu_321 input.55 0=192
Convolution              Conv_92                  1 1 input.55 onnx::PRelu_325 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_93                 1 1 onnx::PRelu_325 input.59 0=192
Convolution              Conv_94                  1 1 input.59 onnx::PRelu_329 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_95                 1 1 onnx::PRelu_329 input.63 0=192
Convolution              Conv_96                  1 1 input.63 onnx::PRelu_333 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_97                 1 1 onnx::PRelu_333 input.67 0=192
Convolution              Conv_98                  1 1 input.67 onnx::PRelu_337 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_99                 1 1 onnx::PRelu_337 input.71 0=192
Convolution              Conv_100                 1 1 input.71 onnx::PRelu_341 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_101                1 1 onnx::PRelu_341 input.75 0=192
Convolution              Conv_102                 1 1 input.75 onnx::PRelu_345 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_103                1 1 onnx::PRelu_345 onnx::Add_348 0=192
BinaryOp                 Add_104                  2 1 onnx::Add_348 input.47_splitncnn_0 onnx::ConvTranspose_349
Deconvolution            ConvTranspose_105        1 1 onnx::ConvTranspose_349 tmp.3 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   Resize_106               1 1 tmp.3 onnx::Slice_355 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_7              1 2 onnx::Slice_355 onnx::Slice_355_splitncnn_0 onnx::Slice_355_splitncnn_1
Crop                     Slice_111                1 1 onnx::Slice_355_splitncnn_1 onnx::Mul_360 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_113                  1 1 onnx::Mul_360 onnx::Mul_362 0=2 1=1 2=8.000000e+00
BinaryOp                 Mul_115                  1 1 onnx::Mul_362 onnx::Slice_364 0=2 1=1 2=2.000000e+00
Split                    splitncnn_8              1 2 onnx::Slice_364 onnx::Slice_364_splitncnn_0 onnx::Slice_364_splitncnn_1
Crop                     Slice_120                1 1 onnx::Slice_355_splitncnn_0 onnx::Neg_369 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_125                1 1 onnx::Slice_364_splitncnn_1 onnx::Concat_374 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_130                1 1 onnx::Slice_364_splitncnn_0 onnx::Concat_379 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_131               2 1 onnx::Concat_374 onnx::Concat_379 onnx::Add_380
Eltwise                  Add_132                  2 1 onnx::Mul_283 onnx::Add_380 onnx::Div_381 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_134                  1 1 onnx::Div_381 flow 0=3 1=1 2=2.000000e+00
Split                    splitncnn_9              1 6 flow flow_splitncnn_0 flow_splitncnn_1 flow_splitncnn_2 flow_splitncnn_3 flow_splitncnn_4 flow_splitncnn_5
UnaryOp                  Neg_135                  1 1 onnx::Neg_369 onnx::Add_384 0=1
BinaryOp                 Add_136                  2 1 onnx::Add_290 onnx::Add_384 onnx::Div_385
BinaryOp                 Div_138                  1 1 onnx::Div_385 onnx::Concat_387 0=3 1=1 2=2.000000e+00
Split                    splitncnn_10             1 3 onnx::Concat_387 onnx::Concat_387_splitncnn_0 onnx::Concat_387_splitncnn_1 onnx::Concat_387_splitncnn_2
Crop                     Slice_143                1 1 flow_splitncnn_5 onnx::Pow_392 -23309=1,0 -23310=1,3 -23311=1,0
rife.Warp                warp_0                   2 1 img0_splitncnn_5 onnx::Pow_392 onnx::Slice_393 0=6
Split                    splitncnn_11             1 2 onnx::Slice_393 onnx::Slice_393_splitncnn_0 onnx::Slice_393_splitncnn_1
Crop                     Slice_149                1 1 flow_splitncnn_4 onnx::Pow_398 -23309=1,1 -23310=1,4 -23311=1,0
rife.Warp                warp_1                   2 1 img1_splitncnn_5 onnx::Pow_398 onnx::Slice_399 0=6
Split                    splitncnn_12             1 2 onnx::Slice_399 onnx::Slice_399_splitncnn_0 onnx::Slice_399_splitncnn_1
Crop                     Slice_155                1 1 onnx::Slice_393_splitncnn_1 onnx::Concat_404 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_160                1 1 onnx::Slice_399_splitncnn_1 onnx::Concat_409 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_161               4 1 onnx::Concat_404 onnx::Concat_409 onnx::Concat_213_splitncnn_5 onnx::Concat_387_splitncnn_2 x.7
Interp                   Resize_162               1 1 x.7 onnx::Concat_415 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_163               1 1 flow_splitncnn_3 onnx::Mul_420 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_165                  1 1 onnx::Mul_420 onnx::Div_422 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_167                  1 1 onnx::Div_422 onnx::Concat_424 0=3 1=1 2=4.000000e+00
Concat                   Concat_168               2 1 onnx::Concat_415 onnx::Concat_424 input.79
Convolution              Conv_169                 1 1 input.79 onnx::PRelu_426 0=64 1=3 3=2 4=1 5=1 6=6912
PReLU                    PRelu_170                1 1 onnx::PRelu_426 input.83 0=64
Convolution              Conv_171                 1 1 input.83 onnx::PRelu_430 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_172                1 1 onnx::PRelu_430 input.87 0=128
Split                    splitncnn_13             1 2 input.87 input.87_splitncnn_0 input.87_splitncnn_1
Convolution              Conv_173                 1 1 input.87_splitncnn_1 onnx::PRelu_434 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_174                1 1 onnx::PRelu_434 input.91 0=128
Convolution              Conv_175                 1 1 input.91 onnx::PRelu_438 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_176                1 1 onnx::PRelu_438 input.95 0=128
Convolution              Conv_177                 1 1 input.95 onnx::PRelu_442 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_178                1 1 onnx::PRelu_442 input.99 0=128
Convolution              Conv_179                 1 1 input.99 onnx::PRelu_446 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_180                1 1 onnx::PRelu_446 input.103 0=128
Convolution              Conv_181                 1 1 input.103 onnx::PRelu_450 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_182                1 1 onnx::PRelu_450 input.107 0=128
Convolution              Conv_183                 1 1 input.107 onnx::PRelu_454 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_184                1 1 onnx::PRelu_454 input.111 0=128
Convolution              Conv_185                 1 1 input.111 onnx::PRelu_458 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_186                1 1 onnx::PRelu_458 input.115 0=128
Convolution              Conv_187                 1 1 input.115 onnx::PRelu_462 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_188                1 1 onnx::PRelu_462 onnx::Add_465 0=128
BinaryOp                 Add_189                  2 1 onnx::Add_465 input.87_splitncnn_0 onnx::ConvTranspose_466
Deconvolution            ConvTranspose_190        1 1 onnx::ConvTranspose_466 tmp.7 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   Resize_191               1 1 tmp.7 onnx::Slice_472 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_14             1 2 onnx::Slice_472 onnx::Slice_472_splitncnn_0 onnx::Slice_472_splitncnn_1
Crop                     Slice_196                1 1 onnx::Slice_472_splitncnn_1 onnx::Mul_477 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_198                  1 1 onnx::Mul_477 onnx::Mul_479 0=2 1=1 2=4.000000e+00
Crop                     Slice_205                1 1 onnx::Slice_472_splitncnn_0 onnx::Add_486 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_210                1 1 onnx::Slice_399_splitncnn_0 onnx::Concat_491 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_215                1 1 onnx::Slice_393_splitncnn_0 onnx::Concat_496 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_217                  1 1 onnx::Concat_213_splitncnn_4 onnx::Concat_498 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_218                  1 1 onnx::Concat_387_splitncnn_1 onnx::Concat_499 0=1
Concat                   Concat_219               4 1 onnx::Concat_491 onnx::Concat_496 onnx::Concat_498 onnx::Concat_499 x.11
Crop                     Slice_224                1 1 flow_splitncnn_2 onnx::Concat_505 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_229                1 1 flow_splitncnn_1 onnx::Concat_510 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_230               2 1 onnx::Concat_505 onnx::Concat_510 flow.3
Interp                   Resize_231               1 1 x.11 onnx::Concat_516 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_232               1 1 flow.3 onnx::Mul_521 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_234                  1 1 onnx::Mul_521 onnx::Div_523 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_236                  1 1 onnx::Div_523 onnx::Concat_525 0=3 1=1 2=4.000000e+00
Concat                   Concat_237               2 1 onnx::Concat_516 onnx::Concat_525 input.119
Convolution              Conv_238                 1 1 input.119 onnx::PRelu_527 0=64 1=3 3=2 4=1 5=1 6=6912
PReLU                    PRelu_239                1 1 onnx::PRelu_527 input.123 0=64
Convolution              Conv_240                 1 1 input.123 onnx::PRelu_531 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_241                1 1 onnx::PRelu_531 input.127 0=128
Split                    splitncnn_15             1 2 input.127 input.127_splitncnn_0 input.127_splitncnn_1
Convolution              Conv_242                 1 1 input.127_splitncnn_1 onnx::PRelu_535 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_243                1 1 onnx::PRelu_535 input.131 0=128
Convolution              Conv_244                 1 1 input.131 onnx::PRelu_539 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_245                1 1 onnx::PRelu_539 input.135 0=128
Convolution              Conv_246                 1 1 input.135 onnx::PRelu_543 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_247                1 1 onnx::PRelu_543 input.139 0=128
Convolution              Conv_248                 1 1 input.139 onnx::PRelu_547 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_249                1 1 onnx::PRelu_547 input.143 0=128
Convolution              Conv_250                 1 1 input.143 onnx::PRelu_551 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_251                1 1 onnx::PRelu_551 input.147 0=128
Convolution              Conv_252                 1 1 input.147 onnx::PRelu_555 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_253                1 1 onnx::PRelu_555 input.151 0=128
Convolution              Conv_254                 1 1 input.151 onnx::PRelu_559 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_255                1 1 onnx::PRelu_559 input.155 0=128
Convolution              Conv_256                 1 1 input.155 onnx::PRelu_563 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_257                1 1 onnx::PRelu_563 onnx::Add_566 0=128
BinaryOp                 Add_258                  2 1 onnx::Add_566 input.127_splitncnn_0 onnx::ConvTranspose_567
Deconvolution            ConvTranspose_259        1 1 onnx::ConvTranspose_567 tmp.11 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   Resize_260               1 1 tmp.11 onnx::Slice_573 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_16             1 2 onnx::Slice_573 onnx::Slice_573_splitncnn_0 onnx::Slice_573_splitncnn_1
Crop                     Slice_265                1 1 onnx::Slice_573_splitncnn_1 onnx::Mul_578 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_267                  1 1 onnx::Mul_578 onnx::Mul_580 0=2 1=1 2=4.000000e+00
BinaryOp                 Mul_269                  1 1 onnx::Mul_580 onnx::Slice_582 0=2 1=1 2=2.000000e+00
Split                    splitncnn_17             1 2 onnx::Slice_582 onnx::Slice_582_splitncnn_0 onnx::Slice_582_splitncnn_1
Crop                     Slice_274                1 1 onnx::Slice_573_splitncnn_0 onnx::Neg_587 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_279                1 1 onnx::Slice_582_splitncnn_1 onnx::Concat_592 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_284                1 1 onnx::Slice_582_splitncnn_0 onnx::Concat_597 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_285               2 1 onnx::Concat_592 onnx::Concat_597 onnx::Add_598
Eltwise                  Add_286                  2 1 onnx::Mul_479 onnx::Add_598 onnx::Div_599 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_288                  1 1 onnx::Div_599 onnx::Add_601 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_289                  1 1 onnx::Neg_587 onnx::Add_602 0=1
BinaryOp                 Add_290                  2 1 onnx::Add_486 onnx::Add_602 onnx::Div_603
BinaryOp                 Div_292                  1 1 onnx::Div_603 onnx::Add_605 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_293                  2 1 flow_splitncnn_0 onnx::Add_601 flow.7
Split                    splitncnn_18             1 6 flow.7 flow.7_splitncnn_0 flow.7_splitncnn_1 flow.7_splitncnn_2 flow.7_splitncnn_3 flow.7_splitncnn_4 flow.7_splitncnn_5
BinaryOp                 Add_294                  2 1 onnx::Concat_387_splitncnn_0 onnx::Add_605 onnx::Concat_607
Split                    splitncnn_19             1 3 onnx::Concat_607 onnx::Concat_607_splitncnn_0 onnx::Concat_607_splitncnn_1 onnx::Concat_607_splitncnn_2
Crop                     Slice_299                1 1 flow.7_splitncnn_5 onnx::Pow_612 -23309=1,0 -23310=1,3 -23311=1,0
rife.Warp                warp_3                   2 1 img0_splitncnn_4 onnx::Pow_612 onnx::Slice_613 0=6
Split                    splitncnn_20             1 2 onnx::Slice_613 onnx::Slice_613_splitncnn_0 onnx::Slice_613_splitncnn_1
Crop                     Slice_305                1 1 flow.7_splitncnn_4 onnx::Pow_618 -23309=1,1 -23310=1,4 -23311=1,0
rife.Warp                warp_2                   2 1 img1_splitncnn_4 onnx::Pow_618 onnx::Slice_619 0=6
Split                    splitncnn_21             1 2 onnx::Slice_619 onnx::Slice_619_splitncnn_0 onnx::Slice_619_splitncnn_1
Crop                     Slice_311                1 1 onnx::Slice_613_splitncnn_1 onnx::Concat_624 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_316                1 1 onnx::Slice_619_splitncnn_1 onnx::Concat_629 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_317               4 1 onnx::Concat_624 onnx::Concat_629 onnx::Concat_213_splitncnn_3 onnx::Concat_607_splitncnn_2 x.15
Interp                   Resize_318               1 1 x.15 onnx::Concat_635 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_319               1 1 flow.7_splitncnn_3 onnx::Mul_640 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_321                  1 1 onnx::Mul_640 onnx::Div_642 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_323                  1 1 onnx::Div_642 onnx::Concat_644 0=3 1=1 2=2.000000e+00
Concat                   Concat_324               2 1 onnx::Concat_635 onnx::Concat_644 input.159
Convolution              Conv_325                 1 1 input.159 onnx::PRelu_646 0=48 1=3 3=2 4=1 5=1 6=5184
PReLU                    PRelu_326                1 1 onnx::PRelu_646 input.163 0=48
Convolution              Conv_327                 1 1 input.163 onnx::PRelu_650 0=96 1=3 3=2 4=1 5=1 6=41472
PReLU                    PRelu_328                1 1 onnx::PRelu_650 input.167 0=96
Split                    splitncnn_22             1 2 input.167 input.167_splitncnn_0 input.167_splitncnn_1
Convolution              Conv_329                 1 1 input.167_splitncnn_1 onnx::PRelu_654 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_330                1 1 onnx::PRelu_654 input.171 0=96
Convolution              Conv_331                 1 1 input.171 onnx::PRelu_658 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_332                1 1 onnx::PRelu_658 input.175 0=96
Convolution              Conv_333                 1 1 input.175 onnx::PRelu_662 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_334                1 1 onnx::PRelu_662 input.179 0=96
Convolution              Conv_335                 1 1 input.179 onnx::PRelu_666 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_336                1 1 onnx::PRelu_666 input.183 0=96
Convolution              Conv_337                 1 1 input.183 onnx::PRelu_670 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_338                1 1 onnx::PRelu_670 input.187 0=96
Convolution              Conv_339                 1 1 input.187 onnx::PRelu_674 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_340                1 1 onnx::PRelu_674 input.191 0=96
Convolution              Conv_341                 1 1 input.191 onnx::PRelu_678 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_342                1 1 onnx::PRelu_678 input.195 0=96
Convolution              Conv_343                 1 1 input.195 onnx::PRelu_682 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_344                1 1 onnx::PRelu_682 onnx::Add_685 0=96
BinaryOp                 Add_345                  2 1 onnx::Add_685 input.167_splitncnn_0 onnx::ConvTranspose_686
Deconvolution            ConvTranspose_346        1 1 onnx::ConvTranspose_686 tmp.15 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   Resize_347               1 1 tmp.15 onnx::Slice_692 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_23             1 2 onnx::Slice_692 onnx::Slice_692_splitncnn_0 onnx::Slice_692_splitncnn_1
Crop                     Slice_352                1 1 onnx::Slice_692_splitncnn_1 onnx::Mul_697 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_354                  1 1 onnx::Mul_697 onnx::Mul_699 0=2 1=1 2=2.000000e+00
Crop                     Slice_361                1 1 onnx::Slice_692_splitncnn_0 onnx::Add_706 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_366                1 1 onnx::Slice_619_splitncnn_0 onnx::Concat_711 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_371                1 1 onnx::Slice_613_splitncnn_0 onnx::Concat_716 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_373                  1 1 onnx::Concat_213_splitncnn_2 onnx::Concat_718 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_374                  1 1 onnx::Concat_607_splitncnn_1 onnx::Concat_719 0=1
Concat                   Concat_375               4 1 onnx::Concat_711 onnx::Concat_716 onnx::Concat_718 onnx::Concat_719 x.19
Crop                     Slice_380                1 1 flow.7_splitncnn_2 onnx::Concat_725 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_385                1 1 flow.7_splitncnn_1 onnx::Concat_730 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_386               2 1 onnx::Concat_725 onnx::Concat_730 flow.11
Interp                   Resize_387               1 1 x.19 onnx::Concat_736 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_388               1 1 flow.11 onnx::Mul_741 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_390                  1 1 onnx::Mul_741 onnx::Div_743 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_392                  1 1 onnx::Div_743 onnx::Concat_745 0=3 1=1 2=2.000000e+00
Concat                   Concat_393               2 1 onnx::Concat_736 onnx::Concat_745 input.199
Convolution              Conv_394                 1 1 input.199 onnx::PRelu_747 0=48 1=3 3=2 4=1 5=1 6=5184
PReLU                    PRelu_395                1 1 onnx::PRelu_747 input.203 0=48
Convolution              Conv_396                 1 1 input.203 onnx::PRelu_751 0=96 1=3 3=2 4=1 5=1 6=41472
PReLU                    PRelu_397                1 1 onnx::PRelu_751 input.207 0=96
Split                    splitncnn_24             1 2 input.207 input.207_splitncnn_0 input.207_splitncnn_1
Convolution              Conv_398                 1 1 input.207_splitncnn_1 onnx::PRelu_755 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_399                1 1 onnx::PRelu_755 input.211 0=96
Convolution              Conv_400                 1 1 input.211 onnx::PRelu_759 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_401                1 1 onnx::PRelu_759 input.215 0=96
Convolution              Conv_402                 1 1 input.215 onnx::PRelu_763 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_403                1 1 onnx::PRelu_763 input.219 0=96
Convolution              Conv_404                 1 1 input.219 onnx::PRelu_767 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_405                1 1 onnx::PRelu_767 input.223 0=96
Convolution              Conv_406                 1 1 input.223 onnx::PRelu_771 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_407                1 1 onnx::PRelu_771 input.227 0=96
Convolution              Conv_408                 1 1 input.227 onnx::PRelu_775 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_409                1 1 onnx::PRelu_775 input.231 0=96
Convolution              Conv_410                 1 1 input.231 onnx::PRelu_779 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_411                1 1 onnx::PRelu_779 input.235 0=96
Convolution              Conv_412                 1 1 input.235 onnx::PRelu_783 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_413                1 1 onnx::PRelu_783 onnx::Add_786 0=96
BinaryOp                 Add_414                  2 1 onnx::Add_786 input.207_splitncnn_0 onnx::ConvTranspose_787
Deconvolution            ConvTranspose_415        1 1 onnx::ConvTranspose_787 tmp.19 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   Resize_416               1 1 tmp.19 onnx::Slice_793 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_25             1 2 onnx::Slice_793 onnx::Slice_793_splitncnn_0 onnx::Slice_793_splitncnn_1
Crop                     Slice_421                1 1 onnx::Slice_793_splitncnn_1 onnx::Mul_798 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_423                  1 1 onnx::Mul_798 onnx::Mul_800 0=2 1=1 2=2.000000e+00
BinaryOp                 Mul_425                  1 1 onnx::Mul_800 onnx::Slice_802 0=2 1=1 2=2.000000e+00
Split                    splitncnn_26             1 2 onnx::Slice_802 onnx::Slice_802_splitncnn_0 onnx::Slice_802_splitncnn_1
Crop                     Slice_430                1 1 onnx::Slice_793_splitncnn_0 onnx::Neg_807 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_435                1 1 onnx::Slice_802_splitncnn_1 onnx::Concat_812 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_440                1 1 onnx::Slice_802_splitncnn_0 onnx::Concat_817 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_441               2 1 onnx::Concat_812 onnx::Concat_817 onnx::Add_818
Eltwise                  Add_442                  2 1 onnx::Mul_699 onnx::Add_818 onnx::Div_819 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_444                  1 1 onnx::Div_819 onnx::Add_821 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_445                  1 1 onnx::Neg_807 onnx::Add_822 0=1
BinaryOp                 Add_446                  2 1 onnx::Add_706 onnx::Add_822 onnx::Div_823
BinaryOp                 Div_448                  1 1 onnx::Div_823 onnx::Add_825 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_449                  2 1 flow.7_splitncnn_0 onnx::Add_821 flow.15
Split                    splitncnn_27             1 6 flow.15 flow.15_splitncnn_0 flow.15_splitncnn_1 flow.15_splitncnn_2 flow.15_splitncnn_3 flow.15_splitncnn_4 flow.15_splitncnn_5
BinaryOp                 Add_450                  2 1 onnx::Concat_607_splitncnn_0 onnx::Add_825 onnx::Concat_827
Split                    splitncnn_28             1 3 onnx::Concat_827 onnx::Concat_827_splitncnn_0 onnx::Concat_827_splitncnn_1 onnx::Concat_827_splitncnn_2
Crop                     Slice_455                1 1 flow.15_splitncnn_5 onnx::Pow_832 -23309=1,0 -23310=1,3 -23311=1,0
rife.Warp                warp_5                   2 1 img0_splitncnn_3 onnx::Pow_832 onnx::Slice_833 0=6
Split                    splitncnn_29             1 2 onnx::Slice_833 onnx::Slice_833_splitncnn_0 onnx::Slice_833_splitncnn_1
Crop                     Slice_461                1 1 flow.15_splitncnn_4 onnx::Pow_838 -23309=1,1 -23310=1,4 -23311=1,0
rife.Warp                warp_4                   2 1 img1_splitncnn_3 onnx::Pow_838 onnx::Slice_839 0=6
Split                    splitncnn_30             1 2 onnx::Slice_839 onnx::Slice_839_splitncnn_0 onnx::Slice_839_splitncnn_1
Crop                     Slice_467                1 1 onnx::Slice_833_splitncnn_1 onnx::Concat_844 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_472                1 1 onnx::Slice_839_splitncnn_1 onnx::Concat_849 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_473               4 1 onnx::Concat_844 onnx::Concat_849 onnx::Concat_213_splitncnn_1 onnx::Concat_827_splitncnn_2 x.23
Interp                   Resize_474               1 1 x.23 onnx::Concat_855 0=2
Interp                   Resize_475               1 1 flow.15_splitncnn_3 onnx::Mul_860 0=2
BinaryOp                 Mul_477                  1 1 onnx::Mul_860 onnx::Div_862 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_479                  1 1 onnx::Div_862 onnx::Concat_864 0=3 1=1 2=1.000000e+00
Concat                   Concat_480               2 1 onnx::Concat_855 onnx::Concat_864 input.239
Convolution              Conv_481                 1 1 input.239 onnx::PRelu_866 0=32 1=3 3=2 4=1 5=1 6=3456
PReLU                    PRelu_482                1 1 onnx::PRelu_866 input.243 0=32
Convolution              Conv_483                 1 1 input.243 onnx::PRelu_870 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_484                1 1 onnx::PRelu_870 input.247 0=64
Split                    splitncnn_31             1 2 input.247 input.247_splitncnn_0 input.247_splitncnn_1
Convolution              Conv_485                 1 1 input.247_splitncnn_1 onnx::PRelu_874 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_486                1 1 onnx::PRelu_874 input.251 0=64
Convolution              Conv_487                 1 1 input.251 onnx::PRelu_878 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_488                1 1 onnx::PRelu_878 input.255 0=64
Convolution              Conv_489                 1 1 input.255 onnx::PRelu_882 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_490                1 1 onnx::PRelu_882 input.259 0=64
Convolution              Conv_491                 1 1 input.259 onnx::PRelu_886 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_492                1 1 onnx::PRelu_886 input.263 0=64
Convolution              Conv_493                 1 1 input.263 onnx::PRelu_890 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_494                1 1 onnx::PRelu_890 input.267 0=64
Convolution              Conv_495                 1 1 input.267 onnx::PRelu_894 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_496                1 1 onnx::PRelu_894 input.271 0=64
Convolution              Conv_497                 1 1 input.271 onnx::PRelu_898 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_498                1 1 onnx::PRelu_898 input.275 0=64
Convolution              Conv_499                 1 1 input.275 onnx::PRelu_902 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_500                1 1 onnx::PRelu_902 onnx::Add_905 0=64
BinaryOp                 Add_501                  2 1 onnx::Add_905 input.247_splitncnn_0 onnx::ConvTranspose_906
Deconvolution            ConvTranspose_502        1 1 onnx::ConvTranspose_906 tmp.23 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   Resize_503               1 1 tmp.23 onnx::Slice_912 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_32             1 2 onnx::Slice_912 onnx::Slice_912_splitncnn_0 onnx::Slice_912_splitncnn_1
Crop                     Slice_508                1 1 onnx::Slice_912_splitncnn_1 onnx::Mul_917 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_515                1 1 onnx::Slice_912_splitncnn_0 onnx::Add_924 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_520                1 1 onnx::Slice_839_splitncnn_0 onnx::Concat_929 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_525                1 1 onnx::Slice_833_splitncnn_0 onnx::Concat_934 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_527                  1 1 onnx::Concat_213_splitncnn_0 onnx::Concat_936 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_528                  1 1 onnx::Concat_827_splitncnn_1 onnx::Concat_937 0=1
Concat                   Concat_529               4 1 onnx::Concat_929 onnx::Concat_934 onnx::Concat_936 onnx::Concat_937 x.27
Crop                     Slice_534                1 1 flow.15_splitncnn_2 onnx::Concat_943 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_539                1 1 flow.15_splitncnn_1 onnx::Concat_948 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_540               2 1 onnx::Concat_943 onnx::Concat_948 flow.19
Interp                   Resize_541               1 1 x.27 onnx::Concat_954 0=2
Interp                   Resize_542               1 1 flow.19 onnx::Mul_959 0=2
BinaryOp                 Mul_544                  1 1 onnx::Mul_959 onnx::Div_961 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_546                  1 1 onnx::Div_961 onnx::Concat_963 0=3 1=1 2=1.000000e+00
Concat                   Concat_547               2 1 onnx::Concat_954 onnx::Concat_963 input.279
Convolution              Conv_548                 1 1 input.279 onnx::PRelu_965 0=32 1=3 3=2 4=1 5=1 6=3456
PReLU                    PRelu_549                1 1 onnx::PRelu_965 input.283 0=32
Convolution              Conv_550                 1 1 input.283 onnx::PRelu_969 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_551                1 1 onnx::PRelu_969 input.287 0=64
Split                    splitncnn_33             1 2 input.287 input.287_splitncnn_0 input.287_splitncnn_1
Convolution              Conv_552                 1 1 input.287_splitncnn_1 onnx::PRelu_973 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_553                1 1 onnx::PRelu_973 input.291 0=64
Convolution              Conv_554                 1 1 input.291 onnx::PRelu_977 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_555                1 1 onnx::PRelu_977 input.295 0=64
Convolution              Conv_556                 1 1 input.295 onnx::PRelu_981 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_557                1 1 onnx::PRelu_981 input.299 0=64
Convolution              Conv_558                 1 1 input.299 onnx::PRelu_985 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_559                1 1 onnx::PRelu_985 input.303 0=64
Convolution              Conv_560                 1 1 input.303 onnx::PRelu_989 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_561                1 1 onnx::PRelu_989 input.307 0=64
Convolution              Conv_562                 1 1 input.307 onnx::PRelu_993 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_563                1 1 onnx::PRelu_993 input.311 0=64
Convolution              Conv_564                 1 1 input.311 onnx::PRelu_997 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_565                1 1 onnx::PRelu_997 input.315 0=64
Convolution              Conv_566                 1 1 input.315 onnx::PRelu_1001 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_567                1 1 onnx::PRelu_1001 onnx::Add_1004 0=64
BinaryOp                 Add_568                  2 1 onnx::Add_1004 input.287_splitncnn_0 onnx::ConvTranspose_1005
Deconvolution            ConvTranspose_569        1 1 onnx::ConvTranspose_1005 tmp.27 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   Resize_570               1 1 tmp.27 onnx::Slice_1011 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_34             1 2 onnx::Slice_1011 onnx::Slice_1011_splitncnn_0 onnx::Slice_1011_splitncnn_1
Crop                     Slice_575                1 1 onnx::Slice_1011_splitncnn_1 onnx::Mul_1016 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_577                  1 1 onnx::Mul_1016 onnx::Slice_1018 0=2 1=1 2=2.000000e+00
Split                    splitncnn_35             1 2 onnx::Slice_1018 onnx::Slice_1018_splitncnn_0 onnx::Slice_1018_splitncnn_1
Crop                     Slice_582                1 1 onnx::Slice_1011_splitncnn_0 onnx::Neg_1023 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_587                1 1 onnx::Slice_1018_splitncnn_1 onnx::Concat_1028 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_592                1 1 onnx::Slice_1018_splitncnn_0 onnx::Concat_1033 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_593               2 1 onnx::Concat_1028 onnx::Concat_1033 onnx::Add_1034
Eltwise                  Add_594                  2 1 onnx::Mul_917 onnx::Add_1034 onnx::Div_1035 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_596                  1 1 onnx::Div_1035 onnx::Add_1037 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_597                  1 1 onnx::Neg_1023 onnx::Add_1038 0=1
BinaryOp                 Add_598                  2 1 onnx::Add_924 onnx::Add_1038 onnx::Div_1039
BinaryOp                 Div_600                  1 1 onnx::Div_1039 onnx::Add_1041 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_601                  2 1 flow.15_splitncnn_0 onnx::Add_1037 onnx::Slice_1042
Split                    splitncnn_36             1 5 onnx::Slice_1042 onnx::Slice_1042_splitncnn_0 onnx::Slice_1042_splitncnn_1 onnx::Slice_1042_splitncnn_2 onnx::Slice_1042_splitncnn_3 onnx::Slice_1042_splitncnn_4
BinaryOp                 Add_602                  2 1 onnx::Concat_827_splitncnn_0 onnx::Add_1041 onnx::Sigmoid_1043
Split                    splitncnn_37             1 2 onnx::Sigmoid_1043 onnx::Sigmoid_1043_splitncnn_0 onnx::Sigmoid_1043_splitncnn_1
Crop                     Slice_607                1 1 onnx::Slice_1042_splitncnn_4 onnx::Pow_1048 -23309=1,0 -23310=1,3 -23311=1,0
rife.Warp                warp_7                   2 1 img0_splitncnn_2 onnx::Pow_1048 onnx::Mul_1049 0=6
Split                    splitncnn_38             1 2 onnx::Mul_1049 onnx::Mul_1049_splitncnn_0 onnx::Mul_1049_splitncnn_1
Crop                     Slice_613                1 1 onnx::Slice_1042_splitncnn_3 onnx::Pow_1054 -23309=1,1 -23310=1,4 -23311=1,0
rife.Warp                warp_6                   2 1 img1_splitncnn_2 onnx::Pow_1054 onnx::Mul_1055 0=6
Split                    splitncnn_39             1 2 onnx::Mul_1055 onnx::Mul_1055_splitncnn_0 onnx::Mul_1055_splitncnn_1
Sigmoid                  Sigmoid_615              1 1 onnx::Sigmoid_1043_splitncnn_1 onnx::Mul_1056
Split                    splitncnn_40             1 2 onnx::Mul_1056 onnx::Mul_1056_splitncnn_0 onnx::Mul_1056_splitncnn_1
BinaryOp                 Mul_616                  2 1 onnx::Mul_1049_splitncnn_1 onnx::Mul_1056_splitncnn_1 onnx::Add_1057 0=2
BinaryOp                 Sub_618                  1 1 onnx::Mul_1056_splitncnn_0 onnx::Mul_1059 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_619                  2 1 onnx::Mul_1055_splitncnn_1 onnx::Mul_1059 onnx::Add_1060 0=2
BinaryOp                 Add_620                  2 1 onnx::Add_1057 onnx::Add_1060 onnx::Add_1061
Crop                     Slice_625                1 1 onnx::Slice_1042_splitncnn_2 flow.23 -23309=1,0 -23310=1,2 -23311=1,0
Convolution              Conv_626                 1 1 img0_splitncnn_1 onnx::PRelu_1067 0=16 1=3 3=2 4=1 5=1 6=432
PReLU                    PRelu_627                1 1 onnx::PRelu_1067 input.319 0=16
Convolution              Conv_628                 1 1 input.319 onnx::PRelu_1071 0=16 1=3 4=1 5=1 6=2304
PReLU                    PRelu_629                1 1 onnx::PRelu_1071 x.31 0=16
Split                    splitncnn_41             1 2 x.31 x.31_splitncnn_0 x.31_splitncnn_1
Interp                   Resize_630               1 1 flow.23 onnx::Mul_1079 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_632                  1 1 onnx::Mul_1079 onnx::Concat_1081 0=2 1=1 2=5.000000e-01
Split                    splitncnn_42             1 64 onnx::Concat_1081 onnx::Concat_1081_splitncnn_0 onnx::Concat_1081_splitncnn_1 onnx::Concat_1081_splitncnn_2 onnx::Concat_1081_splitncnn_3 onnx::Concat_1081_splitncnn_4 onnx::Concat_1081_splitncnn_5 onnx::Concat_1081_splitncnn_6 onnx::Concat_1081_splitncnn_7 onnx::Concat_1081_splitncnn_8 onnx::Concat_1081_splitncnn_9 onnx::Concat_1081_splitncnn_10 onnx::Concat_1081_splitncnn_11 onnx::Concat_1081_splitncnn_12 onnx::Concat_1081_splitncnn_13 onnx::Concat_1081_splitncnn_14 onnx::Concat_1081_splitncnn_15 onnx::Concat_1081_splitncnn_16 onnx::Concat_1081_splitncnn_17 onnx::Concat_1081_splitncnn_18 onnx::Concat_1081_splitncnn_19 onnx::Concat_1081_splitncnn_20 onnx::Concat_1081_splitncnn_21 onnx::Concat_1081_splitncnn_22 onnx::Concat_1081_splitncnn_23 onnx::Concat_1081_splitncnn_24 onnx::Concat_1081_splitncnn_25 onnx::Concat_1081_splitncnn_26 onnx::Concat_1081_splitncnn_27 onnx::Concat_1081_splitncnn_28 onnx::Concat_1081_splitncnn_29 onnx::Concat_1081_splitncnn_30 onnx::Concat_1081_splitncnn_31 onnx::Concat_1081_splitncnn_32 onnx::Concat_1081_splitncnn_33 onnx::Concat_1081_splitncnn_34 onnx::Concat_1081_splitncnn_35 onnx::Concat_1081_splitncnn_36 onnx::Concat_1081_splitncnn_37 onnx::Concat_1081_splitncnn_38 onnx::Concat_1081_splitncnn_39 onnx::Concat_1081_splitncnn_40 onnx::Concat_1081_splitncnn_41 onnx::Concat_1081_splitncnn_42 onnx::Concat_1081_splitncnn_43 onnx::Concat_1081_splitncnn_44 onnx::Concat_1081_splitncnn_45 onnx::Concat_1081_splitncnn_46 onnx::Concat_1081_splitncnn_47 onnx::Concat_1081_splitncnn_48 onnx::Concat_1081_splitncnn_49 onnx::Concat_1081_splitncnn_50 onnx::Concat_1081_splitncnn_51 onnx::Concat_1081_splitncnn_52 onnx::Concat_1081_splitncnn_53 onnx::Concat_1081_splitncnn_54 onnx::Concat_1081_splitncnn_55 onnx::Concat_1081_splitncnn_56 onnx::Concat_1081_splitncnn_57 onnx::Concat_1081_splitncnn_58 onnx::Concat_1081_splitncnn_59 onnx::Concat_1081_splitncnn_60 onnx::Concat_1081_splitncnn_61 onnx::Concat_1081_splitncnn_62 onnx::Concat_1081_splitncnn_63
Concat                   Concat_633               64 1 onnx::Concat_1081_splitncnn_63 onnx::Concat_1081_splitncnn_62 onnx::Concat_1081_splitncnn_61 onnx::Concat_1081_splitncnn_60 onnx::Concat_1081_splitncnn_59 onnx::Concat_1081_splitncnn_58 onnx::Concat_1081_splitncnn_57 onnx::Concat_1081_splitncnn_56 onnx::Concat_1081_splitncnn_55 onnx::Concat_1081_splitncnn_54 onnx::Concat_1081_splitncnn_53 onnx::Concat_1081_splitncnn_52 onnx::Concat_1081_splitncnn_51 onnx::Concat_1081_splitncnn_50 onnx::Concat_1081_splitncnn_49 onnx::Concat_1081_splitncnn_48 onnx::Concat_1081_splitncnn_47 onnx::Concat_1081_splitncnn_46 onnx::Concat_1081_splitncnn_45 onnx::Concat_1081_splitncnn_44 onnx::Concat_1081_splitncnn_43 onnx::Concat_1081_splitncnn_42 onnx::Concat_1081_splitncnn_41 onnx::Concat_1081_splitncnn_40 onnx::Concat_1081_splitncnn_39 onnx::Concat_1081_splitncnn_38 onnx::Concat_1081_splitncnn_37 onnx::Concat_1081_splitncnn_36 onnx::Concat_1081_splitncnn_35 onnx::Concat_1081_splitncnn_34 onnx::Concat_1081_splitncnn_33 onnx::Concat_1081_splitncnn_32 onnx::Concat_1081_splitncnn_31 onnx::Concat_1081_splitncnn_30 onnx::Concat_1081_splitncnn_29 onnx::Concat_1081_splitncnn_28 onnx::Concat_1081_splitncnn_27 onnx::Concat_1081_splitncnn_26 onnx::Concat_1081_splitncnn_25 onnx::Concat_1081_splitncnn_24 onnx::Concat_1081_splitncnn_23 onnx::Concat_1081_splitncnn_22 onnx::Concat_1081_splitncnn_21 onnx::Concat_1081_splitncnn_20 onnx::Concat_1081_splitncnn_19 onnx::Concat_1081_splitncnn_18 onnx::Concat_1081_splitncnn_17 onnx::Concat_1081_splitncnn_16 onnx::Concat_1081_splitncnn_15 onnx::Concat_1081_splitncnn_14 onnx::Concat_1081_splitncnn_13 onnx::Concat_1081_splitncnn_12 onnx::Concat_1081_splitncnn_11 onnx::Concat_1081_splitncnn_10 onnx::Concat_1081_splitncnn_9 onnx::Concat_1081_splitncnn_8 onnx::Concat_1081_splitncnn_7 onnx::Concat_1081_splitncnn_6 onnx::Concat_1081_splitncnn_5 onnx::Concat_1081_splitncnn_4 onnx::Concat_1081_splitncnn_3 onnx::Concat_1081_splitncnn_2 onnx::Concat_1081_splitncnn_1 onnx::Concat_1081_splitncnn_0 flow.27
Split                    splitncnn_43             1 2 flow.27 flow.27_splitncnn_0 flow.27_splitncnn_1
Crop                     Slice_638                1 1 flow.27_splitncnn_1 onnx::Pow_1087 -23309=1,0 -23310=1,16 -23311=1,0
rife.Warp                warp_8                   2 1 x.31_splitncnn_1 onnx::Pow_1087 onnx::Concat_1088 0=6
Convolution              Conv_640                 1 1 x.31_splitncnn_0 onnx::PRelu_1089 0=32 1=3 3=2 4=1 5=1 6=4608
PReLU                    PRelu_641                1 1 onnx::PRelu_1089 input.323 0=32
Convolution              Conv_642                 1 1 input.323 onnx::PRelu_1093 0=32 1=3 4=1 5=1 6=9216
PReLU                    PRelu_643                1 1 onnx::PRelu_1093 x.35 0=32
Split                    splitncnn_44             1 2 x.35 x.35_splitncnn_0 x.35_splitncnn_1
Interp                   Resize_644               1 1 flow.27_splitncnn_0 onnx::Mul_1101 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_646                  1 1 onnx::Mul_1101 flow.31 0=2 1=1 2=5.000000e-01
Split                    splitncnn_45             1 2 flow.31 flow.31_splitncnn_0 flow.31_splitncnn_1
Crop                     Slice_651                1 1 flow.31_splitncnn_1 onnx::Pow_1108 -23309=1,0 -23310=1,32 -23311=1,0
rife.Warp                warp_9                   2 1 x.35_splitncnn_1 onnx::Pow_1108 onnx::Concat_1109 0=6
Convolution              Conv_653                 1 1 x.35_splitncnn_0 onnx::PRelu_1110 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_654                1 1 onnx::PRelu_1110 input.327 0=64
Convolution              Conv_655                 1 1 input.327 onnx::PRelu_1114 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_656                1 1 onnx::PRelu_1114 x.39 0=64
Split                    splitncnn_46             1 2 x.39 x.39_splitncnn_0 x.39_splitncnn_1
Interp                   Resize_657               1 1 flow.31_splitncnn_0 onnx::Mul_1122 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_659                  1 1 onnx::Mul_1122 flow.35 0=2 1=1 2=5.000000e-01
Split                    splitncnn_47             1 2 flow.35 flow.35_splitncnn_0 flow.35_splitncnn_1
Crop                     Slice_664                1 1 flow.35_splitncnn_1 onnx::Pow_1129 -23309=1,0 -23310=1,64 -23311=1,0
