7767517
512 731
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 9 in0 input_splitncnn_0 input_splitncnn_1 input_splitncnn_2 input_splitncnn_3 input_splitncnn_4 input_splitncnn_5 input_splitncnn_6 input_splitncnn_7 input_splitncnn_8
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 9 in1 input2_splitncnn_0 input2_splitncnn_1 input2_splitncnn_2 input2_splitncnn_3 input2_splitncnn_4 input2_splitncnn_5 input2_splitncnn_6 input2_splitncnn_7 input2_splitncnn_8
Input                    in2                      0 1 in2
Concat                   Concat_0                 2 1 input_splitncnn_8 input2_splitncnn_8 onnx::Slice_193
Crop                     Slice_5                  1 1 onnx::Slice_193 onnx::Mul_198 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_7                    1 1 onnx::Mul_198 onnx::Add_200 0=2 1=1
BinaryOp                 Add_9                    1 1 onnx::Add_200 onnx::Mul_202 1=1 2=1.000000e+00
BinaryOp                 Mul_10                   2 1 onnx::Mul_202 in2 onnx::Concat_203 0=2
Split                    splitncnn_0              1 8 onnx::Concat_203 onnx::Concat_203_splitncnn_0 onnx::Concat_203_splitncnn_1 onnx::Concat_203_splitncnn_2 onnx::Concat_203_splitncnn_3 onnx::Concat_203_splitncnn_4 onnx::Concat_203_splitncnn_5 onnx::Concat_203_splitncnn_6 onnx::Concat_203_splitncnn_7
Crop                     Slice_15                 1 1 input_splitncnn_7 onnx::Concat_208 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_20                 1 1 input2_splitncnn_7 onnx::Concat_213 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_21                3 1 onnx::Concat_208 onnx::Concat_213 onnx::Concat_203_splitncnn_7 x
Interp                   Resize_22                1 1 x input.1 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_23                  1 1 input.1 onnx::PRelu_220 0=96 1=3 3=2 4=1 5=1 6=6048
PReLU                    PRelu_24                 1 1 onnx::PRelu_220 input.3 0=96
Convolution              Conv_25                  1 1 input.3 onnx::PRelu_224 0=192 1=3 3=2 4=1 5=1 6=165888
PReLU                    PRelu_26                 1 1 onnx::PRelu_224 input.7 0=192
Split                    splitncnn_1              1 2 input.7 input.7_splitncnn_0 input.7_splitncnn_1
Convolution              Conv_27                  1 1 input.7_splitncnn_1 onnx::PRelu_228 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_28                 1 1 onnx::PRelu_228 input.11 0=192
Convolution              Conv_29                  1 1 input.11 onnx::PRelu_232 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_30                 1 1 onnx::PRelu_232 input.15 0=192
Convolution              Conv_31                  1 1 input.15 onnx::PRelu_236 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_32                 1 1 onnx::PRelu_236 input.19 0=192
Convolution              Conv_33                  1 1 input.19 onnx::PRelu_240 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_34                 1 1 onnx::PRelu_240 input.23 0=192
Convolution              Conv_35                  1 1 input.23 onnx::PRelu_244 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_36                 1 1 onnx::PRelu_244 input.27 0=192
Convolution              Conv_37                  1 1 input.27 onnx::PRelu_248 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_38                 1 1 onnx::PRelu_248 input.31 0=192
Convolution              Conv_39                  1 1 input.31 onnx::PRelu_252 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_40                 1 1 onnx::PRelu_252 input.35 0=192
Convolution              Conv_41                  1 1 input.35 onnx::PRelu_256 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_42                 1 1 onnx::PRelu_256 onnx::Add_259 0=192
BinaryOp                 Add_43                   2 1 onnx::Add_259 input.7_splitncnn_0 onnx::ConvTranspose_260
Deconvolution            ConvTranspose_44         1 1 onnx::ConvTranspose_260 tmp 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   Resize_45                1 1 tmp onnx::Slice_266 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_2              1 2 onnx::Slice_266 onnx::Slice_266_splitncnn_0 onnx::Slice_266_splitncnn_1
Crop                     Slice_50                 1 1 onnx::Slice_266_splitncnn_1 onnx::Mul_271 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_52                   1 1 onnx::Mul_271 onnx::Mul_273 0=2 1=1 2=8.000000e+00
Crop                     Slice_59                 1 1 onnx::Slice_266_splitncnn_0 onnx::Add_280 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_64                 1 1 input2_splitncnn_6 onnx::Concat_285 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_69                 1 1 input_splitncnn_6 onnx::Concat_290 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_71                   1 1 onnx::Concat_203_splitncnn_6 onnx::Concat_292 0=7 1=1 2=1.000000e+00
Concat                   Concat_72                3 1 onnx::Concat_285 onnx::Concat_290 onnx::Concat_292 x.3
Interp                   Resize_73                1 1 x.3 input.39 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_74                  1 1 input.39 onnx::PRelu_299 0=96 1=3 3=2 4=1 5=1 6=6048
PReLU                    PRelu_75                 1 1 onnx::PRelu_299 input.43 0=96
Convolution              Conv_76                  1 1 input.43 onnx::PRelu_303 0=192 1=3 3=2 4=1 5=1 6=165888
PReLU                    PRelu_77                 1 1 onnx::PRelu_303 input.47 0=192
Split                    splitncnn_3              1 2 input.47 input.47_splitncnn_0 input.47_splitncnn_1
Convolution              Conv_78                  1 1 input.47_splitncnn_1 onnx::PRelu_307 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_79                 1 1 onnx::PRelu_307 input.51 0=192
Convolution              Conv_80                  1 1 input.51 onnx::PRelu_311 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_81                 1 1 onnx::PRelu_311 input.55 0=192
Convolution              Conv_82                  1 1 input.55 onnx::PRelu_315 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_83                 1 1 onnx::PRelu_315 input.59 0=192
Convolution              Conv_84                  1 1 input.59 onnx::PRelu_319 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_85                 1 1 onnx::PRelu_319 input.63 0=192
Convolution              Conv_86                  1 1 input.63 onnx::PRelu_323 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_87                 1 1 onnx::PRelu_323 input.67 0=192
Convolution              Conv_88                  1 1 input.67 onnx::PRelu_327 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_89                 1 1 onnx::PRelu_327 input.71 0=192
Convolution              Conv_90                  1 1 input.71 onnx::PRelu_331 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_91                 1 1 onnx::PRelu_331 input.75 0=192
Convolution              Conv_92                  1 1 input.75 onnx::PRelu_335 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_93                 1 1 onnx::PRelu_335 onnx::Add_338 0=192
BinaryOp                 Add_94                   2 1 onnx::Add_338 input.47_splitncnn_0 onnx::ConvTranspose_339
Deconvolution            ConvTranspose_95         1 1 onnx::ConvTranspose_339 tmp.3 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   Resize_96                1 1 tmp.3 onnx::Slice_345 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_4              1 2 onnx::Slice_345 onnx::Slice_345_splitncnn_0 onnx::Slice_345_splitncnn_1
Crop                     Slice_101                1 1 onnx::Slice_345_splitncnn_1 onnx::Mul_350 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_103                  1 1 onnx::Mul_350 onnx::Mul_352 0=2 1=1 2=8.000000e+00
BinaryOp                 Mul_105                  1 1 onnx::Mul_352 onnx::Slice_354 0=2 1=1 2=2.000000e+00
Split                    splitncnn_5              1 2 onnx::Slice_354 onnx::Slice_354_splitncnn_0 onnx::Slice_354_splitncnn_1
Crop                     Slice_110                1 1 onnx::Slice_345_splitncnn_0 onnx::Neg_359 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_115                1 1 onnx::Slice_354_splitncnn_1 onnx::Concat_364 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_120                1 1 onnx::Slice_354_splitncnn_0 onnx::Concat_369 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_121               2 1 onnx::Concat_364 onnx::Concat_369 onnx::Add_370
Eltwise                  Add_122                  2 1 onnx::Mul_273 onnx::Add_370 onnx::Div_371 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_124                  1 1 onnx::Div_371 flow 0=3 1=1 2=2.000000e+00
Split                    splitncnn_6              1 6 flow flow_splitncnn_0 flow_splitncnn_1 flow_splitncnn_2 flow_splitncnn_3 flow_splitncnn_4 flow_splitncnn_5
UnaryOp                  Neg_125                  1 1 onnx::Neg_359 onnx::Add_374 0=1
BinaryOp                 Add_126                  2 1 onnx::Add_280 onnx::Add_374 onnx::Div_375
BinaryOp                 Div_128                  1 1 onnx::Div_375 onnx::Concat_377 0=3 1=1 2=2.000000e+00
Split                    splitncnn_7              1 3 onnx::Concat_377 onnx::Concat_377_splitncnn_0 onnx::Concat_377_splitncnn_1 onnx::Concat_377_splitncnn_2
Crop                     Slice_133                1 1 flow_splitncnn_5 onnx::Pow_382 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_0                   2 1 input_splitncnn_5 onnx::Pow_382 onnx::Slice_383 0=6
Split                    splitncnn_8              1 2 onnx::Slice_383 onnx::Slice_383_splitncnn_0 onnx::Slice_383_splitncnn_1
Crop                     Slice_139                1 1 flow_splitncnn_4 onnx::Pow_388 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_1                   2 1 input2_splitncnn_5 onnx::Pow_388 onnx::Slice_389 0=6
Split                    splitncnn_9              1 2 onnx::Slice_389 onnx::Slice_389_splitncnn_0 onnx::Slice_389_splitncnn_1
Crop                     Slice_145                1 1 onnx::Slice_383_splitncnn_1 onnx::Concat_394 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_150                1 1 onnx::Slice_389_splitncnn_1 onnx::Concat_399 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_151               4 1 onnx::Concat_394 onnx::Concat_399 onnx::Concat_203_splitncnn_5 onnx::Concat_377_splitncnn_2 x.7
Interp                   Resize_152               1 1 x.7 onnx::Concat_405 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_153               1 1 flow_splitncnn_3 onnx::Mul_410 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_155                  1 1 onnx::Mul_410 onnx::Div_412 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_157                  1 1 onnx::Div_412 onnx::Concat_414 0=3 1=1 2=4.000000e+00
Concat                   Concat_158               2 1 onnx::Concat_405 onnx::Concat_414 input.79
Convolution              Conv_159                 1 1 input.79 onnx::PRelu_416 0=64 1=3 3=2 4=1 5=1 6=6912
PReLU                    PRelu_160                1 1 onnx::PRelu_416 input.83 0=64
Convolution              Conv_161                 1 1 input.83 onnx::PRelu_420 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_162                1 1 onnx::PRelu_420 input.87 0=128
Split                    splitncnn_10             1 2 input.87 input.87_splitncnn_0 input.87_splitncnn_1
Convolution              Conv_163                 1 1 input.87_splitncnn_1 onnx::PRelu_424 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_164                1 1 onnx::PRelu_424 input.91 0=128
Convolution              Conv_165                 1 1 input.91 onnx::PRelu_428 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_166                1 1 onnx::PRelu_428 input.95 0=128
Convolution              Conv_167                 1 1 input.95 onnx::PRelu_432 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_168                1 1 onnx::PRelu_432 input.99 0=128
Convolution              Conv_169                 1 1 input.99 onnx::PRelu_436 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_170                1 1 onnx::PRelu_436 input.103 0=128
Convolution              Conv_171                 1 1 input.103 onnx::PRelu_440 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_172                1 1 onnx::PRelu_440 input.107 0=128
Convolution              Conv_173                 1 1 input.107 onnx::PRelu_444 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_174                1 1 onnx::PRelu_444 input.111 0=128
Convolution              Conv_175                 1 1 input.111 onnx::PRelu_448 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_176                1 1 onnx::PRelu_448 input.115 0=128
Convolution              Conv_177                 1 1 input.115 onnx::PRelu_452 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_178                1 1 onnx::PRelu_452 onnx::Add_455 0=128
BinaryOp                 Add_179                  2 1 onnx::Add_455 input.87_splitncnn_0 onnx::ConvTranspose_456
Deconvolution            ConvTranspose_180        1 1 onnx::ConvTranspose_456 tmp.7 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   Resize_181               1 1 tmp.7 onnx::Slice_462 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_11             1 2 onnx::Slice_462 onnx::Slice_462_splitncnn_0 onnx::Slice_462_splitncnn_1
Crop                     Slice_186                1 1 onnx::Slice_462_splitncnn_1 onnx::Mul_467 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_188                  1 1 onnx::Mul_467 onnx::Mul_469 0=2 1=1 2=4.000000e+00
Crop                     Slice_195                1 1 onnx::Slice_462_splitncnn_0 onnx::Add_476 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_200                1 1 onnx::Slice_389_splitncnn_0 onnx::Concat_481 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_205                1 1 onnx::Slice_383_splitncnn_0 onnx::Concat_486 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_207                  1 1 onnx::Concat_203_splitncnn_4 onnx::Concat_488 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_208                  1 1 onnx::Concat_377_splitncnn_1 onnx::Concat_489 0=1
Concat                   Concat_209               4 1 onnx::Concat_481 onnx::Concat_486 onnx::Concat_488 onnx::Concat_489 x.11
Crop                     Slice_214                1 1 flow_splitncnn_2 onnx::Concat_495 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_219                1 1 flow_splitncnn_1 onnx::Concat_500 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_220               2 1 onnx::Concat_495 onnx::Concat_500 flow.3
Interp                   Resize_221               1 1 x.11 onnx::Concat_506 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_222               1 1 flow.3 onnx::Mul_511 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_224                  1 1 onnx::Mul_511 onnx::Div_513 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_226                  1 1 onnx::Div_513 onnx::Concat_515 0=3 1=1 2=4.000000e+00
Concat                   Concat_227               2 1 onnx::Concat_506 onnx::Concat_515 input.119
Convolution              Conv_228                 1 1 input.119 onnx::PRelu_517 0=64 1=3 3=2 4=1 5=1 6=6912
PReLU                    PRelu_229                1 1 onnx::PRelu_517 input.123 0=64
Convolution              Conv_230                 1 1 input.123 onnx::PRelu_521 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_231                1 1 onnx::PRelu_521 input.127 0=128
Split                    splitncnn_12             1 2 input.127 input.127_splitncnn_0 input.127_splitncnn_1
Convolution              Conv_232                 1 1 input.127_splitncnn_1 onnx::PRelu_525 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_233                1 1 onnx::PRelu_525 input.131 0=128
Convolution              Conv_234                 1 1 input.131 onnx::PRelu_529 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_235                1 1 onnx::PRelu_529 input.135 0=128
Convolution              Conv_236                 1 1 input.135 onnx::PRelu_533 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_237                1 1 onnx::PRelu_533 input.139 0=128
Convolution              Conv_238                 1 1 input.139 onnx::PRelu_537 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_239                1 1 onnx::PRelu_537 input.143 0=128
Convolution              Conv_240                 1 1 input.143 onnx::PRelu_541 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_241                1 1 onnx::PRelu_541 input.147 0=128
Convolution              Conv_242                 1 1 input.147 onnx::PRelu_545 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_243                1 1 onnx::PRelu_545 input.151 0=128
Convolution              Conv_244                 1 1 input.151 onnx::PRelu_549 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_245                1 1 onnx::PRelu_549 input.155 0=128
Convolution              Conv_246                 1 1 input.155 onnx::PRelu_553 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_247                1 1 onnx::PRelu_553 onnx::Add_556 0=128
BinaryOp                 Add_248                  2 1 onnx::Add_556 input.127_splitncnn_0 onnx::ConvTranspose_557
Deconvolution            ConvTranspose_249        1 1 onnx::ConvTranspose_557 tmp.11 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   Resize_250               1 1 tmp.11 onnx::Slice_563 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_13             1 2 onnx::Slice_563 onnx::Slice_563_splitncnn_0 onnx::Slice_563_splitncnn_1
Crop                     Slice_255                1 1 onnx::Slice_563_splitncnn_1 onnx::Mul_568 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_257                  1 1 onnx::Mul_568 onnx::Mul_570 0=2 1=1 2=4.000000e+00
BinaryOp                 Mul_259                  1 1 onnx::Mul_570 onnx::Slice_572 0=2 1=1 2=2.000000e+00
Split                    splitncnn_14             1 2 onnx::Slice_572 onnx::Slice_572_splitncnn_0 onnx::Slice_572_splitncnn_1
Crop                     Slice_264                1 1 onnx::Slice_563_splitncnn_0 onnx::Neg_577 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_269                1 1 onnx::Slice_572_splitncnn_1 onnx::Concat_582 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_274                1 1 onnx::Slice_572_splitncnn_0 onnx::Concat_587 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_275               2 1 onnx::Concat_582 onnx::Concat_587 onnx::Add_588
Eltwise                  Add_276                  2 1 onnx::Mul_469 onnx::Add_588 onnx::Div_589 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_278                  1 1 onnx::Div_589 onnx::Add_591 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_279                  1 1 onnx::Neg_577 onnx::Add_592 0=1
BinaryOp                 Add_280                  2 1 onnx::Add_476 onnx::Add_592 onnx::Div_593
BinaryOp                 Div_282                  1 1 onnx::Div_593 onnx::Add_595 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_283                  2 1 flow_splitncnn_0 onnx::Add_591 flow.7
Split                    splitncnn_15             1 6 flow.7 flow.7_splitncnn_0 flow.7_splitncnn_1 flow.7_splitncnn_2 flow.7_splitncnn_3 flow.7_splitncnn_4 flow.7_splitncnn_5
BinaryOp                 Add_284                  2 1 onnx::Concat_377_splitncnn_0 onnx::Add_595 onnx::Concat_597
Split                    splitncnn_16             1 3 onnx::Concat_597 onnx::Concat_597_splitncnn_0 onnx::Concat_597_splitncnn_1 onnx::Concat_597_splitncnn_2
Crop                     Slice_289                1 1 flow.7_splitncnn_5 onnx::Pow_602 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_2                   2 1 input_splitncnn_4 onnx::Pow_602 onnx::Slice_603 0=6
Split                    splitncnn_17             1 2 onnx::Slice_603 onnx::Slice_603_splitncnn_0 onnx::Slice_603_splitncnn_1
Crop                     Slice_295                1 1 flow.7_splitncnn_4 onnx::Pow_608 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_3                   2 1 input2_splitncnn_4 onnx::Pow_608 onnx::Slice_609 0=6
Split                    splitncnn_18             1 2 onnx::Slice_609 onnx::Slice_609_splitncnn_0 onnx::Slice_609_splitncnn_1
Crop                     Slice_301                1 1 onnx::Slice_603_splitncnn_1 onnx::Concat_614 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_306                1 1 onnx::Slice_609_splitncnn_1 onnx::Concat_619 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_307               4 1 onnx::Concat_614 onnx::Concat_619 onnx::Concat_203_splitncnn_3 onnx::Concat_597_splitncnn_2 x.15
Interp                   Resize_308               1 1 x.15 onnx::Concat_625 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_309               1 1 flow.7_splitncnn_3 onnx::Mul_630 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_311                  1 1 onnx::Mul_630 onnx::Div_632 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_313                  1 1 onnx::Div_632 onnx::Concat_634 0=3 1=1 2=2.000000e+00
Concat                   Concat_314               2 1 onnx::Concat_625 onnx::Concat_634 input.159
Convolution              Conv_315                 1 1 input.159 onnx::PRelu_636 0=48 1=3 3=2 4=1 5=1 6=5184
PReLU                    PRelu_316                1 1 onnx::PRelu_636 input.163 0=48
Convolution              Conv_317                 1 1 input.163 onnx::PRelu_640 0=96 1=3 3=2 4=1 5=1 6=41472
PReLU                    PRelu_318                1 1 onnx::PRelu_640 input.167 0=96
Split                    splitncnn_19             1 2 input.167 input.167_splitncnn_0 input.167_splitncnn_1
Convolution              Conv_319                 1 1 input.167_splitncnn_1 onnx::PRelu_644 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_320                1 1 onnx::PRelu_644 input.171 0=96
Convolution              Conv_321                 1 1 input.171 onnx::PRelu_648 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_322                1 1 onnx::PRelu_648 input.175 0=96
Convolution              Conv_323                 1 1 input.175 onnx::PRelu_652 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_324                1 1 onnx::PRelu_652 input.179 0=96
Convolution              Conv_325                 1 1 input.179 onnx::PRelu_656 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_326                1 1 onnx::PRelu_656 input.183 0=96
Convolution              Conv_327                 1 1 input.183 onnx::PRelu_660 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_328                1 1 onnx::PRelu_660 input.187 0=96
Convolution              Conv_329                 1 1 input.187 onnx::PRelu_664 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_330                1 1 onnx::PRelu_664 input.191 0=96
Convolution              Conv_331                 1 1 input.191 onnx::PRelu_668 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_332                1 1 onnx::PRelu_668 input.195 0=96
Convolution              Conv_333                 1 1 input.195 onnx::PRelu_672 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_334                1 1 onnx::PRelu_672 onnx::Add_675 0=96
BinaryOp                 Add_335                  2 1 onnx::Add_675 input.167_splitncnn_0 onnx::ConvTranspose_676
Deconvolution            ConvTranspose_336        1 1 onnx::ConvTranspose_676 tmp.15 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   Resize_337               1 1 tmp.15 onnx::Slice_682 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_20             1 2 onnx::Slice_682 onnx::Slice_682_splitncnn_0 onnx::Slice_682_splitncnn_1
Crop                     Slice_342                1 1 onnx::Slice_682_splitncnn_1 onnx::Mul_687 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_344                  1 1 onnx::Mul_687 onnx::Mul_689 0=2 1=1 2=2.000000e+00
Crop                     Slice_351                1 1 onnx::Slice_682_splitncnn_0 onnx::Add_696 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_356                1 1 onnx::Slice_609_splitncnn_0 onnx::Concat_701 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_361                1 1 onnx::Slice_603_splitncnn_0 onnx::Concat_706 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_363                  1 1 onnx::Concat_203_splitncnn_2 onnx::Concat_708 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_364                  1 1 onnx::Concat_597_splitncnn_1 onnx::Concat_709 0=1
Concat                   Concat_365               4 1 onnx::Concat_701 onnx::Concat_706 onnx::Concat_708 onnx::Concat_709 x.19
Crop                     Slice_370                1 1 flow.7_splitncnn_2 onnx::Concat_715 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_375                1 1 flow.7_splitncnn_1 onnx::Concat_720 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_376               2 1 onnx::Concat_715 onnx::Concat_720 flow.11
Interp                   Resize_377               1 1 x.19 onnx::Concat_726 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_378               1 1 flow.11 onnx::Mul_731 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_380                  1 1 onnx::Mul_731 onnx::Div_733 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_382                  1 1 onnx::Div_733 onnx::Concat_735 0=3 1=1 2=2.000000e+00
Concat                   Concat_383               2 1 onnx::Concat_726 onnx::Concat_735 input.199
Convolution              Conv_384                 1 1 input.199 onnx::PRelu_737 0=48 1=3 3=2 4=1 5=1 6=5184
PReLU                    PRelu_385                1 1 onnx::PRelu_737 input.203 0=48
Convolution              Conv_386                 1 1 input.203 onnx::PRelu_741 0=96 1=3 3=2 4=1 5=1 6=41472
PReLU                    PRelu_387                1 1 onnx::PRelu_741 input.207 0=96
Split                    splitncnn_21             1 2 input.207 input.207_splitncnn_0 input.207_splitncnn_1
Convolution              Conv_388                 1 1 input.207_splitncnn_1 onnx::PRelu_745 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_389                1 1 onnx::PRelu_745 input.211 0=96
Convolution              Conv_390                 1 1 input.211 onnx::PRelu_749 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_391                1 1 onnx::PRelu_749 input.215 0=96
Convolution              Conv_392                 1 1 input.215 onnx::PRelu_753 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_393                1 1 onnx::PRelu_753 input.219 0=96
Convolution              Conv_394                 1 1 input.219 onnx::PRelu_757 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_395                1 1 onnx::PRelu_757 input.223 0=96
Convolution              Conv_396                 1 1 input.223 onnx::PRelu_761 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_397                1 1 onnx::PRelu_761 input.227 0=96
Convolution              Conv_398                 1 1 input.227 onnx::PRelu_765 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_399                1 1 onnx::PRelu_765 input.231 0=96
Convolution              Conv_400                 1 1 input.231 onnx::PRelu_769 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_401                1 1 onnx::PRelu_769 input.235 0=96
Convolution              Conv_402                 1 1 input.235 onnx::PRelu_773 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_403                1 1 onnx::PRelu_773 onnx::Add_776 0=96
BinaryOp                 Add_404                  2 1 onnx::Add_776 input.207_splitncnn_0 onnx::ConvTranspose_777
Deconvolution            ConvTranspose_405        1 1 onnx::ConvTranspose_777 tmp.19 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   Resize_406               1 1 tmp.19 onnx::Slice_783 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_22             1 2 onnx::Slice_783 onnx::Slice_783_splitncnn_0 onnx::Slice_783_splitncnn_1
Crop                     Slice_411                1 1 onnx::Slice_783_splitncnn_1 onnx::Mul_788 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_413                  1 1 onnx::Mul_788 onnx::Mul_790 0=2 1=1 2=2.000000e+00
BinaryOp                 Mul_415                  1 1 onnx::Mul_790 onnx::Slice_792 0=2 1=1 2=2.000000e+00
Split                    splitncnn_23             1 2 onnx::Slice_792 onnx::Slice_792_splitncnn_0 onnx::Slice_792_splitncnn_1
Crop                     Slice_420                1 1 onnx::Slice_783_splitncnn_0 onnx::Neg_797 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_425                1 1 onnx::Slice_792_splitncnn_1 onnx::Concat_802 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_430                1 1 onnx::Slice_792_splitncnn_0 onnx::Concat_807 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_431               2 1 onnx::Concat_802 onnx::Concat_807 onnx::Add_808
Eltwise                  Add_432                  2 1 onnx::Mul_689 onnx::Add_808 onnx::Div_809 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_434                  1 1 onnx::Div_809 onnx::Add_811 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_435                  1 1 onnx::Neg_797 onnx::Add_812 0=1
BinaryOp                 Add_436                  2 1 onnx::Add_696 onnx::Add_812 onnx::Div_813
BinaryOp                 Div_438                  1 1 onnx::Div_813 onnx::Add_815 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_439                  2 1 flow.7_splitncnn_0 onnx::Add_811 flow.15
Split                    splitncnn_24             1 6 flow.15 flow.15_splitncnn_0 flow.15_splitncnn_1 flow.15_splitncnn_2 flow.15_splitncnn_3 flow.15_splitncnn_4 flow.15_splitncnn_5
BinaryOp                 Add_440                  2 1 onnx::Concat_597_splitncnn_0 onnx::Add_815 onnx::Concat_817
Split                    splitncnn_25             1 3 onnx::Concat_817 onnx::Concat_817_splitncnn_0 onnx::Concat_817_splitncnn_1 onnx::Concat_817_splitncnn_2
Crop                     Slice_445                1 1 flow.15_splitncnn_5 onnx::Pow_822 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_4                   2 1 input_splitncnn_3 onnx::Pow_822 onnx::Slice_823 0=6
Split                    splitncnn_26             1 2 onnx::Slice_823 onnx::Slice_823_splitncnn_0 onnx::Slice_823_splitncnn_1
Crop                     Slice_451                1 1 flow.15_splitncnn_4 onnx::Pow_828 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_5                   2 1 input2_splitncnn_3 onnx::Pow_828 onnx::Slice_829 0=6
Split                    splitncnn_27             1 2 onnx::Slice_829 onnx::Slice_829_splitncnn_0 onnx::Slice_829_splitncnn_1
Crop                     Slice_457                1 1 onnx::Slice_823_splitncnn_1 onnx::Concat_834 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_462                1 1 onnx::Slice_829_splitncnn_1 onnx::Concat_839 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_463               4 1 onnx::Concat_834 onnx::Concat_839 onnx::Concat_203_splitncnn_1 onnx::Concat_817_splitncnn_2 x.23
Interp                   Resize_464               1 1 x.23 onnx::Concat_845 0=2
Interp                   Resize_465               1 1 flow.15_splitncnn_3 onnx::Mul_850 0=2
BinaryOp                 Mul_467                  1 1 onnx::Mul_850 onnx::Div_852 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_469                  1 1 onnx::Div_852 onnx::Concat_854 0=3 1=1 2=1.000000e+00
Concat                   Concat_470               2 1 onnx::Concat_845 onnx::Concat_854 input.239
Convolution              Conv_471                 1 1 input.239 onnx::PRelu_856 0=32 1=3 3=2 4=1 5=1 6=3456
PReLU                    PRelu_472                1 1 onnx::PRelu_856 input.243 0=32
Convolution              Conv_473                 1 1 input.243 onnx::PRelu_860 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_474                1 1 onnx::PRelu_860 input.247 0=64
Split                    splitncnn_28             1 2 input.247 input.247_splitncnn_0 input.247_splitncnn_1
Convolution              Conv_475                 1 1 input.247_splitncnn_1 onnx::PRelu_864 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_476                1 1 onnx::PRelu_864 input.251 0=64
Convolution              Conv_477                 1 1 input.251 onnx::PRelu_868 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_478                1 1 onnx::PRelu_868 input.255 0=64
Convolution              Conv_479                 1 1 input.255 onnx::PRelu_872 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_480                1 1 onnx::PRelu_872 input.259 0=64
Convolution              Conv_481                 1 1 input.259 onnx::PRelu_876 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_482                1 1 onnx::PRelu_876 input.263 0=64
Convolution              Conv_483                 1 1 input.263 onnx::PRelu_880 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_484                1 1 onnx::PRelu_880 input.267 0=64
Convolution              Conv_485                 1 1 input.267 onnx::PRelu_884 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_486                1 1 onnx::PRelu_884 input.271 0=64
Convolution              Conv_487                 1 1 input.271 onnx::PRelu_888 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_488                1 1 onnx::PRelu_888 input.275 0=64
Convolution              Conv_489                 1 1 input.275 onnx::PRelu_892 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_490                1 1 onnx::PRelu_892 onnx::Add_895 0=64
BinaryOp                 Add_491                  2 1 onnx::Add_895 input.247_splitncnn_0 onnx::ConvTranspose_896
Deconvolution            ConvTranspose_492        1 1 onnx::ConvTranspose_896 tmp.23 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   Resize_493               1 1 tmp.23 onnx::Slice_902 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_29             1 2 onnx::Slice_902 onnx::Slice_902_splitncnn_0 onnx::Slice_902_splitncnn_1
Crop                     Slice_498                1 1 onnx::Slice_902_splitncnn_1 onnx::Mul_907 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_505                1 1 onnx::Slice_902_splitncnn_0 onnx::Add_914 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_510                1 1 onnx::Slice_829_splitncnn_0 onnx::Concat_919 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_515                1 1 onnx::Slice_823_splitncnn_0 onnx::Concat_924 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_517                  1 1 onnx::Concat_203_splitncnn_0 onnx::Concat_926 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_518                  1 1 onnx::Concat_817_splitncnn_1 onnx::Concat_927 0=1
Concat                   Concat_519               4 1 onnx::Concat_919 onnx::Concat_924 onnx::Concat_926 onnx::Concat_927 x.27
Crop                     Slice_524                1 1 flow.15_splitncnn_2 onnx::Concat_933 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_529                1 1 flow.15_splitncnn_1 onnx::Concat_938 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_530               2 1 onnx::Concat_933 onnx::Concat_938 flow.19
Interp                   Resize_531               1 1 x.27 onnx::Concat_944 0=2
Interp                   Resize_532               1 1 flow.19 onnx::Mul_949 0=2
BinaryOp                 Mul_534                  1 1 onnx::Mul_949 onnx::Div_951 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_536                  1 1 onnx::Div_951 onnx::Concat_953 0=3 1=1 2=1.000000e+00
Concat                   Concat_537               2 1 onnx::Concat_944 onnx::Concat_953 input.279
Convolution              Conv_538                 1 1 input.279 onnx::PRelu_955 0=32 1=3 3=2 4=1 5=1 6=3456
PReLU                    PRelu_539                1 1 onnx::PRelu_955 input.283 0=32
Convolution              Conv_540                 1 1 input.283 onnx::PRelu_959 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_541                1 1 onnx::PRelu_959 input.287 0=64
Split                    splitncnn_30             1 2 input.287 input.287_splitncnn_0 input.287_splitncnn_1
Convolution              Conv_542                 1 1 input.287_splitncnn_1 onnx::PRelu_963 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_543                1 1 onnx::PRelu_963 input.291 0=64
Convolution              Conv_544                 1 1 input.291 onnx::PRelu_967 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_545                1 1 onnx::PRelu_967 input.295 0=64
Convolution              Conv_546                 1 1 input.295 onnx::PRelu_971 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_547                1 1 onnx::PRelu_971 input.299 0=64
Convolution              Conv_548                 1 1 input.299 onnx::PRelu_975 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_549                1 1 onnx::PRelu_975 input.303 0=64
Convolution              Conv_550                 1 1 input.303 onnx::PRelu_979 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_551                1 1 onnx::PRelu_979 input.307 0=64
Convolution              Conv_552                 1 1 input.307 onnx::PRelu_983 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_553                1 1 onnx::PRelu_983 input.311 0=64
Convolution              Conv_554                 1 1 input.311 onnx::PRelu_987 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_555                1 1 onnx::PRelu_987 input.315 0=64
Convolution              Conv_556                 1 1 input.315 onnx::PRelu_991 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_557                1 1 onnx::PRelu_991 onnx::Add_994 0=64
BinaryOp                 Add_558                  2 1 onnx::Add_994 input.287_splitncnn_0 onnx::ConvTranspose_995
Deconvolution            ConvTranspose_559        1 1 onnx::ConvTranspose_995 tmp.27 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   Resize_560               1 1 tmp.27 onnx::Slice_1001 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_31             1 2 onnx::Slice_1001 onnx::Slice_1001_splitncnn_0 onnx::Slice_1001_splitncnn_1
Crop                     Slice_565                1 1 onnx::Slice_1001_splitncnn_1 onnx::Mul_1006 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_567                  1 1 onnx::Mul_1006 onnx::Slice_1008 0=2 1=1 2=2.000000e+00
Split                    splitncnn_32             1 2 onnx::Slice_1008 onnx::Slice_1008_splitncnn_0 onnx::Slice_1008_splitncnn_1
Crop                     Slice_572                1 1 onnx::Slice_1001_splitncnn_0 onnx::Neg_1013 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_577                1 1 onnx::Slice_1008_splitncnn_1 onnx::Concat_1018 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_582                1 1 onnx::Slice_1008_splitncnn_0 onnx::Concat_1023 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_583               2 1 onnx::Concat_1018 onnx::Concat_1023 onnx::Add_1024
Eltwise                  Add_584                  2 1 onnx::Mul_907 onnx::Add_1024 onnx::Div_1025 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_586                  1 1 onnx::Div_1025 onnx::Add_1027 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_587                  1 1 onnx::Neg_1013 onnx::Add_1028 0=1
BinaryOp                 Add_588                  2 1 onnx::Add_914 onnx::Add_1028 onnx::Div_1029
BinaryOp                 Div_590                  1 1 onnx::Div_1029 onnx::Add_1031 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_591                  2 1 flow.15_splitncnn_0 onnx::Add_1027 onnx::Slice_1032
Split                    splitncnn_33             1 5 onnx::Slice_1032 onnx::Slice_1032_splitncnn_0 onnx::Slice_1032_splitncnn_1 onnx::Slice_1032_splitncnn_2 onnx::Slice_1032_splitncnn_3 onnx::Slice_1032_splitncnn_4
BinaryOp                 Add_592                  2 1 onnx::Concat_817_splitncnn_0 onnx::Add_1031 onnx::Sigmoid_1033
Split                    splitncnn_34             1 2 onnx::Sigmoid_1033 onnx::Sigmoid_1033_splitncnn_0 onnx::Sigmoid_1033_splitncnn_1
Crop                     Slice_597                1 1 onnx::Slice_1032_splitncnn_4 onnx::Pow_1038 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_6                   2 1 input_splitncnn_2 onnx::Pow_1038 onnx::Mul_1039 0=6
Split                    splitncnn_35             1 2 onnx::Mul_1039 onnx::Mul_1039_splitncnn_0 onnx::Mul_1039_splitncnn_1
Crop                     Slice_603                1 1 onnx::Slice_1032_splitncnn_3 onnx::Pow_1044 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_7                   2 1 input2_splitncnn_2 onnx::Pow_1044 onnx::Mul_1045 0=6
Split                    splitncnn_36             1 2 onnx::Mul_1045 onnx::Mul_1045_splitncnn_0 onnx::Mul_1045_splitncnn_1
Sigmoid                  Sigmoid_605              1 1 onnx::Sigmoid_1033_splitncnn_1 onnx::Mul_1046
Split                    splitncnn_37             1 2 onnx::Mul_1046 onnx::Mul_1046_splitncnn_0 onnx::Mul_1046_splitncnn_1
BinaryOp                 Mul_606                  2 1 onnx::Mul_1039_splitncnn_1 onnx::Mul_1046_splitncnn_1 onnx::Add_1047 0=2
BinaryOp                 Sub_608                  1 1 onnx::Mul_1046_splitncnn_0 onnx::Mul_1049 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_609                  2 1 onnx::Mul_1045_splitncnn_1 onnx::Mul_1049 onnx::Add_1050 0=2
BinaryOp                 Add_610                  2 1 onnx::Add_1047 onnx::Add_1050 onnx::Add_1051
Crop                     Slice_615                1 1 onnx::Slice_1032_splitncnn_2 onnx::Concat_1056 -23309=1,0 -23310=1,2 -23311=1,0
Split                    splitncnn_38             1 64 onnx::Concat_1056 onnx::Concat_1056_splitncnn_0 onnx::Concat_1056_splitncnn_1 onnx::Concat_1056_splitncnn_2 onnx::Concat_1056_splitncnn_3 onnx::Concat_1056_splitncnn_4 onnx::Concat_1056_splitncnn_5 onnx::Concat_1056_splitncnn_6 onnx::Concat_1056_splitncnn_7 onnx::Concat_1056_splitncnn_8 onnx::Concat_1056_splitncnn_9 onnx::Concat_1056_splitncnn_10 onnx::Concat_1056_splitncnn_11 onnx::Concat_1056_splitncnn_12 onnx::Concat_1056_splitncnn_13 onnx::Concat_1056_splitncnn_14 onnx::Concat_1056_splitncnn_15 onnx::Concat_1056_splitncnn_16 onnx::Concat_1056_splitncnn_17 onnx::Concat_1056_splitncnn_18 onnx::Concat_1056_splitncnn_19 onnx::Concat_1056_splitncnn_20 onnx::Concat_1056_splitncnn_21 onnx::Concat_1056_splitncnn_22 onnx::Concat_1056_splitncnn_23 onnx::Concat_1056_splitncnn_24 onnx::Concat_1056_splitncnn_25 onnx::Concat_1056_splitncnn_26 onnx::Concat_1056_splitncnn_27 onnx::Concat_1056_splitncnn_28 onnx::Concat_1056_splitncnn_29 onnx::Concat_1056_splitncnn_30 onnx::Concat_1056_splitncnn_31 onnx::Concat_1056_splitncnn_32 onnx::Concat_1056_splitncnn_33 onnx::Concat_1056_splitncnn_34 onnx::Concat_1056_splitncnn_35 onnx::Concat_1056_splitncnn_36 onnx::Concat_1056_splitncnn_37 onnx::Concat_1056_splitncnn_38 onnx::Concat_1056_splitncnn_39 onnx::Concat_1056_splitncnn_40 onnx::Concat_1056_splitncnn_41 onnx::Concat_1056_splitncnn_42 onnx::Concat_1056_splitncnn_43 onnx::Concat_1056_splitncnn_44 onnx::Concat_1056_splitncnn_45 onnx::Concat_1056_splitncnn_46 onnx::Concat_1056_splitncnn_47 onnx::Concat_1056_splitncnn_48 onnx::Concat_1056_splitncnn_49 onnx::Concat_1056_splitncnn_50 onnx::Concat_1056_splitncnn_51 onnx::Concat_1056_splitncnn_52 onnx::Concat_1056_splitncnn_53 onnx::Concat_1056_splitncnn_54 onnx::Concat_1056_splitncnn_55 onnx::Concat_1056_splitncnn_56 onnx::Concat_1056_splitncnn_57 onnx::Concat_1056_splitncnn_58 onnx::Concat_1056_splitncnn_59 onnx::Concat_1056_splitncnn_60 onnx::Concat_1056_splitncnn_61 onnx::Concat_1056_splitncnn_62 onnx::Concat_1056_splitncnn_63
Convolution              Conv_616                 1 1 input_splitncnn_1 onnx::PRelu_1057 0=16 1=3 3=2 4=1 5=1 6=432
PReLU                    PRelu_617                1 1 onnx::PRelu_1057 input.319 0=16
Convolution              Conv_618                 1 1 input.319 onnx::PRelu_1061 0=16 1=3 4=1 5=1 6=2304
PReLU                    PRelu_619                1 1 onnx::PRelu_1061 x.31 0=16
Split                    splitncnn_39             1 2 x.31 x.31_splitncnn_0 x.31_splitncnn_1
Concat                   Concat_620               64 1 onnx::Concat_1056_splitncnn_63 onnx::Concat_1056_splitncnn_62 onnx::Concat_1056_splitncnn_61 onnx::Concat_1056_splitncnn_60 onnx::Concat_1056_splitncnn_59 onnx::Concat_1056_splitncnn_58 onnx::Concat_1056_splitncnn_57 onnx::Concat_1056_splitncnn_56 onnx::Concat_1056_splitncnn_55 onnx::Concat_1056_splitncnn_54 onnx::Concat_1056_splitncnn_53 onnx::Concat_1056_splitncnn_52 onnx::Concat_1056_splitncnn_51 onnx::Concat_1056_splitncnn_50 onnx::Concat_1056_splitncnn_49 onnx::Concat_1056_splitncnn_48 onnx::Concat_1056_splitncnn_47 onnx::Concat_1056_splitncnn_46 onnx::Concat_1056_splitncnn_45 onnx::Concat_1056_splitncnn_44 onnx::Concat_1056_splitncnn_43 onnx::Concat_1056_splitncnn_42 onnx::Concat_1056_splitncnn_41 onnx::Concat_1056_splitncnn_40 onnx::Concat_1056_splitncnn_39 onnx::Concat_1056_splitncnn_38 onnx::Concat_1056_splitncnn_37 onnx::Concat_1056_splitncnn_36 onnx::Concat_1056_splitncnn_35 onnx::Concat_1056_splitncnn_34 onnx::Concat_1056_splitncnn_33 onnx::Concat_1056_splitncnn_32 onnx::Concat_1056_splitncnn_31 onnx::Concat_1056_splitncnn_30 onnx::Concat_1056_splitncnn_29 onnx::Concat_1056_splitncnn_28 onnx::Concat_1056_splitncnn_27 onnx::Concat_1056_splitncnn_26 onnx::Concat_1056_splitncnn_25 onnx::Concat_1056_splitncnn_24 onnx::Concat_1056_splitncnn_23 onnx::Concat_1056_splitncnn_22 onnx::Concat_1056_splitncnn_21 onnx::Concat_1056_splitncnn_20 onnx::Concat_1056_splitncnn_19 onnx::Concat_1056_splitncnn_18 onnx::Concat_1056_splitncnn_17 onnx::Concat_1056_splitncnn_16 onnx::Concat_1056_splitncnn_15 onnx::Concat_1056_splitncnn_14 onnx::Concat_1056_splitncnn_13 onnx::Concat_1056_splitncnn_12 onnx::Concat_1056_splitncnn_11 onnx::Concat_1056_splitncnn_10 onnx::Concat_1056_splitncnn_9 onnx::Concat_1056_splitncnn_8 onnx::Concat_1056_splitncnn_7 onnx::Concat_1056_splitncnn_6 onnx::Concat_1056_splitncnn_5 onnx::Concat_1056_splitncnn_4 onnx::Concat_1056_splitncnn_3 onnx::Concat_1056_splitncnn_2 onnx::Concat_1056_splitncnn_1 onnx::Concat_1056_splitncnn_0 flow.23
Interp                   Resize_621               1 1 flow.23 onnx::Mul_1070 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_623                  1 1 onnx::Mul_1070 flow.27 0=2 1=1 2=5.000000e-01
Split                    splitncnn_40             1 2 flow.27 flow.27_splitncnn_0 flow.27_splitncnn_1
Crop                     Slice_628                1 1 flow.27_splitncnn_1 onnx::Pow_1077 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_8                   2 1 x.31_splitncnn_1 onnx::Pow_1077 onnx::Concat_1078 0=6
Convolution              Conv_630                 1 1 x.31_splitncnn_0 onnx::PRelu_1079 0=32 1=3 3=2 4=1 5=1 6=4608
PReLU                    PRelu_631                1 1 onnx::PRelu_1079 input.323 0=32
Convolution              Conv_632                 1 1 input.323 onnx::PRelu_1083 0=32 1=3 4=1 5=1 6=9216
PReLU                    PRelu_633                1 1 onnx::PRelu_1083 x.35 0=32
Split                    splitncnn_41             1 2 x.35 x.35_splitncnn_0 x.35_splitncnn_1
Interp                   Resize_634               1 1 flow.27_splitncnn_0 onnx::Mul_1091 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_636                  1 1 onnx::Mul_1091 flow.31 0=2 1=1 2=5.000000e-01
Split                    splitncnn_42             1 2 flow.31 flow.31_splitncnn_0 flow.31_splitncnn_1
Crop                     Slice_641                1 1 flow.31_splitncnn_1 onnx::Pow_1098 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_9                   2 1 x.35_splitncnn_1 onnx::Pow_1098 onnx::Concat_1099 0=6
Convolution              Conv_643                 1 1 x.35_splitncnn_0 onnx::PRelu_1100 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_644                1 1 onnx::PRelu_1100 input.327 0=64
Convolution              Conv_645                 1 1 input.327 onnx::PRelu_1104 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_646                1 1 onnx::PRelu_1104 x.39 0=64
Split                    splitncnn_43             1 2 x.39 x.39_splitncnn_0 x.39_splitncnn_1
Interp                   Resize_647               1 1 flow.31_splitncnn_0 onnx::Mul_1112 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_649                  1 1 onnx::Mul_1112 flow.35 0=2 1=1 2=5.000000e-01
Split                    splitncnn_44             1 2 flow.35 flow.35_splitncnn_0 flow.35_splitncnn_1
Crop                     Slice_654                1 1 flow.35_splitncnn_1 onnx::Pow_1119 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_10                  2 1 x.39_splitncnn_1 onnx::Pow_1119 onnx::Concat_1120 0=6
Convolution              Conv_656                 1 1 x.39_splitncnn_0 onnx::PRelu_1121 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_657                1 1 onnx::PRelu_1121 input.331 0=128
