7767517
141 172
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 6 in0 in0_splitncnn_0 in0_splitncnn_1 in0_splitncnn_2 in0_splitncnn_3 in0_splitncnn_4 in0_splitncnn_5
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 6 in1 in1_splitncnn_0 in1_splitncnn_1 in1_splitncnn_2 in1_splitncnn_3 in1_splitncnn_4 in1_splitncnn_5
Input                    in2                      0 1 in2
Concat                   Concat_30                2 1 in0_splitncnn_5 in1_splitncnn_5 205
Crop                     Slice_35                 1 1 205 210 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_37                   1 1 210 212 0=2 1=1
BinaryOp                 Add_39                   1 1 212 214 1=1 2=1.000000e+00
BinaryOp                 Mul_40                   2 1 214 in2 215 0=2
Split                    splitncnn_0              1 4 215 215_splitncnn_0 215_splitncnn_1 215_splitncnn_2 215_splitncnn_3
Crop                     Slice_47                 1 1 in0_splitncnn_4 222 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_52                 1 1 in1_splitncnn_4 227 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_53                3 1 222 227 215_splitncnn_3 228
Interp                   Resize_55                1 1 228 233 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_56                  1 1 233 235 0=96 1=3 3=2 4=1 5=1 6=6048 9=2 -23310=1,2.000000e-01
Convolution              Conv_58                  1 1 235 237 0=192 1=3 3=2 4=1 5=1 6=165888 9=2 -23310=1,2.000000e-01
Convolution              Conv_60                  1 1 237 239 0=192 1=3 4=1 5=1 6=331776 9=2 -23310=1,2.000000e-01
Convolution              Conv_62                  1 1 239 241 0=192 1=3 4=1 5=1 6=331776 9=2 -23310=1,2.000000e-01
Convolution              Conv_64                  1 1 241 243 0=192 1=3 4=1 5=1 6=331776 9=2 -23310=1,2.000000e-01
Convolution              Conv_66                  1 1 243 245 0=192 1=3 4=1 5=1 6=331776 9=2 -23310=1,2.000000e-01
Convolution              Conv_68                  1 1 245 247 0=192 1=3 4=1 5=1 6=331776 9=2 -23310=1,2.000000e-01
Convolution              Conv_70                  1 1 247 249 0=192 1=3 4=1 5=1 6=331776 9=2 -23310=1,2.000000e-01
Convolution              Conv_72                  1 1 249 251 0=192 1=3 4=1 5=1 6=331776 9=2 -23310=1,2.000000e-01
Convolution              Conv_74                  1 1 251 253 0=192 1=3 4=1 5=1 6=331776 9=2 -23310=1,2.000000e-01
Deconvolution            ConvTranspose_76         1 1 253 254 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   Resize_78                1 1 254 259 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_1              1 2 259 259_splitncnn_0 259_splitncnn_1
Crop                     Slice_83                 1 1 259_splitncnn_1 264 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_85                   1 1 264 266 0=2 1=1 2=8.000000e+00
BinaryOp                 Mul_87                   1 1 266 268 0=2 1=1 2=2.000000e+00
Split                    splitncnn_2              1 4 268 268_splitncnn_0 268_splitncnn_1 268_splitncnn_2 268_splitncnn_3
Crop                     Slice_92                 1 1 259_splitncnn_0 273 -23309=1,4 -23310=1,5 -23311=1,0
Split                    splitncnn_3              1 2 273 273_splitncnn_0 273_splitncnn_1
Crop                     Slice_97                 1 1 268_splitncnn_3 278 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_0                   2 1 in0_splitncnn_3 278 279 0=6
Crop                     Slice_103                1 1 268_splitncnn_2 284 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_1                   2 1 in1_splitncnn_3 284 285 0=6
Crop                     Slice_109                1 1 279 290 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_114                1 1 285 295 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_115               4 1 290 295 215_splitncnn_2 273_splitncnn_1 296
Interp                   Resize_117               1 1 296 301 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_119               1 1 268_splitncnn_1 306 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_121                  1 1 306 308 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_122                  1 1 308 311 0=3 1=1 2=4.000000e+00
Concat                   Concat_123               2 1 301 311 312
Convolution              Conv_124                 1 1 312 314 0=64 1=3 3=2 4=1 5=1 6=6912 9=2 -23310=1,2.000000e-01
Convolution              Conv_126                 1 1 314 316 0=128 1=3 3=2 4=1 5=1 6=73728 9=2 -23310=1,2.000000e-01
Convolution              Conv_128                 1 1 316 318 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,2.000000e-01
Convolution              Conv_130                 1 1 318 320 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,2.000000e-01
Convolution              Conv_132                 1 1 320 322 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,2.000000e-01
Convolution              Conv_134                 1 1 322 324 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,2.000000e-01
Convolution              Conv_136                 1 1 324 326 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,2.000000e-01
Convolution              Conv_138                 1 1 326 328 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,2.000000e-01
Convolution              Conv_140                 1 1 328 330 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,2.000000e-01
Convolution              Conv_142                 1 1 330 332 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,2.000000e-01
Deconvolution            ConvTranspose_144        1 1 332 333 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   Resize_146               1 1 333 338 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_4              1 2 338 338_splitncnn_0 338_splitncnn_1
Crop                     Slice_151                1 1 338_splitncnn_1 343 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_153                  1 1 343 345 0=2 1=1 2=4.000000e+00
Crop                     Slice_160                1 1 338_splitncnn_0 352 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_161                  2 1 268_splitncnn_0 345 353 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_5              1 4 353 353_splitncnn_0 353_splitncnn_1 353_splitncnn_2 353_splitncnn_3
BinaryOp                 Add_162                  2 1 273_splitncnn_0 352 354
Split                    splitncnn_6              1 2 354 354_splitncnn_0 354_splitncnn_1
Crop                     Slice_167                1 1 353_splitncnn_3 359 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_2                   2 1 in0_splitncnn_2 359 360 0=6
Crop                     Slice_173                1 1 353_splitncnn_2 365 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_3                   2 1 in1_splitncnn_2 365 366 0=6
Crop                     Slice_179                1 1 360 371 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_184                1 1 366 376 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_185               4 1 371 376 215_splitncnn_1 354_splitncnn_1 377
Interp                   Resize_187               1 1 377 382 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_189               1 1 353_splitncnn_1 387 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_191                  1 1 387 389 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_192                  1 1 389 392 0=3 1=1 2=2.000000e+00
Concat                   Concat_193               2 1 382 392 393
Convolution              Conv_194                 1 1 393 395 0=48 1=3 3=2 4=1 5=1 6=5184 9=2 -23310=1,2.000000e-01
Convolution              Conv_196                 1 1 395 397 0=96 1=3 3=2 4=1 5=1 6=41472 9=2 -23310=1,2.000000e-01
Convolution              Conv_198                 1 1 397 399 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,2.000000e-01
Convolution              Conv_200                 1 1 399 401 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,2.000000e-01
Convolution              Conv_202                 1 1 401 403 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,2.000000e-01
Convolution              Conv_204                 1 1 403 405 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,2.000000e-01
Convolution              Conv_206                 1 1 405 407 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,2.000000e-01
Convolution              Conv_208                 1 1 407 409 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,2.000000e-01
Convolution              Conv_210                 1 1 409 411 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,2.000000e-01
Convolution              Conv_212                 1 1 411 413 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,2.000000e-01
Deconvolution            ConvTranspose_214        1 1 413 414 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   Resize_216               1 1 414 419 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_7              1 2 419 419_splitncnn_0 419_splitncnn_1
Crop                     Slice_221                1 1 419_splitncnn_1 424 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_223                  1 1 424 426 0=2 1=1 2=2.000000e+00
Crop                     Slice_230                1 1 419_splitncnn_0 433 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_231                  2 1 353_splitncnn_0 426 434 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_8              1 4 434 434_splitncnn_0 434_splitncnn_1 434_splitncnn_2 434_splitncnn_3
BinaryOp                 Add_232                  2 1 354_splitncnn_0 433 435
Split                    splitncnn_9              1 2 435 435_splitncnn_0 435_splitncnn_1
Crop                     Slice_237                1 1 434_splitncnn_3 440 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_4                   2 1 in0_splitncnn_1 440 441 0=6
Crop                     Slice_243                1 1 434_splitncnn_2 446 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_5                   2 1 in1_splitncnn_1 446 447 0=6
Crop                     Slice_249                1 1 441 452 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_254                1 1 447 457 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_255               4 1 452 457 215_splitncnn_0 435_splitncnn_1 458
Interp                   Resize_257               1 1 458 463 0=2
Interp                   Resize_259               1 1 434_splitncnn_1 468 0=2
BinaryOp                 Mul_261                  1 1 468 470 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_262                  1 1 470 473 0=3 1=1 2=1.000000e+00
Concat                   Concat_263               2 1 463 473 474
Convolution              Conv_264                 1 1 474 476 0=32 1=3 3=2 4=1 5=1 6=3456 9=2 -23310=1,2.000000e-01
Convolution              Conv_266                 1 1 476 478 0=64 1=3 3=2 4=1 5=1 6=18432 9=2 -23310=1,2.000000e-01
Convolution              Conv_268                 1 1 478 480 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,2.000000e-01
Convolution              Conv_270                 1 1 480 482 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,2.000000e-01
Convolution              Conv_272                 1 1 482 484 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,2.000000e-01
Convolution              Conv_274                 1 1 484 486 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,2.000000e-01
Convolution              Conv_276                 1 1 486 488 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,2.000000e-01
Convolution              Conv_278                 1 1 488 490 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,2.000000e-01
Convolution              Conv_280                 1 1 490 492 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,2.000000e-01
Convolution              Conv_282                 1 1 492 494 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,2.000000e-01
Deconvolution            ConvTranspose_284        1 1 494 495 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   Resize_286               1 1 495 500 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_10             1 2 500 500_splitncnn_0 500_splitncnn_1
Crop                     Slice_291                1 1 500_splitncnn_1 505 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_293                  1 1 505 507 0=2 1=1 2=1.000000e+00
Crop                     Slice_300                1 1 500_splitncnn_0 514 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_301                  2 1 434_splitncnn_0 507 515 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_11             1 2 515 515_splitncnn_0 515_splitncnn_1
BinaryOp                 Add_302                  2 1 435_splitncnn_0 514 516
Crop                     Slice_307                1 1 515_splitncnn_1 521 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_6                   2 1 in0_splitncnn_0 521 522 0=6
Crop                     Slice_313                1 1 515_splitncnn_0 527 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_7                   2 1 in1_splitncnn_0 527 528 0=6
Sigmoid                  Sigmoid_315              1 1 516 529
Split                    splitncnn_12             1 2 529 529_splitncnn_0 529_splitncnn_1
BinaryOp                 Mul_316                  2 1 522 529_splitncnn_1 530 0=2
BinaryOp                 Sub_318                  1 1 529_splitncnn_0 532 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_319                  2 1 528 532 533 0=2
BinaryOp                 Add_320                  2 1 530 533 534
Crop                     Slice_325                1 1 534 539 -23309=1,0 -23310=1,256 -23311=1,1
Crop                     Slice_330                1 1 539 out0 -23309=1,0 -23310=1,256 -23311=1,2