7767517
622 800
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 6 in0 in0_splitncnn_0 in0_splitncnn_1 in0_splitncnn_2 in0_splitncnn_3 in0_splitncnn_4 in0_splitncnn_5
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 6 in1 in1_splitncnn_0 in1_splitncnn_1 in1_splitncnn_2 in1_splitncnn_3 in1_splitncnn_4 in1_splitncnn_5
Input                    in2                      0 1 in2
MemoryData               block0.convblock.0.beta  0 1 block0.convblock.0.beta 0=1 1=1 2=192
Split                    splitncnn_0              1 2 block0.convblock.0.beta block0.convblock.0.beta_splitncnn_0 block0.convblock.0.beta_splitncnn_1
MemoryData               block0.convblock.1.beta  0 1 block0.convblock.1.beta 0=1 1=1 2=192
Split                    splitncnn_1              1 2 block0.convblock.1.beta block0.convblock.1.beta_splitncnn_0 block0.convblock.1.beta_splitncnn_1
MemoryData               block0.convblock.2.beta  0 1 block0.convblock.2.beta 0=1 1=1 2=192
Split                    splitncnn_2              1 2 block0.convblock.2.beta block0.convblock.2.beta_splitncnn_0 block0.convblock.2.beta_splitncnn_1
MemoryData               block0.convblock.3.beta  0 1 block0.convblock.3.beta 0=1 1=1 2=192
Split                    splitncnn_3              1 2 block0.convblock.3.beta block0.convblock.3.beta_splitncnn_0 block0.convblock.3.beta_splitncnn_1
MemoryData               block0.convblock.4.beta  0 1 block0.convblock.4.beta 0=1 1=1 2=192
Split                    splitncnn_4              1 2 block0.convblock.4.beta block0.convblock.4.beta_splitncnn_0 block0.convblock.4.beta_splitncnn_1
MemoryData               block0.convblock.5.beta  0 1 block0.convblock.5.beta 0=1 1=1 2=192
Split                    splitncnn_5              1 2 block0.convblock.5.beta block0.convblock.5.beta_splitncnn_0 block0.convblock.5.beta_splitncnn_1
MemoryData               block0.convblock.6.beta  0 1 block0.convblock.6.beta 0=1 1=1 2=192
Split                    splitncnn_6              1 2 block0.convblock.6.beta block0.convblock.6.beta_splitncnn_0 block0.convblock.6.beta_splitncnn_1
MemoryData               block0.convblock.7.beta  0 1 block0.convblock.7.beta 0=1 1=1 2=192
Split                    splitncnn_7              1 2 block0.convblock.7.beta block0.convblock.7.beta_splitncnn_0 block0.convblock.7.beta_splitncnn_1
MemoryData               block1.convblock.0.beta  0 1 block1.convblock.0.beta 0=1 1=1 2=128
Split                    splitncnn_8              1 2 block1.convblock.0.beta block1.convblock.0.beta_splitncnn_0 block1.convblock.0.beta_splitncnn_1
MemoryData               block1.convblock.1.beta  0 1 block1.convblock.1.beta 0=1 1=1 2=128
Split                    splitncnn_9              1 2 block1.convblock.1.beta block1.convblock.1.beta_splitncnn_0 block1.convblock.1.beta_splitncnn_1
MemoryData               block1.convblock.2.beta  0 1 block1.convblock.2.beta 0=1 1=1 2=128
Split                    splitncnn_10             1 2 block1.convblock.2.beta block1.convblock.2.beta_splitncnn_0 block1.convblock.2.beta_splitncnn_1
MemoryData               block1.convblock.3.beta  0 1 block1.convblock.3.beta 0=1 1=1 2=128
Split                    splitncnn_11             1 2 block1.convblock.3.beta block1.convblock.3.beta_splitncnn_0 block1.convblock.3.beta_splitncnn_1
MemoryData               block1.convblock.4.beta  0 1 block1.convblock.4.beta 0=1 1=1 2=128
Split                    splitncnn_12             1 2 block1.convblock.4.beta block1.convblock.4.beta_splitncnn_0 block1.convblock.4.beta_splitncnn_1
MemoryData               block1.convblock.5.beta  0 1 block1.convblock.5.beta 0=1 1=1 2=128
Split                    splitncnn_13             1 2 block1.convblock.5.beta block1.convblock.5.beta_splitncnn_0 block1.convblock.5.beta_splitncnn_1
MemoryData               block1.convblock.6.beta  0 1 block1.convblock.6.beta 0=1 1=1 2=128
Split                    splitncnn_14             1 2 block1.convblock.6.beta block1.convblock.6.beta_splitncnn_0 block1.convblock.6.beta_splitncnn_1
MemoryData               block1.convblock.7.beta  0 1 block1.convblock.7.beta 0=1 1=1 2=128
Split                    splitncnn_15             1 2 block1.convblock.7.beta block1.convblock.7.beta_splitncnn_0 block1.convblock.7.beta_splitncnn_1
MemoryData               block2.convblock.0.beta  0 1 block2.convblock.0.beta 0=1 1=1 2=96
Split                    splitncnn_16             1 2 block2.convblock.0.beta block2.convblock.0.beta_splitncnn_0 block2.convblock.0.beta_splitncnn_1
MemoryData               block2.convblock.1.beta  0 1 block2.convblock.1.beta 0=1 1=1 2=96
Split                    splitncnn_17             1 2 block2.convblock.1.beta block2.convblock.1.beta_splitncnn_0 block2.convblock.1.beta_splitncnn_1
MemoryData               block2.convblock.2.beta  0 1 block2.convblock.2.beta 0=1 1=1 2=96
Split                    splitncnn_18             1 2 block2.convblock.2.beta block2.convblock.2.beta_splitncnn_0 block2.convblock.2.beta_splitncnn_1
MemoryData               block2.convblock.3.beta  0 1 block2.convblock.3.beta 0=1 1=1 2=96
Split                    splitncnn_19             1 2 block2.convblock.3.beta block2.convblock.3.beta_splitncnn_0 block2.convblock.3.beta_splitncnn_1
MemoryData               block2.convblock.4.beta  0 1 block2.convblock.4.beta 0=1 1=1 2=96
Split                    splitncnn_20             1 2 block2.convblock.4.beta block2.convblock.4.beta_splitncnn_0 block2.convblock.4.beta_splitncnn_1
MemoryData               block2.convblock.5.beta  0 1 block2.convblock.5.beta 0=1 1=1 2=96
Split                    splitncnn_21             1 2 block2.convblock.5.beta block2.convblock.5.beta_splitncnn_0 block2.convblock.5.beta_splitncnn_1
MemoryData               block2.convblock.6.beta  0 1 block2.convblock.6.beta 0=1 1=1 2=96
Split                    splitncnn_22             1 2 block2.convblock.6.beta block2.convblock.6.beta_splitncnn_0 block2.convblock.6.beta_splitncnn_1
MemoryData               block2.convblock.7.beta  0 1 block2.convblock.7.beta 0=1 1=1 2=96
Split                    splitncnn_23             1 2 block2.convblock.7.beta block2.convblock.7.beta_splitncnn_0 block2.convblock.7.beta_splitncnn_1
MemoryData               block3.convblock.0.beta  0 1 block3.convblock.0.beta 0=1 1=1 2=64
Split                    splitncnn_24             1 2 block3.convblock.0.beta block3.convblock.0.beta_splitncnn_0 block3.convblock.0.beta_splitncnn_1
MemoryData               block3.convblock.1.beta  0 1 block3.convblock.1.beta 0=1 1=1 2=64
Split                    splitncnn_25             1 2 block3.convblock.1.beta block3.convblock.1.beta_splitncnn_0 block3.convblock.1.beta_splitncnn_1
MemoryData               block3.convblock.2.beta  0 1 block3.convblock.2.beta 0=1 1=1 2=64
Split                    splitncnn_26             1 2 block3.convblock.2.beta block3.convblock.2.beta_splitncnn_0 block3.convblock.2.beta_splitncnn_1
MemoryData               block3.convblock.3.beta  0 1 block3.convblock.3.beta 0=1 1=1 2=64
Split                    splitncnn_27             1 2 block3.convblock.3.beta block3.convblock.3.beta_splitncnn_0 block3.convblock.3.beta_splitncnn_1
MemoryData               block3.convblock.4.beta  0 1 block3.convblock.4.beta 0=1 1=1 2=64
Split                    splitncnn_28             1 2 block3.convblock.4.beta block3.convblock.4.beta_splitncnn_0 block3.convblock.4.beta_splitncnn_1
MemoryData               block3.convblock.5.beta  0 1 block3.convblock.5.beta 0=1 1=1 2=64
Split                    splitncnn_29             1 2 block3.convblock.5.beta block3.convblock.5.beta_splitncnn_0 block3.convblock.5.beta_splitncnn_1
MemoryData               block3.convblock.6.beta  0 1 block3.convblock.6.beta 0=1 1=1 2=64
Split                    splitncnn_30             1 2 block3.convblock.6.beta block3.convblock.6.beta_splitncnn_0 block3.convblock.6.beta_splitncnn_1
MemoryData               block3.convblock.7.beta  0 1 block3.convblock.7.beta 0=1 1=1 2=64
Split                    splitncnn_31             1 2 block3.convblock.7.beta block3.convblock.7.beta_splitncnn_0 block3.convblock.7.beta_splitncnn_1
Concat                   /Concat                  2 1 in0_splitncnn_5 in1_splitncnn_5 /Concat_output_0
Crop                     /Slice                   1 1 /Concat_output_0 /Slice_output_0 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 /Mul                     1 1 /Slice_output_0 /Mul_output_0 0=2 1=1
BinaryOp                 /Add                     1 1 /Mul_output_0 /Add_output_0 1=1 2=1.000000e+00
BinaryOp                 /Mul_1                   2 1 /Add_output_0 in2 /Mul_1_output_0 0=2
Split                    splitncnn_32             1 5 /Mul_1_output_0 /Mul_1_output_0_splitncnn_0 /Mul_1_output_0_splitncnn_1 /Mul_1_output_0_splitncnn_2 /Mul_1_output_0_splitncnn_3 /Mul_1_output_0_splitncnn_4
Crop                     /Slice_1                 1 1 in0_splitncnn_4 /Slice_1_output_0 -23309=1,0 -23310=1,3 -23311=1,0
Split                    splitncnn_33             1 3 /Slice_1_output_0 /Slice_1_output_0_splitncnn_0 /Slice_1_output_0_splitncnn_1 /Slice_1_output_0_splitncnn_2
Convolution              /encode/encode.0/Conv    1 1 /Slice_1_output_0_splitncnn_2 /encode/encode.0/Conv_output_0 0=16 1=3 3=2 4=1 5=1 6=432
Deconvolution            /encode/encode.1/ConvTranspose 1 1 /encode/encode.0/Conv_output_0 /encode/encode.1/ConvTranspose_output_0 0=4 1=4 3=2 4=1 5=1 6=1024
Split                    splitncnn_34             1 5 /encode/encode.1/ConvTranspose_output_0 /encode/encode.1/ConvTranspose_output_0_splitncnn_0 /encode/encode.1/ConvTranspose_output_0_splitncnn_1 /encode/encode.1/ConvTranspose_output_0_splitncnn_2 /encode/encode.1/ConvTranspose_output_0_splitncnn_3 /encode/encode.1/ConvTranspose_output_0_splitncnn_4
Crop                     /Slice_2                 1 1 in1_splitncnn_4 /Slice_2_output_0 -23309=1,0 -23310=1,3 -23311=1,0
Split                    splitncnn_35             1 3 /Slice_2_output_0 /Slice_2_output_0_splitncnn_0 /Slice_2_output_0_splitncnn_1 /Slice_2_output_0_splitncnn_2
Convolution              /encode/encode.0_1/Conv  1 1 /Slice_2_output_0_splitncnn_2 /encode/encode.0_1/Conv_output_0 0=16 1=3 3=2 4=1 5=1 6=432
Deconvolution            /encode/encode.1_1/ConvTranspose 1 1 /encode/encode.0_1/Conv_output_0 /encode/encode.1_1/ConvTranspose_output_0 0=4 1=4 3=2 4=1 5=1 6=1024
Split                    splitncnn_36             1 5 /encode/encode.1_1/ConvTranspose_output_0 /encode/encode.1_1/ConvTranspose_output_0_splitncnn_0 /encode/encode.1_1/ConvTranspose_output_0_splitncnn_1 /encode/encode.1_1/ConvTranspose_output_0_splitncnn_2 /encode/encode.1_1/ConvTranspose_output_0_splitncnn_3 /encode/encode.1_1/ConvTranspose_output_0_splitncnn_4
Concat                   /Concat_1                5 1 /Slice_1_output_0_splitncnn_1 /Slice_2_output_0_splitncnn_1 /encode/encode.1/ConvTranspose_output_0_splitncnn_4 /encode/encode.1_1/ConvTranspose_output_0_splitncnn_4 /Mul_1_output_0_splitncnn_4 /Concat_1_output_0
Interp                   /block0/Resize           1 1 /Concat_1_output_0 /block0/Resize_output_0 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              /block0/conv0/conv0.0/conv0.0.0/Conv 1 1 /block0/Resize_output_0 /block0/conv0/conv0.0/conv0.0.1/LeakyRelu_output_0 0=96 1=3 3=2 4=1 5=1 6=12960 9=2 -23310=1,2.000000e-01
Convolution              /block0/conv0/conv0.1/conv0.1.0/Conv 1 1 /block0/conv0/conv0.0/conv0.0.1/LeakyRelu_output_0 /block0/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0 0=192 1=3 3=2 4=1 5=1 6=165888 9=2 -23310=1,2.000000e-01
Split                    splitncnn_37             1 2 /block0/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0 /block0/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0_splitncnn_0 /block0/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.0/conv/Conv 1 1 /block0/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.0/conv/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.0/Mul 2 1 /block0/convblock/convblock.0/conv/Conv_output_0 block0.convblock.0.beta_splitncnn_1 /block0/convblock/convblock.0/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.0/Add 2 1 /block0/convblock/convblock.0/Mul_output_0 /block0/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.0/Add_output_0
ReLU                     /block0/convblock/convblock.0/relu/LeakyRelu 1 1 /block0/convblock/convblock.0/Add_output_0 /block0/convblock/convblock.0/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_38             1 2 /block0/convblock/convblock.0/relu/LeakyRelu_output_0 /block0/convblock/convblock.0/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.0/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.1/conv/Conv 1 1 /block0/convblock/convblock.0/relu/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.1/conv/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.1/Mul 2 1 /block0/convblock/convblock.1/conv/Conv_output_0 block0.convblock.1.beta_splitncnn_1 /block0/convblock/convblock.1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.1/Add 2 1 /block0/convblock/convblock.1/Mul_output_0 /block0/convblock/convblock.0/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.1/Add_output_0
ReLU                     /block0/convblock/convblock.1/relu/LeakyRelu 1 1 /block0/convblock/convblock.1/Add_output_0 /block0/convblock/convblock.1/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_39             1 2 /block0/convblock/convblock.1/relu/LeakyRelu_output_0 /block0/convblock/convblock.1/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.1/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.2/conv/Conv 1 1 /block0/convblock/convblock.1/relu/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.2/conv/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.2/Mul 2 1 /block0/convblock/convblock.2/conv/Conv_output_0 block0.convblock.2.beta_splitncnn_1 /block0/convblock/convblock.2/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.2/Add 2 1 /block0/convblock/convblock.2/Mul_output_0 /block0/convblock/convblock.1/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.2/Add_output_0
ReLU                     /block0/convblock/convblock.2/relu/LeakyRelu 1 1 /block0/convblock/convblock.2/Add_output_0 /block0/convblock/convblock.2/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_40             1 2 /block0/convblock/convblock.2/relu/LeakyRelu_output_0 /block0/convblock/convblock.2/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.2/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.3/conv/Conv 1 1 /block0/convblock/convblock.2/relu/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.3/conv/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.3/Mul 2 1 /block0/convblock/convblock.3/conv/Conv_output_0 block0.convblock.3.beta_splitncnn_1 /block0/convblock/convblock.3/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.3/Add 2 1 /block0/convblock/convblock.3/Mul_output_0 /block0/convblock/convblock.2/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.3/Add_output_0
ReLU                     /block0/convblock/convblock.3/relu/LeakyRelu 1 1 /block0/convblock/convblock.3/Add_output_0 /block0/convblock/convblock.3/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_41             1 2 /block0/convblock/convblock.3/relu/LeakyRelu_output_0 /block0/convblock/convblock.3/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.3/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.4/conv/Conv 1 1 /block0/convblock/convblock.3/relu/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.4/conv/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.4/Mul 2 1 /block0/convblock/convblock.4/conv/Conv_output_0 block0.convblock.4.beta_splitncnn_1 /block0/convblock/convblock.4/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.4/Add 2 1 /block0/convblock/convblock.4/Mul_output_0 /block0/convblock/convblock.3/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.4/Add_output_0
ReLU                     /block0/convblock/convblock.4/relu/LeakyRelu 1 1 /block0/convblock/convblock.4/Add_output_0 /block0/convblock/convblock.4/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_42             1 2 /block0/convblock/convblock.4/relu/LeakyRelu_output_0 /block0/convblock/convblock.4/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.4/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.5/conv/Conv 1 1 /block0/convblock/convblock.4/relu/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.5/conv/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.5/Mul 2 1 /block0/convblock/convblock.5/conv/Conv_output_0 block0.convblock.5.beta_splitncnn_1 /block0/convblock/convblock.5/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.5/Add 2 1 /block0/convblock/convblock.5/Mul_output_0 /block0/convblock/convblock.4/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.5/Add_output_0
ReLU                     /block0/convblock/convblock.5/relu/LeakyRelu 1 1 /block0/convblock/convblock.5/Add_output_0 /block0/convblock/convblock.5/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_43             1 2 /block0/convblock/convblock.5/relu/LeakyRelu_output_0 /block0/convblock/convblock.5/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.5/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.6/conv/Conv 1 1 /block0/convblock/convblock.5/relu/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.6/conv/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.6/Mul 2 1 /block0/convblock/convblock.6/conv/Conv_output_0 block0.convblock.6.beta_splitncnn_1 /block0/convblock/convblock.6/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.6/Add 2 1 /block0/convblock/convblock.6/Mul_output_0 /block0/convblock/convblock.5/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.6/Add_output_0
ReLU                     /block0/convblock/convblock.6/relu/LeakyRelu 1 1 /block0/convblock/convblock.6/Add_output_0 /block0/convblock/convblock.6/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_44             1 2 /block0/convblock/convblock.6/relu/LeakyRelu_output_0 /block0/convblock/convblock.6/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.6/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.7/conv/Conv 1 1 /block0/convblock/convblock.6/relu/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.7/conv/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.7/Mul 2 1 /block0/convblock/convblock.7/conv/Conv_output_0 block0.convblock.7.beta_splitncnn_1 /block0/convblock/convblock.7/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.7/Add 2 1 /block0/convblock/convblock.7/Mul_output_0 /block0/convblock/convblock.6/relu/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.7/Add_output_0
ReLU                     /block0/convblock/convblock.7/relu/LeakyRelu 1 1 /block0/convblock/convblock.7/Add_output_0 /block0/convblock/convblock.7/relu/LeakyRelu_output_0 0=2.000000e-01
Deconvolution            /block0/lastconv/lastconv.0/ConvTranspose 1 1 /block0/convblock/convblock.7/relu/LeakyRelu_output_0 /block0/lastconv/lastconv.0/ConvTranspose_output_0 0=24 1=4 3=2 4=1 5=1 6=73728
PixelShuffle             /block0/lastconv/lastconv.1/DepthToSpace 1 1 /block0/lastconv/lastconv.0/ConvTranspose_output_0 /block0/lastconv/lastconv.1/DepthToSpace_output_0 0=2
Interp                   /block0/Resize_1         1 1 /block0/lastconv/lastconv.1/DepthToSpace_output_0 /block0/Resize_1_output_0 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_45             1 2 /block0/Resize_1_output_0 /block0/Resize_1_output_0_splitncnn_0 /block0/Resize_1_output_0_splitncnn_1
Crop                     /block0/Slice            1 1 /block0/Resize_1_output_0_splitncnn_1 /block0/Slice_output_0 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     /block0/Slice_1          1 1 /block0/Resize_1_output_0_splitncnn_0 /block0/Slice_1_output_0 -23309=1,4 -23310=1,5 -23311=1,0
BinaryOp                 /Sub                     1 1 /Mul_1_output_0_splitncnn_3 /Sub_output_0 0=7 1=1 2=1.000000e+00
Split                    splitncnn_46             1 4 /Sub_output_0 /Sub_output_0_splitncnn_0 /Sub_output_0_splitncnn_1 /Sub_output_0_splitncnn_2 /Sub_output_0_splitncnn_3
Concat                   /Concat_2                5 1 /Slice_2_output_0_splitncnn_0 /Slice_1_output_0_splitncnn_0 /encode/encode.1_1/ConvTranspose_output_0_splitncnn_3 /encode/encode.1/ConvTranspose_output_0_splitncnn_3 /Sub_output_0_splitncnn_3 /Concat_2_output_0
Interp                   /block0_1/Resize         1 1 /Concat_2_output_0 /block0_1/Resize_output_0 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              /block0/conv0/conv0.0/conv0.0.0_1/Conv 1 1 /block0_1/Resize_output_0 /block0/conv0/conv0.0/conv0.0.1_1/LeakyRelu_output_0 0=96 1=3 3=2 4=1 5=1 6=12960 9=2 -23310=1,2.000000e-01
Convolution              /block0/conv0/conv0.1/conv0.1.0_1/Conv 1 1 /block0/conv0/conv0.0/conv0.0.1_1/LeakyRelu_output_0 /block0/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0 0=192 1=3 3=2 4=1 5=1 6=165888 9=2 -23310=1,2.000000e-01
Split                    splitncnn_47             1 2 /block0/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0 /block0/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0_splitncnn_0 /block0/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.0/conv_1/Conv 1 1 /block0/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.0/conv_1/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.0_1/Mul 2 1 /block0/convblock/convblock.0/conv_1/Conv_output_0 block0.convblock.0.beta_splitncnn_0 /block0/convblock/convblock.0_1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.0_1/Add 2 1 /block0/convblock/convblock.0_1/Mul_output_0 /block0/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.0_1/Add_output_0
ReLU                     /block0/convblock/convblock.0/relu_1/LeakyRelu 1 1 /block0/convblock/convblock.0_1/Add_output_0 /block0/convblock/convblock.0/relu_1/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_48             1 2 /block0/convblock/convblock.0/relu_1/LeakyRelu_output_0 /block0/convblock/convblock.0/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.0/relu_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.1/conv_1/Conv 1 1 /block0/convblock/convblock.0/relu_1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.1/conv_1/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.1_1/Mul 2 1 /block0/convblock/convblock.1/conv_1/Conv_output_0 block0.convblock.1.beta_splitncnn_0 /block0/convblock/convblock.1_1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.1_1/Add 2 1 /block0/convblock/convblock.1_1/Mul_output_0 /block0/convblock/convblock.0/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.1_1/Add_output_0
ReLU                     /block0/convblock/convblock.1/relu_1/LeakyRelu 1 1 /block0/convblock/convblock.1_1/Add_output_0 /block0/convblock/convblock.1/relu_1/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_49             1 2 /block0/convblock/convblock.1/relu_1/LeakyRelu_output_0 /block0/convblock/convblock.1/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.1/relu_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.2/conv_1/Conv 1 1 /block0/convblock/convblock.1/relu_1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.2/conv_1/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.2_1/Mul 2 1 /block0/convblock/convblock.2/conv_1/Conv_output_0 block0.convblock.2.beta_splitncnn_0 /block0/convblock/convblock.2_1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.2_1/Add 2 1 /block0/convblock/convblock.2_1/Mul_output_0 /block0/convblock/convblock.1/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.2_1/Add_output_0
ReLU                     /block0/convblock/convblock.2/relu_1/LeakyRelu 1 1 /block0/convblock/convblock.2_1/Add_output_0 /block0/convblock/convblock.2/relu_1/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_50             1 2 /block0/convblock/convblock.2/relu_1/LeakyRelu_output_0 /block0/convblock/convblock.2/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.2/relu_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.3/conv_1/Conv 1 1 /block0/convblock/convblock.2/relu_1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.3/conv_1/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.3_1/Mul 2 1 /block0/convblock/convblock.3/conv_1/Conv_output_0 block0.convblock.3.beta_splitncnn_0 /block0/convblock/convblock.3_1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.3_1/Add 2 1 /block0/convblock/convblock.3_1/Mul_output_0 /block0/convblock/convblock.2/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.3_1/Add_output_0
ReLU                     /block0/convblock/convblock.3/relu_1/LeakyRelu 1 1 /block0/convblock/convblock.3_1/Add_output_0 /block0/convblock/convblock.3/relu_1/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_51             1 2 /block0/convblock/convblock.3/relu_1/LeakyRelu_output_0 /block0/convblock/convblock.3/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.3/relu_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.4/conv_1/Conv 1 1 /block0/convblock/convblock.3/relu_1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.4/conv_1/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.4_1/Mul 2 1 /block0/convblock/convblock.4/conv_1/Conv_output_0 block0.convblock.4.beta_splitncnn_0 /block0/convblock/convblock.4_1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.4_1/Add 2 1 /block0/convblock/convblock.4_1/Mul_output_0 /block0/convblock/convblock.3/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.4_1/Add_output_0
ReLU                     /block0/convblock/convblock.4/relu_1/LeakyRelu 1 1 /block0/convblock/convblock.4_1/Add_output_0 /block0/convblock/convblock.4/relu_1/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_52             1 2 /block0/convblock/convblock.4/relu_1/LeakyRelu_output_0 /block0/convblock/convblock.4/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.4/relu_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.5/conv_1/Conv 1 1 /block0/convblock/convblock.4/relu_1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.5/conv_1/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.5_1/Mul 2 1 /block0/convblock/convblock.5/conv_1/Conv_output_0 block0.convblock.5.beta_splitncnn_0 /block0/convblock/convblock.5_1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.5_1/Add 2 1 /block0/convblock/convblock.5_1/Mul_output_0 /block0/convblock/convblock.4/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.5_1/Add_output_0
ReLU                     /block0/convblock/convblock.5/relu_1/LeakyRelu 1 1 /block0/convblock/convblock.5_1/Add_output_0 /block0/convblock/convblock.5/relu_1/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_53             1 2 /block0/convblock/convblock.5/relu_1/LeakyRelu_output_0 /block0/convblock/convblock.5/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.5/relu_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.6/conv_1/Conv 1 1 /block0/convblock/convblock.5/relu_1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.6/conv_1/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.6_1/Mul 2 1 /block0/convblock/convblock.6/conv_1/Conv_output_0 block0.convblock.6.beta_splitncnn_0 /block0/convblock/convblock.6_1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.6_1/Add 2 1 /block0/convblock/convblock.6_1/Mul_output_0 /block0/convblock/convblock.5/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.6_1/Add_output_0
ReLU                     /block0/convblock/convblock.6/relu_1/LeakyRelu 1 1 /block0/convblock/convblock.6_1/Add_output_0 /block0/convblock/convblock.6/relu_1/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_54             1 2 /block0/convblock/convblock.6/relu_1/LeakyRelu_output_0 /block0/convblock/convblock.6/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.6/relu_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block0/convblock/convblock.7/conv_1/Conv 1 1 /block0/convblock/convblock.6/relu_1/LeakyRelu_output_0_splitncnn_1 /block0/convblock/convblock.7/conv_1/Conv_output_0 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 /block0/convblock/convblock.7_1/Mul 2 1 /block0/convblock/convblock.7/conv_1/Conv_output_0 block0.convblock.7.beta_splitncnn_0 /block0/convblock/convblock.7_1/Mul_output_0 0=2
BinaryOp                 /block0/convblock/convblock.7_1/Add 2 1 /block0/convblock/convblock.7_1/Mul_output_0 /block0/convblock/convblock.6/relu_1/LeakyRelu_output_0_splitncnn_0 /block0/convblock/convblock.7_1/Add_output_0
ReLU                     /block0/convblock/convblock.7/relu_1/LeakyRelu 1 1 /block0/convblock/convblock.7_1/Add_output_0 /block0/convblock/convblock.7/relu_1/LeakyRelu_output_0 0=2.000000e-01
Deconvolution            /block0/lastconv/lastconv.0_1/ConvTranspose 1 1 /block0/convblock/convblock.7/relu_1/LeakyRelu_output_0 /block0/lastconv/lastconv.0_1/ConvTranspose_output_0 0=24 1=4 3=2 4=1 5=1 6=73728
PixelShuffle             /block0/lastconv/lastconv.1_1/DepthToSpace 1 1 /block0/lastconv/lastconv.0_1/ConvTranspose_output_0 /block0/lastconv/lastconv.1_1/DepthToSpace_output_0 0=2
Interp                   /block0_1/Resize_1       1 1 /block0/lastconv/lastconv.1_1/DepthToSpace_output_0 /block0_1/Resize_1_output_0 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_55             1 2 /block0_1/Resize_1_output_0 /block0_1/Resize_1_output_0_splitncnn_0 /block0_1/Resize_1_output_0_splitncnn_1
Crop                     /block0_1/Slice          1 1 /block0_1/Resize_1_output_0_splitncnn_1 /block0_1/Slice_output_0 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 /block0_1/Mul            1 1 /block0_1/Slice_output_0 /block0_1/Mul_output_0 0=2 1=1 2=8.000000e+00
Split                    splitncnn_56             1 2 /block0_1/Mul_output_0 /block0_1/Mul_output_0_splitncnn_0 /block0_1/Mul_output_0_splitncnn_1
Crop                     /block0_1/Slice_1        1 1 /block0_1/Resize_1_output_0_splitncnn_0 /block0_1/Slice_1_output_0 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     /Slice_3                 1 1 /block0_1/Mul_output_0_splitncnn_1 /Slice_3_output_0 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     /Slice_4                 1 1 /block0_1/Mul_output_0_splitncnn_0 /Slice_4_output_0 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   /Concat_3                2 1 /Slice_3_output_0 /Slice_4_output_0 /Concat_3_output_0
Eltwise                  /Add_1                   2 1 /block0/Slice_output_0 /Concat_3_output_0 /Add_1_output_0 0=1 -23301=2,8.000000e+00,1.000000e+00
BinaryOp                 /Div                     1 1 /Add_1_output_0 /Div_output_0 0=3 1=1 2=2.000000e+00
Split                    splitncnn_57             1 8 /Div_output_0 /Div_output_0_splitncnn_0 /Div_output_0_splitncnn_1 /Div_output_0_splitncnn_2 /Div_output_0_splitncnn_3 /Div_output_0_splitncnn_4 /Div_output_0_splitncnn_5 /Div_output_0_splitncnn_6 /Div_output_0_splitncnn_7
UnaryOp                  /Neg                     1 1 /block0_1/Slice_1_output_0 /Neg_output_0 0=1
BinaryOp                 /Add_2                   2 1 /block0/Slice_1_output_0 /Neg_output_0 /Add_2_output_0
BinaryOp                 /Div_1                   1 1 /Add_2_output_0 /Div_1_output_0 0=3 1=1 2=2.000000e+00
Split                    splitncnn_58             1 2 /Div_1_output_0 /Div_1_output_0_splitncnn_0 /Div_1_output_0_splitncnn_1
Crop                     /Slice_5                 1 1 /Div_output_0_splitncnn_7 /Slice_5_output_0 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 /warp                     2 1 in0_splitncnn_3 /Slice_5_output_0 /warp_output_0 0=6
Crop                     /Slice_6                 1 1 /Div_output_0_splitncnn_6 /Slice_6_output_0 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 /warp_1                   2 1 in1_splitncnn_3 /Slice_6_output_0 /warp_1_output_0 0=6
Concat                   /Concat_4                2 1 /Div_output_0_splitncnn_5 /Div_output_0_splitncnn_4 /Concat_4_output_0
Split                    splitncnn_59             1 2 /Concat_4_output_0 /Concat_4_output_0_splitncnn_0 /Concat_4_output_0_splitncnn_1
Crop                     /Slice_7                 1 1 /Concat_4_output_0_splitncnn_1 /Slice_7_output_0 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 /warp_2                   2 1 /encode/encode.1/ConvTranspose_output_0_splitncnn_2 /Slice_7_output_0 /warp_2_output_0 0=6
Split                    splitncnn_60             1 2 /warp_2_output_0 /warp_2_output_0_splitncnn_0 /warp_2_output_0_splitncnn_1
Crop                     /Slice_8                 1 1 /Concat_4_output_0_splitncnn_0 /Slice_8_output_0 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 /warp_3                   2 1 /encode/encode.1_1/ConvTranspose_output_0_splitncnn_2 /Slice_8_output_0 /warp_3_output_0 0=6
Split                    splitncnn_61             1 2 /warp_3_output_0 /warp_3_output_0_splitncnn_0 /warp_3_output_0_splitncnn_1
Crop                     /Slice_9                 1 1 /warp_output_0 /Slice_9_output_0 -23309=1,0 -23310=1,3 -23311=1,0
Split                    splitncnn_62             1 2 /Slice_9_output_0 /Slice_9_output_0_splitncnn_0 /Slice_9_output_0_splitncnn_1
Crop                     /Slice_10                1 1 /warp_1_output_0 /Slice_10_output_0 -23309=1,0 -23310=1,3 -23311=1,0
Split                    splitncnn_63             1 2 /Slice_10_output_0 /Slice_10_output_0_splitncnn_0 /Slice_10_output_0_splitncnn_1
Concat                   /Concat_5                6 1 /Slice_9_output_0_splitncnn_1 /Slice_10_output_0_splitncnn_1 /warp_2_output_0_splitncnn_1 /warp_3_output_0_splitncnn_1 /Mul_1_output_0_splitncnn_2 /Div_1_output_0_splitncnn_1 /Concat_5_output_0
Interp                   /block1/Resize           1 1 /Concat_5_output_0 /block1/Resize_output_0 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   /block1/Resize_1         1 1 /Div_output_0_splitncnn_3 /block1/Resize_1_output_0 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 /block1/Div              1 1 /block1/Resize_1_output_0 /block1/Div_output_0 0=3 1=1 2=4.000000e+00
Concat                   /block1/Concat           2 1 /block1/Resize_output_0 /block1/Div_output_0 /block1/Concat_output_0
Convolution              /block1/conv0/conv0.0/conv0.0.0/Conv 1 1 /block1/Concat_output_0 /block1/conv0/conv0.0/conv0.0.1/LeakyRelu_output_0 0=64 1=3 3=2 4=1 5=1 6=11520 9=2 -23310=1,2.000000e-01
Convolution              /block1/conv0/conv0.1/conv0.1.0/Conv 1 1 /block1/conv0/conv0.0/conv0.0.1/LeakyRelu_output_0 /block1/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0 0=128 1=3 3=2 4=1 5=1 6=73728 9=2 -23310=1,2.000000e-01
Split                    splitncnn_64             1 2 /block1/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0 /block1/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0_splitncnn_0 /block1/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.0/conv/Conv 1 1 /block1/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.0/conv/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.0/Mul 2 1 /block1/convblock/convblock.0/conv/Conv_output_0 block1.convblock.0.beta_splitncnn_1 /block1/convblock/convblock.0/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.0/Add 2 1 /block1/convblock/convblock.0/Mul_output_0 /block1/conv0/conv0.1/conv0.1.1/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.0/Add_output_0
ReLU                     /block1/convblock/convblock.0/relu/LeakyRelu 1 1 /block1/convblock/convblock.0/Add_output_0 /block1/convblock/convblock.0/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_65             1 2 /block1/convblock/convblock.0/relu/LeakyRelu_output_0 /block1/convblock/convblock.0/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.0/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.1/conv/Conv 1 1 /block1/convblock/convblock.0/relu/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.1/conv/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.1/Mul 2 1 /block1/convblock/convblock.1/conv/Conv_output_0 block1.convblock.1.beta_splitncnn_1 /block1/convblock/convblock.1/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.1/Add 2 1 /block1/convblock/convblock.1/Mul_output_0 /block1/convblock/convblock.0/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.1/Add_output_0
ReLU                     /block1/convblock/convblock.1/relu/LeakyRelu 1 1 /block1/convblock/convblock.1/Add_output_0 /block1/convblock/convblock.1/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_66             1 2 /block1/convblock/convblock.1/relu/LeakyRelu_output_0 /block1/convblock/convblock.1/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.1/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.2/conv/Conv 1 1 /block1/convblock/convblock.1/relu/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.2/conv/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.2/Mul 2 1 /block1/convblock/convblock.2/conv/Conv_output_0 block1.convblock.2.beta_splitncnn_1 /block1/convblock/convblock.2/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.2/Add 2 1 /block1/convblock/convblock.2/Mul_output_0 /block1/convblock/convblock.1/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.2/Add_output_0
ReLU                     /block1/convblock/convblock.2/relu/LeakyRelu 1 1 /block1/convblock/convblock.2/Add_output_0 /block1/convblock/convblock.2/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_67             1 2 /block1/convblock/convblock.2/relu/LeakyRelu_output_0 /block1/convblock/convblock.2/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.2/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.3/conv/Conv 1 1 /block1/convblock/convblock.2/relu/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.3/conv/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.3/Mul 2 1 /block1/convblock/convblock.3/conv/Conv_output_0 block1.convblock.3.beta_splitncnn_1 /block1/convblock/convblock.3/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.3/Add 2 1 /block1/convblock/convblock.3/Mul_output_0 /block1/convblock/convblock.2/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.3/Add_output_0
ReLU                     /block1/convblock/convblock.3/relu/LeakyRelu 1 1 /block1/convblock/convblock.3/Add_output_0 /block1/convblock/convblock.3/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_68             1 2 /block1/convblock/convblock.3/relu/LeakyRelu_output_0 /block1/convblock/convblock.3/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.3/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.4/conv/Conv 1 1 /block1/convblock/convblock.3/relu/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.4/conv/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.4/Mul 2 1 /block1/convblock/convblock.4/conv/Conv_output_0 block1.convblock.4.beta_splitncnn_1 /block1/convblock/convblock.4/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.4/Add 2 1 /block1/convblock/convblock.4/Mul_output_0 /block1/convblock/convblock.3/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.4/Add_output_0
ReLU                     /block1/convblock/convblock.4/relu/LeakyRelu 1 1 /block1/convblock/convblock.4/Add_output_0 /block1/convblock/convblock.4/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_69             1 2 /block1/convblock/convblock.4/relu/LeakyRelu_output_0 /block1/convblock/convblock.4/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.4/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.5/conv/Conv 1 1 /block1/convblock/convblock.4/relu/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.5/conv/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.5/Mul 2 1 /block1/convblock/convblock.5/conv/Conv_output_0 block1.convblock.5.beta_splitncnn_1 /block1/convblock/convblock.5/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.5/Add 2 1 /block1/convblock/convblock.5/Mul_output_0 /block1/convblock/convblock.4/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.5/Add_output_0
ReLU                     /block1/convblock/convblock.5/relu/LeakyRelu 1 1 /block1/convblock/convblock.5/Add_output_0 /block1/convblock/convblock.5/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_70             1 2 /block1/convblock/convblock.5/relu/LeakyRelu_output_0 /block1/convblock/convblock.5/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.5/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.6/conv/Conv 1 1 /block1/convblock/convblock.5/relu/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.6/conv/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.6/Mul 2 1 /block1/convblock/convblock.6/conv/Conv_output_0 block1.convblock.6.beta_splitncnn_1 /block1/convblock/convblock.6/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.6/Add 2 1 /block1/convblock/convblock.6/Mul_output_0 /block1/convblock/convblock.5/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.6/Add_output_0
ReLU                     /block1/convblock/convblock.6/relu/LeakyRelu 1 1 /block1/convblock/convblock.6/Add_output_0 /block1/convblock/convblock.6/relu/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_71             1 2 /block1/convblock/convblock.6/relu/LeakyRelu_output_0 /block1/convblock/convblock.6/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.6/relu/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.7/conv/Conv 1 1 /block1/convblock/convblock.6/relu/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.7/conv/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.7/Mul 2 1 /block1/convblock/convblock.7/conv/Conv_output_0 block1.convblock.7.beta_splitncnn_1 /block1/convblock/convblock.7/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.7/Add 2 1 /block1/convblock/convblock.7/Mul_output_0 /block1/convblock/convblock.6/relu/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.7/Add_output_0
ReLU                     /block1/convblock/convblock.7/relu/LeakyRelu 1 1 /block1/convblock/convblock.7/Add_output_0 /block1/convblock/convblock.7/relu/LeakyRelu_output_0 0=2.000000e-01
Deconvolution            /block1/lastconv/lastconv.0/ConvTranspose 1 1 /block1/convblock/convblock.7/relu/LeakyRelu_output_0 /block1/lastconv/lastconv.0/ConvTranspose_output_0 0=24 1=4 3=2 4=1 5=1 6=49152
PixelShuffle             /block1/lastconv/lastconv.1/DepthToSpace 1 1 /block1/lastconv/lastconv.0/ConvTranspose_output_0 /block1/lastconv/lastconv.1/DepthToSpace_output_0 0=2
Interp                   /block1/Resize_2         1 1 /block1/lastconv/lastconv.1/DepthToSpace_output_0 /block1/Resize_2_output_0 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_72             1 2 /block1/Resize_2_output_0 /block1/Resize_2_output_0_splitncnn_0 /block1/Resize_2_output_0_splitncnn_1
Crop                     /block1/Slice            1 1 /block1/Resize_2_output_0_splitncnn_1 /block1/Slice_output_0 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     /block1/Slice_1          1 1 /block1/Resize_2_output_0_splitncnn_0 /block1/Slice_1_output_0 -23309=1,4 -23310=1,5 -23311=1,0
UnaryOp                  /Neg_1                   1 1 /Div_1_output_0_splitncnn_0 /Neg_1_output_0 0=1
Concat                   /Concat_6                6 1 /Slice_10_output_0_splitncnn_0 /Slice_9_output_0_splitncnn_0 /warp_3_output_0_splitncnn_0 /warp_2_output_0_splitncnn_0 /Sub_output_0_splitncnn_2 /Neg_1_output_0 /Concat_6_output_0
Crop                     /Slice_11                1 1 /Div_output_0_splitncnn_2 /Slice_11_output_0 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     /Slice_12                1 1 /Div_output_0_splitncnn_1 /Slice_12_output_0 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   /Concat_7                2 1 /Slice_11_output_0 /Slice_12_output_0 /Concat_7_output_0
Interp                   /block1_1/Resize         1 1 /Concat_6_output_0 /block1_1/Resize_output_0 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   /block1_1/Resize_1       1 1 /Concat_7_output_0 /block1_1/Resize_1_output_0 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 /block1_1/Div            1 1 /block1_1/Resize_1_output_0 /block1_1/Div_output_0 0=3 1=1 2=4.000000e+00
Concat                   /block1_1/Concat         2 1 /block1_1/Resize_output_0 /block1_1/Div_output_0 /block1_1/Concat_output_0
Convolution              /block1/conv0/conv0.0/conv0.0.0_1/Conv 1 1 /block1_1/Concat_output_0 /block1/conv0/conv0.0/conv0.0.1_1/LeakyRelu_output_0 0=64 1=3 3=2 4=1 5=1 6=11520 9=2 -23310=1,2.000000e-01
Convolution              /block1/conv0/conv0.1/conv0.1.0_1/Conv 1 1 /block1/conv0/conv0.0/conv0.0.1_1/LeakyRelu_output_0 /block1/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0 0=128 1=3 3=2 4=1 5=1 6=73728 9=2 -23310=1,2.000000e-01
Split                    splitncnn_73             1 2 /block1/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0 /block1/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0_splitncnn_0 /block1/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.0/conv_1/Conv 1 1 /block1/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.0/conv_1/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.0_1/Mul 2 1 /block1/convblock/convblock.0/conv_1/Conv_output_0 block1.convblock.0.beta_splitncnn_0 /block1/convblock/convblock.0_1/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.0_1/Add 2 1 /block1/convblock/convblock.0_1/Mul_output_0 /block1/conv0/conv0.1/conv0.1.1_1/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.0_1/Add_output_0
ReLU                     /block1/convblock/convblock.0/relu_1/LeakyRelu 1 1 /block1/convblock/convblock.0_1/Add_output_0 /block1/convblock/convblock.0/relu_1/LeakyRelu_output_0 0=2.000000e-01
Split                    splitncnn_74             1 2 /block1/convblock/convblock.0/relu_1/LeakyRelu_output_0 /block1/convblock/convblock.0/relu_1/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.0/relu_1/LeakyRelu_output_0_splitncnn_1
Convolution              /block1/convblock/convblock.1/conv_1/Conv 1 1 /block1/convblock/convblock.0/relu_1/LeakyRelu_output_0_splitncnn_1 /block1/convblock/convblock.1/conv_1/Conv_output_0 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 /block1/convblock/convblock.1_1/Mul 2 1 /block1/convblock/convblock.1/conv_1/Conv_output_0 block1.convblock.1.beta_splitncnn_0 /block1/convblock/convblock.1_1/Mul_output_0 0=2
BinaryOp                 /block1/convblock/convblock.1_1/Add 2 1 /block1/convblock/convblock.1_1/Mul_output_0 /block1/convblock/convblock.0/relu_1/LeakyRelu_output_0_splitncnn_0 /block1/convblock/convblock.1_1/Add_output_0
ReLU                     /block1/convblock/convblock.1/relu_1/LeakyRelu 1 1 /block1/convblock/convblock.1_1/Add_output_0 /block1/convblock/convblock.1/relu_1/LeakyRelu_output_0 0=2.000000e-01
