7767517
316 393
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 7 in0 in0_splitncnn_0 in0_splitncnn_1 in0_splitncnn_2 in0_splitncnn_3 in0_splitncnn_4 in0_splitncnn_5 in0_splitncnn_6
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 7 in1 in1_splitncnn_0 in1_splitncnn_1 in1_splitncnn_2 in1_splitncnn_3 in1_splitncnn_4 in1_splitncnn_5 in1_splitncnn_6
Input                    in2                      0 1 in2
MemoryData               block0.convblock.0.beta  0 1 block0.convblock.0.beta 0=1 1=1 2=256
MemoryData               block0.convblock.1.beta  0 1 block0.convblock.1.beta 0=1 1=1 2=256
MemoryData               block0.convblock.2.beta  0 1 block0.convblock.2.beta 0=1 1=1 2=256
MemoryData               block0.convblock.3.beta  0 1 block0.convblock.3.beta 0=1 1=1 2=256
MemoryData               block0.convblock.4.beta  0 1 block0.convblock.4.beta 0=1 1=1 2=256
MemoryData               block0.convblock.5.beta  0 1 block0.convblock.5.beta 0=1 1=1 2=256
MemoryData               block0.convblock.6.beta  0 1 block0.convblock.6.beta 0=1 1=1 2=256
MemoryData               block0.convblock.7.beta  0 1 block0.convblock.7.beta 0=1 1=1 2=256
MemoryData               block1.convblock.0.beta  0 1 block1.convblock.0.beta 0=1 1=1 2=192
MemoryData               block1.convblock.1.beta  0 1 block1.convblock.1.beta 0=1 1=1 2=192
MemoryData               block1.convblock.2.beta  0 1 block1.convblock.2.beta 0=1 1=1 2=192
MemoryData               block1.convblock.3.beta  0 1 block1.convblock.3.beta 0=1 1=1 2=192
MemoryData               block1.convblock.4.beta  0 1 block1.convblock.4.beta 0=1 1=1 2=192
MemoryData               block1.convblock.5.beta  0 1 block1.convblock.5.beta 0=1 1=1 2=192
MemoryData               block1.convblock.6.beta  0 1 block1.convblock.6.beta 0=1 1=1 2=192
MemoryData               block1.convblock.7.beta  0 1 block1.convblock.7.beta 0=1 1=1 2=192
MemoryData               block2.convblock.0.beta  0 1 block2.convblock.0.beta 0=1 1=1 2=96
MemoryData               block2.convblock.1.beta  0 1 block2.convblock.1.beta 0=1 1=1 2=96
MemoryData               block2.convblock.2.beta  0 1 block2.convblock.2.beta 0=1 1=1 2=96
MemoryData               block2.convblock.3.beta  0 1 block2.convblock.3.beta 0=1 1=1 2=96
MemoryData               block2.convblock.4.beta  0 1 block2.convblock.4.beta 0=1 1=1 2=96
MemoryData               block2.convblock.5.beta  0 1 block2.convblock.5.beta 0=1 1=1 2=96
MemoryData               block2.convblock.6.beta  0 1 block2.convblock.6.beta 0=1 1=1 2=96
MemoryData               block2.convblock.7.beta  0 1 block2.convblock.7.beta 0=1 1=1 2=96
MemoryData               block3.convblock.0.beta  0 1 block3.convblock.0.beta 0=1 1=1 2=48
MemoryData               block3.convblock.1.beta  0 1 block3.convblock.1.beta 0=1 1=1 2=48
MemoryData               block3.convblock.2.beta  0 1 block3.convblock.2.beta 0=1 1=1 2=48
MemoryData               block3.convblock.3.beta  0 1 block3.convblock.3.beta 0=1 1=1 2=48
MemoryData               block3.convblock.4.beta  0 1 block3.convblock.4.beta 0=1 1=1 2=48
MemoryData               block3.convblock.5.beta  0 1 block3.convblock.5.beta 0=1 1=1 2=48
MemoryData               block3.convblock.6.beta  0 1 block3.convblock.6.beta 0=1 1=1 2=48
MemoryData               block3.convblock.7.beta  0 1 block3.convblock.7.beta 0=1 1=1 2=48
Concat                   Concat_0                 2 1 in0_splitncnn_6 in1_splitncnn_6 171
Crop                     Slice_5                  1 1 171 176 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_7                    1 1 176 178 0=2 1=1
BinaryOp                 Add_9                    1 1 178 180 1=1 2=1.000000e+00
BinaryOp                 Mul_10                   2 1 180 in2 181 0=2
Split                    splitncnn_0              1 4 181 181_splitncnn_0 181_splitncnn_1 181_splitncnn_2 181_splitncnn_3
Crop                     Slice_16                 1 1 in0_splitncnn_5 187 -23309=1,0 -23310=1,3 -23311=1,0
Convolution              Conv_17                  1 1 187 189 0=32 1=3 3=2 4=1 5=1 6=864 9=2 -23310=1,2.000000e-01
Convolution              Conv_19                  1 1 189 191 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,2.000000e-01
Convolution              Conv_21                  1 1 191 193 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,2.000000e-01
Deconvolution            ConvTranspose_23         1 1 193 194 0=8 1=4 3=2 4=1 5=1 6=4096
Split                    splitncnn_1              1 4 194 194_splitncnn_0 194_splitncnn_1 194_splitncnn_2 194_splitncnn_3
Crop                     Slice_28                 1 1 in1_splitncnn_5 199 -23309=1,0 -23310=1,3 -23311=1,0
Convolution              Conv_29                  1 1 199 201 0=32 1=3 3=2 4=1 5=1 6=864 9=2 -23310=1,2.000000e-01
Convolution              Conv_31                  1 1 201 203 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,2.000000e-01
Convolution              Conv_33                  1 1 203 205 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,2.000000e-01
Deconvolution            ConvTranspose_35         1 1 205 206 0=8 1=4 3=2 4=1 5=1 6=4096
Split                    splitncnn_2              1 4 206 206_splitncnn_0 206_splitncnn_1 206_splitncnn_2 206_splitncnn_3
Crop                     Slice_40                 1 1 in0_splitncnn_4 211 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_45                 1 1 in1_splitncnn_4 216 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_46                5 1 211 216 194_splitncnn_3 206_splitncnn_3 181_splitncnn_3 217
Interp                   Resize_48                1 1 217 222 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_49                  1 1 222 224 0=128 1=3 3=2 4=1 5=1 6=26496 9=2 -23310=1,2.000000e-01
Convolution              Conv_51                  1 1 224 226 0=256 1=3 3=2 4=1 5=1 6=294912 9=2 -23310=1,2.000000e-01
Split                    splitncnn_3              1 2 226 226_splitncnn_0 226_splitncnn_1
Convolution              Conv_53                  1 1 226_splitncnn_1 227 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_54                   2 1 227 block0.convblock.0.beta 228 0=2
BinaryOp                 Add_55                   2 1 228 226_splitncnn_0 229
ReLU                     LeakyRelu_56             1 1 229 230 0=2.000000e-01
Split                    splitncnn_4              1 2 230 230_splitncnn_0 230_splitncnn_1
Convolution              Conv_57                  1 1 230_splitncnn_1 231 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_58                   2 1 231 block0.convblock.1.beta 232 0=2
BinaryOp                 Add_59                   2 1 232 230_splitncnn_0 233
ReLU                     LeakyRelu_60             1 1 233 234 0=2.000000e-01
Split                    splitncnn_5              1 2 234 234_splitncnn_0 234_splitncnn_1
Convolution              Conv_61                  1 1 234_splitncnn_1 235 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_62                   2 1 235 block0.convblock.2.beta 236 0=2
BinaryOp                 Add_63                   2 1 236 234_splitncnn_0 237
ReLU                     LeakyRelu_64             1 1 237 238 0=2.000000e-01
Split                    splitncnn_6              1 2 238 238_splitncnn_0 238_splitncnn_1
Convolution              Conv_65                  1 1 238_splitncnn_1 239 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_66                   2 1 239 block0.convblock.3.beta 240 0=2
BinaryOp                 Add_67                   2 1 240 238_splitncnn_0 241
ReLU                     LeakyRelu_68             1 1 241 242 0=2.000000e-01
Split                    splitncnn_7              1 2 242 242_splitncnn_0 242_splitncnn_1
Convolution              Conv_69                  1 1 242_splitncnn_1 243 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_70                   2 1 243 block0.convblock.4.beta 244 0=2
BinaryOp                 Add_71                   2 1 244 242_splitncnn_0 245
ReLU                     LeakyRelu_72             1 1 245 246 0=2.000000e-01
Split                    splitncnn_8              1 2 246 246_splitncnn_0 246_splitncnn_1
Convolution              Conv_73                  1 1 246_splitncnn_1 247 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_74                   2 1 247 block0.convblock.5.beta 248 0=2
BinaryOp                 Add_75                   2 1 248 246_splitncnn_0 249
ReLU                     LeakyRelu_76             1 1 249 250 0=2.000000e-01
Split                    splitncnn_9              1 2 250 250_splitncnn_0 250_splitncnn_1
Convolution              Conv_77                  1 1 250_splitncnn_1 251 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_78                   2 1 251 block0.convblock.6.beta 252 0=2
BinaryOp                 Add_79                   2 1 252 250_splitncnn_0 253
ReLU                     LeakyRelu_80             1 1 253 254 0=2.000000e-01
Split                    splitncnn_10             1 2 254 254_splitncnn_0 254_splitncnn_1
Convolution              Conv_81                  1 1 254_splitncnn_1 255 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_82                   2 1 255 block0.convblock.7.beta 256 0=2
BinaryOp                 Add_83                   2 1 256 254_splitncnn_0 257
ReLU                     LeakyRelu_84             1 1 257 258 0=2.000000e-01
Deconvolution            ConvTranspose_85         1 1 258 259 0=52 1=4 3=2 4=1 5=1 6=212992
PixelShuffle             DepthToSpace_86          1 1 259 flow0 0=2
Interp                   Resize_88                1 1 flow0 265 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_11             1 3 265 265_splitncnn_0 265_splitncnn_1 265_splitncnn_2
Crop                     Slice_93                 1 1 265_splitncnn_2 270 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_95                   1 1 270 272 0=2 1=1 2=8.000000e+00
Split                    splitncnn_12             1 6 272 272_splitncnn_0 272_splitncnn_1 272_splitncnn_2 272_splitncnn_3 272_splitncnn_4 272_splitncnn_5
Crop                     Slice_100                1 1 265_splitncnn_1 277 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_105                1 1 265_splitncnn_0 282 -23309=1,5 -23310=1,2147483647 -23311=1,0
Crop                     Slice_110                1 1 272_splitncnn_5 287 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_111                  2 1 in0_splitncnn_3 287 288 0=6
Crop                     Slice_116                1 1 272_splitncnn_4 293 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_117                  2 1 in1_splitncnn_3 293 294 0=6
Crop                     Slice_122                1 1 272_splitncnn_3 299 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_123                  2 1 194_splitncnn_2 299 300 0=6
Crop                     Slice_128                1 1 272_splitncnn_2 305 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_129                  2 1 206_splitncnn_2 305 306 0=6
Crop                     Slice_134                1 1 288 311 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_139                1 1 294 316 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_140               7 1 311 316 300 306 181_splitncnn_2 277 282 317
Interp                   Resize_142               1 1 317 322 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_144               1 1 272_splitncnn_1 327 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Div_147                  1 1 327 332 0=3 1=1 2=4.000000e+00
Concat                   Concat_148               2 1 322 332 333
Convolution              Conv_149                 1 1 333 335 0=96 1=3 3=2 4=1 5=1 6=31104 9=2 -23310=1,2.000000e-01
Convolution              Conv_151                 1 1 335 337 0=192 1=3 3=2 4=1 5=1 6=165888 9=2 -23310=1,2.000000e-01
Split                    splitncnn_13             1 2 337 337_splitncnn_0 337_splitncnn_1
Convolution              Conv_153                 1 1 337_splitncnn_1 338 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_154                  2 1 338 block1.convblock.0.beta 339 0=2
BinaryOp                 Add_155                  2 1 339 337_splitncnn_0 340
ReLU                     LeakyRelu_156            1 1 340 341 0=2.000000e-01
Split                    splitncnn_14             1 2 341 341_splitncnn_0 341_splitncnn_1
Convolution              Conv_157                 1 1 341_splitncnn_1 342 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_158                  2 1 342 block1.convblock.1.beta 343 0=2
BinaryOp                 Add_159                  2 1 343 341_splitncnn_0 344
ReLU                     LeakyRelu_160            1 1 344 345 0=2.000000e-01
Split                    splitncnn_15             1 2 345 345_splitncnn_0 345_splitncnn_1
Convolution              Conv_161                 1 1 345_splitncnn_1 346 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_162                  2 1 346 block1.convblock.2.beta 347 0=2
BinaryOp                 Add_163                  2 1 347 345_splitncnn_0 348
ReLU                     LeakyRelu_164            1 1 348 349 0=2.000000e-01
Split                    splitncnn_16             1 2 349 349_splitncnn_0 349_splitncnn_1
Convolution              Conv_165                 1 1 349_splitncnn_1 350 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_166                  2 1 350 block1.convblock.3.beta 351 0=2
BinaryOp                 Add_167                  2 1 351 349_splitncnn_0 352
ReLU                     LeakyRelu_168            1 1 352 353 0=2.000000e-01
Split                    splitncnn_17             1 2 353 353_splitncnn_0 353_splitncnn_1
Convolution              Conv_169                 1 1 353_splitncnn_1 354 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_170                  2 1 354 block1.convblock.4.beta 355 0=2
BinaryOp                 Add_171                  2 1 355 353_splitncnn_0 356
ReLU                     LeakyRelu_172            1 1 356 357 0=2.000000e-01
Split                    splitncnn_18             1 2 357 357_splitncnn_0 357_splitncnn_1
Convolution              Conv_173                 1 1 357_splitncnn_1 358 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_174                  2 1 358 block1.convblock.5.beta 359 0=2
BinaryOp                 Add_175                  2 1 359 357_splitncnn_0 360
ReLU                     LeakyRelu_176            1 1 360 361 0=2.000000e-01
Split                    splitncnn_19             1 2 361 361_splitncnn_0 361_splitncnn_1
Convolution              Conv_177                 1 1 361_splitncnn_1 362 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_178                  2 1 362 block1.convblock.6.beta 363 0=2
BinaryOp                 Add_179                  2 1 363 361_splitncnn_0 364
ReLU                     LeakyRelu_180            1 1 364 365 0=2.000000e-01
Split                    splitncnn_20             1 2 365 365_splitncnn_0 365_splitncnn_1
Convolution              Conv_181                 1 1 365_splitncnn_1 366 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_182                  2 1 366 block1.convblock.7.beta 367 0=2
BinaryOp                 Add_183                  2 1 367 365_splitncnn_0 368
ReLU                     LeakyRelu_184            1 1 368 369 0=2.000000e-01
Deconvolution            ConvTranspose_185        1 1 369 370 0=52 1=4 3=2 4=1 5=1 6=159744
PixelShuffle             DepthToSpace_186         1 1 370 flow1 0=2
Interp                   Resize_188               1 1 flow1 376 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_21             1 3 376 376_splitncnn_0 376_splitncnn_1 376_splitncnn_2
Crop                     Slice_193                1 1 376_splitncnn_2 381 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_200                1 1 376_splitncnn_1 388 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_205                1 1 376_splitncnn_0 393 -23309=1,5 -23310=1,2147483647 -23311=1,0
Eltwise                  Add_206                  2 1 272_splitncnn_0 381 394 0=1 -23301=2,1.000000e+00,4.000000e+00
Split                    splitncnn_22             1 6 394 394_splitncnn_0 394_splitncnn_1 394_splitncnn_2 394_splitncnn_3 394_splitncnn_4 394_splitncnn_5
Crop                     Slice_211                1 1 394_splitncnn_5 399 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_212                  2 1 in0_splitncnn_2 399 400 0=6
Crop                     Slice_217                1 1 394_splitncnn_4 405 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_218                  2 1 in1_splitncnn_2 405 406 0=6
Crop                     Slice_223                1 1 394_splitncnn_3 411 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_224                  2 1 194_splitncnn_1 411 412 0=6
Crop                     Slice_229                1 1 394_splitncnn_2 417 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_230                  2 1 206_splitncnn_1 417 418 0=6
Crop                     Slice_235                1 1 400 423 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_240                1 1 406 428 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_241               7 1 423 428 412 418 181_splitncnn_1 388 393 429
Interp                   Resize_243               1 1 429 434 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_245               1 1 394_splitncnn_1 439 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Div_248                  1 1 439 444 0=3 1=1 2=2.000000e+00
Concat                   Concat_249               2 1 434 444 445
Convolution              Conv_250                 1 1 445 447 0=48 1=3 3=2 4=1 5=1 6=15552 9=2 -23310=1,2.000000e-01
Convolution              Conv_252                 1 1 447 449 0=96 1=3 3=2 4=1 5=1 6=41472 9=2 -23310=1,2.000000e-01
Split                    splitncnn_23             1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution              Conv_254                 1 1 449_splitncnn_1 450 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_255                  2 1 450 block2.convblock.0.beta 451 0=2
BinaryOp                 Add_256                  2 1 451 449_splitncnn_0 452
ReLU                     LeakyRelu_257            1 1 452 453 0=2.000000e-01
Split                    splitncnn_24             1 2 453 453_splitncnn_0 453_splitncnn_1
Convolution              Conv_258                 1 1 453_splitncnn_1 454 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_259                  2 1 454 block2.convblock.1.beta 455 0=2
BinaryOp                 Add_260                  2 1 455 453_splitncnn_0 456
ReLU                     LeakyRelu_261            1 1 456 457 0=2.000000e-01
Split                    splitncnn_25             1 2 457 457_splitncnn_0 457_splitncnn_1
Convolution              Conv_262                 1 1 457_splitncnn_1 458 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_263                  2 1 458 block2.convblock.2.beta 459 0=2
BinaryOp                 Add_264                  2 1 459 457_splitncnn_0 460
ReLU                     LeakyRelu_265            1 1 460 461 0=2.000000e-01
Split                    splitncnn_26             1 2 461 461_splitncnn_0 461_splitncnn_1
Convolution              Conv_266                 1 1 461_splitncnn_1 462 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_267                  2 1 462 block2.convblock.3.beta 463 0=2
BinaryOp                 Add_268                  2 1 463 461_splitncnn_0 464
ReLU                     LeakyRelu_269            1 1 464 465 0=2.000000e-01
Split                    splitncnn_27             1 2 465 465_splitncnn_0 465_splitncnn_1
Convolution              Conv_270                 1 1 465_splitncnn_1 466 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_271                  2 1 466 block2.convblock.4.beta 467 0=2
BinaryOp                 Add_272                  2 1 467 465_splitncnn_0 468
ReLU                     LeakyRelu_273            1 1 468 469 0=2.000000e-01
Split                    splitncnn_28             1 2 469 469_splitncnn_0 469_splitncnn_1
Convolution              Conv_274                 1 1 469_splitncnn_1 470 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_275                  2 1 470 block2.convblock.5.beta 471 0=2
BinaryOp                 Add_276                  2 1 471 469_splitncnn_0 472
ReLU                     LeakyRelu_277            1 1 472 473 0=2.000000e-01
Split                    splitncnn_29             1 2 473 473_splitncnn_0 473_splitncnn_1
Convolution              Conv_278                 1 1 473_splitncnn_1 474 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_279                  2 1 474 block2.convblock.6.beta 475 0=2
BinaryOp                 Add_280                  2 1 475 473_splitncnn_0 476
ReLU                     LeakyRelu_281            1 1 476 477 0=2.000000e-01
Split                    splitncnn_30             1 2 477 477_splitncnn_0 477_splitncnn_1
Convolution              Conv_282                 1 1 477_splitncnn_1 478 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_283                  2 1 478 block2.convblock.7.beta 479 0=2
BinaryOp                 Add_284                  2 1 479 477_splitncnn_0 480
ReLU                     LeakyRelu_285            1 1 480 481 0=2.000000e-01
Deconvolution            ConvTranspose_286        1 1 481 482 0=52 1=4 3=2 4=1 5=1 6=79872
PixelShuffle             DepthToSpace_287         1 1 482 flow2 0=2
Interp                   Resize_289               1 1 flow2 488 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_31             1 3 488 488_splitncnn_0 488_splitncnn_1 488_splitncnn_2
Crop                     Slice_294                1 1 488_splitncnn_2 493 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_301                1 1 488_splitncnn_1 500 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_306                1 1 488_splitncnn_0 505 -23309=1,5 -23310=1,2147483647 -23311=1,0
Eltwise                  Add_307                  2 1 394_splitncnn_0 493 506 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_32             1 6 506 506_splitncnn_0 506_splitncnn_1 506_splitncnn_2 506_splitncnn_3 506_splitncnn_4 506_splitncnn_5
Crop                     Slice_312                1 1 506_splitncnn_5 511 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_313                  2 1 in0_splitncnn_1 511 512 0=6
Crop                     Slice_318                1 1 506_splitncnn_4 517 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_319                  2 1 in1_splitncnn_1 517 518 0=6
Crop                     Slice_324                1 1 506_splitncnn_3 523 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_325                  2 1 194_splitncnn_0 523 524 0=6
Crop                     Slice_330                1 1 506_splitncnn_2 529 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_331                  2 1 206_splitncnn_0 529 530 0=6
Crop                     Slice_336                1 1 512 535 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_341                1 1 518 540 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_342               7 1 535 540 524 530 181_splitncnn_0 500 505 541
Interp                   Resize_344               1 1 541 546 0=2
Interp                   Resize_346               1 1 506_splitncnn_1 551 0=2
Concat                   Concat_350               2 1 546 551 557
Convolution              Conv_351                 1 1 557 559 0=24 1=3 3=2 4=1 5=1 6=7776 9=2 -23310=1,2.000000e-01
Convolution              Conv_353                 1 1 559 561 0=48 1=3 3=2 4=1 5=1 6=10368 9=2 -23310=1,2.000000e-01
Split                    splitncnn_33             1 2 561 561_splitncnn_0 561_splitncnn_1
Convolution              Conv_355                 1 1 561_splitncnn_1 562 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_356                  2 1 562 block3.convblock.0.beta 563 0=2
BinaryOp                 Add_357                  2 1 563 561_splitncnn_0 564
ReLU                     LeakyRelu_358            1 1 564 565 0=2.000000e-01
Split                    splitncnn_34             1 2 565 565_splitncnn_0 565_splitncnn_1
Convolution              Conv_359                 1 1 565_splitncnn_1 566 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_360                  2 1 566 block3.convblock.1.beta 567 0=2
BinaryOp                 Add_361                  2 1 567 565_splitncnn_0 568
ReLU                     LeakyRelu_362            1 1 568 569 0=2.000000e-01
Split                    splitncnn_35             1 2 569 569_splitncnn_0 569_splitncnn_1
Convolution              Conv_363                 1 1 569_splitncnn_1 570 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_364                  2 1 570 block3.convblock.2.beta 571 0=2
BinaryOp                 Add_365                  2 1 571 569_splitncnn_0 572
ReLU                     LeakyRelu_366            1 1 572 573 0=2.000000e-01
Split                    splitncnn_36             1 2 573 573_splitncnn_0 573_splitncnn_1
Convolution              Conv_367                 1 1 573_splitncnn_1 574 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_368                  2 1 574 block3.convblock.3.beta 575 0=2
BinaryOp                 Add_369                  2 1 575 573_splitncnn_0 576
ReLU                     LeakyRelu_370            1 1 576 577 0=2.000000e-01
Split                    splitncnn_37             1 2 577 577_splitncnn_0 577_splitncnn_1
Convolution              Conv_371                 1 1 577_splitncnn_1 578 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_372                  2 1 578 block3.convblock.4.beta 579 0=2
BinaryOp                 Add_373                  2 1 579 577_splitncnn_0 580
ReLU                     LeakyRelu_374            1 1 580 581 0=2.000000e-01
Split                    splitncnn_38             1 2 581 581_splitncnn_0 581_splitncnn_1
Convolution              Conv_375                 1 1 581_splitncnn_1 582 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_376                  2 1 582 block3.convblock.5.beta 583 0=2
BinaryOp                 Add_377                  2 1 583 581_splitncnn_0 584
ReLU                     LeakyRelu_378            1 1 584 585 0=2.000000e-01
Split                    splitncnn_39             1 2 585 585_splitncnn_0 585_splitncnn_1
Convolution              Conv_379                 1 1 585_splitncnn_1 586 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_380                  2 1 586 block3.convblock.6.beta 587 0=2
BinaryOp                 Add_381                  2 1 587 585_splitncnn_0 588
ReLU                     LeakyRelu_382            1 1 588 589 0=2.000000e-01
Split                    splitncnn_40             1 2 589 589_splitncnn_0 589_splitncnn_1
Convolution              Conv_383                 1 1 589_splitncnn_1 590 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_384                  2 1 590 block3.convblock.7.beta 591 0=2
BinaryOp                 Add_385                  2 1 591 589_splitncnn_0 592
ReLU                     LeakyRelu_386            1 1 592 593 0=2.000000e-01
Deconvolution            ConvTranspose_387        1 1 593 594 0=52 1=4 3=2 4=1 5=1 6=39936
PixelShuffle             DepthToSpace_388         1 1 594 flow3 0=2
Interp                   Resize_390               1 1 flow3 600 0=2
Split                    splitncnn_41             1 2 600 600_splitncnn_0 600_splitncnn_1
Crop                     Slice_395                1 1 600_splitncnn_1 605 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_402                1 1 600_splitncnn_0 612 -23309=1,4 -23310=1,5 -23311=1,0
BinaryOp                 Add_403                  2 1 506_splitncnn_0 605 613
Split                    splitncnn_42             1 2 613 613_splitncnn_0 613_splitncnn_1
Crop                     Slice_408                1 1 613_splitncnn_1 618 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_409                  2 1 in0_splitncnn_0 618 619 0=6
Crop                     Slice_414                1 1 613_splitncnn_0 624 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_415                  2 1 in1_splitncnn_0 624 625 0=6
Sigmoid                  Sigmoid_416              1 1 612 626
Split                    splitncnn_43             1 2 626 626_splitncnn_0 626_splitncnn_1
BinaryOp                 Mul_417                  2 1 619 626_splitncnn_1 627 0=2
BinaryOp                 Sub_419                  1 1 626_splitncnn_0 629 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_420                  2 1 625 629 630 0=2
BinaryOp                 Add_421                  2 1 627 630 out0
