7767517
299 362
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 6 in0 in0_splitncnn_0 in0_splitncnn_1 in0_splitncnn_2 in0_splitncnn_3 in0_splitncnn_4 in0_splitncnn_5
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 6 in1 in1_splitncnn_0 in1_splitncnn_1 in1_splitncnn_2 in1_splitncnn_3 in1_splitncnn_4 in1_splitncnn_5
Input                    in2                      0 1 in2
MemoryData               block0.convblock.0.beta  0 1 block0.convblock.0.beta 0=1 1=1 2=192
MemoryData               block0.convblock.1.beta  0 1 block0.convblock.1.beta 0=1 1=1 2=192
MemoryData               block0.convblock.2.beta  0 1 block0.convblock.2.beta 0=1 1=1 2=192
MemoryData               block0.convblock.3.beta  0 1 block0.convblock.3.beta 0=1 1=1 2=192
MemoryData               block0.convblock.4.beta  0 1 block0.convblock.4.beta 0=1 1=1 2=192
MemoryData               block0.convblock.5.beta  0 1 block0.convblock.5.beta 0=1 1=1 2=192
MemoryData               block0.convblock.6.beta  0 1 block0.convblock.6.beta 0=1 1=1 2=192
MemoryData               block0.convblock.7.beta  0 1 block0.convblock.7.beta 0=1 1=1 2=192
MemoryData               block1.convblock.0.beta  0 1 block1.convblock.0.beta 0=1 1=1 2=128
MemoryData               block1.convblock.1.beta  0 1 block1.convblock.1.beta 0=1 1=1 2=128
MemoryData               block1.convblock.2.beta  0 1 block1.convblock.2.beta 0=1 1=1 2=128
MemoryData               block1.convblock.3.beta  0 1 block1.convblock.3.beta 0=1 1=1 2=128
MemoryData               block1.convblock.4.beta  0 1 block1.convblock.4.beta 0=1 1=1 2=128
MemoryData               block1.convblock.5.beta  0 1 block1.convblock.5.beta 0=1 1=1 2=128
MemoryData               block1.convblock.6.beta  0 1 block1.convblock.6.beta 0=1 1=1 2=128
MemoryData               block1.convblock.7.beta  0 1 block1.convblock.7.beta 0=1 1=1 2=128
MemoryData               block2.convblock.0.beta  0 1 block2.convblock.0.beta 0=1 1=1 2=96
MemoryData               block2.convblock.1.beta  0 1 block2.convblock.1.beta 0=1 1=1 2=96
MemoryData               block2.convblock.2.beta  0 1 block2.convblock.2.beta 0=1 1=1 2=96
MemoryData               block2.convblock.3.beta  0 1 block2.convblock.3.beta 0=1 1=1 2=96
MemoryData               block2.convblock.4.beta  0 1 block2.convblock.4.beta 0=1 1=1 2=96
MemoryData               block2.convblock.5.beta  0 1 block2.convblock.5.beta 0=1 1=1 2=96
MemoryData               block2.convblock.6.beta  0 1 block2.convblock.6.beta 0=1 1=1 2=96
MemoryData               block2.convblock.7.beta  0 1 block2.convblock.7.beta 0=1 1=1 2=96
MemoryData               block3.convblock.0.beta  0 1 block3.convblock.0.beta 0=1 1=1 2=64
MemoryData               block3.convblock.1.beta  0 1 block3.convblock.1.beta 0=1 1=1 2=64
MemoryData               block3.convblock.2.beta  0 1 block3.convblock.2.beta 0=1 1=1 2=64
MemoryData               block3.convblock.3.beta  0 1 block3.convblock.3.beta 0=1 1=1 2=64
MemoryData               block3.convblock.4.beta  0 1 block3.convblock.4.beta 0=1 1=1 2=64
MemoryData               block3.convblock.5.beta  0 1 block3.convblock.5.beta 0=1 1=1 2=64
MemoryData               block3.convblock.6.beta  0 1 block3.convblock.6.beta 0=1 1=1 2=64
MemoryData               block3.convblock.7.beta  0 1 block3.convblock.7.beta 0=1 1=1 2=64
Concat                   Concat_0                 2 1 in0_splitncnn_5 in1_splitncnn_5 123
Crop                     Slice_5                  1 1 123 128 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_7                    1 1 128 130 0=2 1=1
BinaryOp                 Add_9                    1 1 130 132 1=1 2=1.000000e+00
BinaryOp                 Mul_10                   2 1 132 in2 133 0=2
Split                    splitncnn_0              1 4 133 133_splitncnn_0 133_splitncnn_1 133_splitncnn_2 133_splitncnn_3
Crop                     Slice_16                 1 1 in0_splitncnn_4 139 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_21                 1 1 in1_splitncnn_4 144 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_22                3 1 139 144 133_splitncnn_3 145
Interp                   Resize_24                1 1 145 150 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_25                  1 1 150 152 0=96 1=3 3=2 4=1 5=1 6=6048 9=2 -23310=1,2.000000e-01
Convolution              Conv_27                  1 1 152 154 0=192 1=3 3=2 4=1 5=1 6=165888 9=2 -23310=1,2.000000e-01
Split                    splitncnn_1              1 2 154 154_splitncnn_0 154_splitncnn_1
Convolution              Conv_29                  1 1 154_splitncnn_1 155 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_30                   2 1 155 block0.convblock.0.beta 156 0=2
BinaryOp                 Add_31                   2 1 156 154_splitncnn_0 157
ReLU                     LeakyRelu_32             1 1 157 158 0=2.000000e-01
Split                    splitncnn_2              1 2 158 158_splitncnn_0 158_splitncnn_1
Convolution              Conv_33                  1 1 158_splitncnn_1 159 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_34                   2 1 159 block0.convblock.1.beta 160 0=2
BinaryOp                 Add_35                   2 1 160 158_splitncnn_0 161
ReLU                     LeakyRelu_36             1 1 161 162 0=2.000000e-01
Split                    splitncnn_3              1 2 162 162_splitncnn_0 162_splitncnn_1
Convolution              Conv_37                  1 1 162_splitncnn_1 163 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_38                   2 1 163 block0.convblock.2.beta 164 0=2
BinaryOp                 Add_39                   2 1 164 162_splitncnn_0 165
ReLU                     LeakyRelu_40             1 1 165 166 0=2.000000e-01
Split                    splitncnn_4              1 2 166 166_splitncnn_0 166_splitncnn_1
Convolution              Conv_41                  1 1 166_splitncnn_1 167 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_42                   2 1 167 block0.convblock.3.beta 168 0=2
BinaryOp                 Add_43                   2 1 168 166_splitncnn_0 169
ReLU                     LeakyRelu_44             1 1 169 170 0=2.000000e-01
Split                    splitncnn_5              1 2 170 170_splitncnn_0 170_splitncnn_1
Convolution              Conv_45                  1 1 170_splitncnn_1 171 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_46                   2 1 171 block0.convblock.4.beta 172 0=2
BinaryOp                 Add_47                   2 1 172 170_splitncnn_0 173
ReLU                     LeakyRelu_48             1 1 173 174 0=2.000000e-01
Split                    splitncnn_6              1 2 174 174_splitncnn_0 174_splitncnn_1
Convolution              Conv_49                  1 1 174_splitncnn_1 175 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_50                   2 1 175 block0.convblock.5.beta 176 0=2
BinaryOp                 Add_51                   2 1 176 174_splitncnn_0 177
ReLU                     LeakyRelu_52             1 1 177 178 0=2.000000e-01
Split                    splitncnn_7              1 2 178 178_splitncnn_0 178_splitncnn_1
Convolution              Conv_53                  1 1 178_splitncnn_1 179 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_54                   2 1 179 block0.convblock.6.beta 180 0=2
BinaryOp                 Add_55                   2 1 180 178_splitncnn_0 181
ReLU                     LeakyRelu_56             1 1 181 182 0=2.000000e-01
Split                    splitncnn_8              1 2 182 182_splitncnn_0 182_splitncnn_1
Convolution              Conv_57                  1 1 182_splitncnn_1 183 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_58                   2 1 183 block0.convblock.7.beta 184 0=2
BinaryOp                 Add_59                   2 1 184 182_splitncnn_0 185
ReLU                     LeakyRelu_60             1 1 185 186 0=2.000000e-01
Deconvolution            ConvTranspose_61         1 1 186 187 0=24 1=4 3=2 4=1 5=1 6=73728
PixelShuffle             DepthToSpace_62          1 1 187 188 0=2
Interp                   Resize_64                1 1 188 193 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_9              1 2 193 193_splitncnn_0 193_splitncnn_1
Crop                     Slice_69                 1 1 193_splitncnn_1 198 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_71                   1 1 198 200 0=2 1=1 2=8.000000e+00
Split                    splitncnn_10             1 4 200 200_splitncnn_0 200_splitncnn_1 200_splitncnn_2 200_splitncnn_3
Crop                     Slice_76                 1 1 193_splitncnn_0 205 -23309=1,4 -23310=1,5 -23311=1,0
Split                    splitncnn_11             1 2 205 205_splitncnn_0 205_splitncnn_1
Crop                     Slice_81                 1 1 200_splitncnn_3 210 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_82                   2 1 in0_splitncnn_3 210 211 0=6
Crop                     Slice_87                 1 1 200_splitncnn_2 216 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_88                   2 1 in1_splitncnn_3 216 217 0=6
Crop                     Slice_93                 1 1 211 222 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_98                 1 1 217 227 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_99                4 1 222 227 133_splitncnn_2 205_splitncnn_1 228
Interp                   Resize_101               1 1 228 233 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_103               1 1 200_splitncnn_1 238 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_105                  1 1 238 240 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_106                  1 1 240 243 0=3 1=1 2=4.000000e+00
Concat                   Concat_107               2 1 233 243 244
Convolution              Conv_108                 1 1 244 246 0=64 1=3 3=2 4=1 5=1 6=6912 9=2 -23310=1,2.000000e-01
Convolution              Conv_110                 1 1 246 248 0=128 1=3 3=2 4=1 5=1 6=73728 9=2 -23310=1,2.000000e-01
Split                    splitncnn_12             1 2 248 248_splitncnn_0 248_splitncnn_1
Convolution              Conv_112                 1 1 248_splitncnn_1 249 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_113                  2 1 249 block1.convblock.0.beta 250 0=2
BinaryOp                 Add_114                  2 1 250 248_splitncnn_0 251
ReLU                     LeakyRelu_115            1 1 251 252 0=2.000000e-01
Split                    splitncnn_13             1 2 252 252_splitncnn_0 252_splitncnn_1
Convolution              Conv_116                 1 1 252_splitncnn_1 253 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_117                  2 1 253 block1.convblock.1.beta 254 0=2
BinaryOp                 Add_118                  2 1 254 252_splitncnn_0 255
ReLU                     LeakyRelu_119            1 1 255 256 0=2.000000e-01
Split                    splitncnn_14             1 2 256 256_splitncnn_0 256_splitncnn_1
Convolution              Conv_120                 1 1 256_splitncnn_1 257 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_121                  2 1 257 block1.convblock.2.beta 258 0=2
BinaryOp                 Add_122                  2 1 258 256_splitncnn_0 259
ReLU                     LeakyRelu_123            1 1 259 260 0=2.000000e-01
Split                    splitncnn_15             1 2 260 260_splitncnn_0 260_splitncnn_1
Convolution              Conv_124                 1 1 260_splitncnn_1 261 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_125                  2 1 261 block1.convblock.3.beta 262 0=2
BinaryOp                 Add_126                  2 1 262 260_splitncnn_0 263
ReLU                     LeakyRelu_127            1 1 263 264 0=2.000000e-01
Split                    splitncnn_16             1 2 264 264_splitncnn_0 264_splitncnn_1
Convolution              Conv_128                 1 1 264_splitncnn_1 265 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_129                  2 1 265 block1.convblock.4.beta 266 0=2
BinaryOp                 Add_130                  2 1 266 264_splitncnn_0 267
ReLU                     LeakyRelu_131            1 1 267 268 0=2.000000e-01
Split                    splitncnn_17             1 2 268 268_splitncnn_0 268_splitncnn_1
Convolution              Conv_132                 1 1 268_splitncnn_1 269 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_133                  2 1 269 block1.convblock.5.beta 270 0=2
BinaryOp                 Add_134                  2 1 270 268_splitncnn_0 271
ReLU                     LeakyRelu_135            1 1 271 272 0=2.000000e-01
Split                    splitncnn_18             1 2 272 272_splitncnn_0 272_splitncnn_1
Convolution              Conv_136                 1 1 272_splitncnn_1 273 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_137                  2 1 273 block1.convblock.6.beta 274 0=2
BinaryOp                 Add_138                  2 1 274 272_splitncnn_0 275
ReLU                     LeakyRelu_139            1 1 275 276 0=2.000000e-01
Split                    splitncnn_19             1 2 276 276_splitncnn_0 276_splitncnn_1
Convolution              Conv_140                 1 1 276_splitncnn_1 277 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_141                  2 1 277 block1.convblock.7.beta 278 0=2
BinaryOp                 Add_142                  2 1 278 276_splitncnn_0 279
ReLU                     LeakyRelu_143            1 1 279 280 0=2.000000e-01
Deconvolution            ConvTranspose_144        1 1 280 281 0=24 1=4 3=2 4=1 5=1 6=49152
PixelShuffle             DepthToSpace_145         1 1 281 282 0=2
Interp                   Resize_147               1 1 282 287 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_20             1 2 287 287_splitncnn_0 287_splitncnn_1
Crop                     Slice_152                1 1 287_splitncnn_1 292 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_159                1 1 287_splitncnn_0 299 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_160                  2 1 200_splitncnn_0 292 300 0=1 -23301=2,1.000000e+00,4.000000e+00
Split                    splitncnn_21             1 4 300 300_splitncnn_0 300_splitncnn_1 300_splitncnn_2 300_splitncnn_3
BinaryOp                 Add_161                  2 1 205_splitncnn_0 299 301
Split                    splitncnn_22             1 2 301 301_splitncnn_0 301_splitncnn_1
Crop                     Slice_166                1 1 300_splitncnn_3 306 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_167                  2 1 in0_splitncnn_2 306 307 0=6
Crop                     Slice_172                1 1 300_splitncnn_2 312 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_173                  2 1 in1_splitncnn_2 312 313 0=6
Crop                     Slice_178                1 1 307 318 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_183                1 1 313 323 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_184               4 1 318 323 133_splitncnn_1 301_splitncnn_1 324
Interp                   Resize_186               1 1 324 329 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_188               1 1 300_splitncnn_1 334 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_190                  1 1 334 336 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_191                  1 1 336 339 0=3 1=1 2=2.000000e+00
Concat                   Concat_192               2 1 329 339 340
Convolution              Conv_193                 1 1 340 342 0=48 1=3 3=2 4=1 5=1 6=5184 9=2 -23310=1,2.000000e-01
Convolution              Conv_195                 1 1 342 344 0=96 1=3 3=2 4=1 5=1 6=41472 9=2 -23310=1,2.000000e-01
Split                    splitncnn_23             1 2 344 344_splitncnn_0 344_splitncnn_1
Convolution              Conv_197                 1 1 344_splitncnn_1 345 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_198                  2 1 345 block2.convblock.0.beta 346 0=2
BinaryOp                 Add_199                  2 1 346 344_splitncnn_0 347
ReLU                     LeakyRelu_200            1 1 347 348 0=2.000000e-01
Split                    splitncnn_24             1 2 348 348_splitncnn_0 348_splitncnn_1
Convolution              Conv_201                 1 1 348_splitncnn_1 349 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_202                  2 1 349 block2.convblock.1.beta 350 0=2
BinaryOp                 Add_203                  2 1 350 348_splitncnn_0 351
ReLU                     LeakyRelu_204            1 1 351 352 0=2.000000e-01
Split                    splitncnn_25             1 2 352 352_splitncnn_0 352_splitncnn_1
Convolution              Conv_205                 1 1 352_splitncnn_1 353 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_206                  2 1 353 block2.convblock.2.beta 354 0=2
BinaryOp                 Add_207                  2 1 354 352_splitncnn_0 355
ReLU                     LeakyRelu_208            1 1 355 356 0=2.000000e-01
Split                    splitncnn_26             1 2 356 356_splitncnn_0 356_splitncnn_1
Convolution              Conv_209                 1 1 356_splitncnn_1 357 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_210                  2 1 357 block2.convblock.3.beta 358 0=2
BinaryOp                 Add_211                  2 1 358 356_splitncnn_0 359
ReLU                     LeakyRelu_212            1 1 359 360 0=2.000000e-01
Split                    splitncnn_27             1 2 360 360_splitncnn_0 360_splitncnn_1
Convolution              Conv_213                 1 1 360_splitncnn_1 361 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_214                  2 1 361 block2.convblock.4.beta 362 0=2
BinaryOp                 Add_215                  2 1 362 360_splitncnn_0 363
ReLU                     LeakyRelu_216            1 1 363 364 0=2.000000e-01
Split                    splitncnn_28             1 2 364 364_splitncnn_0 364_splitncnn_1
Convolution              Conv_217                 1 1 364_splitncnn_1 365 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_218                  2 1 365 block2.convblock.5.beta 366 0=2
BinaryOp                 Add_219                  2 1 366 364_splitncnn_0 367
ReLU                     LeakyRelu_220            1 1 367 368 0=2.000000e-01
Split                    splitncnn_29             1 2 368 368_splitncnn_0 368_splitncnn_1
Convolution              Conv_221                 1 1 368_splitncnn_1 369 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_222                  2 1 369 block2.convblock.6.beta 370 0=2
BinaryOp                 Add_223                  2 1 370 368_splitncnn_0 371
ReLU                     LeakyRelu_224            1 1 371 372 0=2.000000e-01
Split                    splitncnn_30             1 2 372 372_splitncnn_0 372_splitncnn_1
Convolution              Conv_225                 1 1 372_splitncnn_1 373 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_226                  2 1 373 block2.convblock.7.beta 374 0=2
BinaryOp                 Add_227                  2 1 374 372_splitncnn_0 375
ReLU                     LeakyRelu_228            1 1 375 376 0=2.000000e-01
Deconvolution            ConvTranspose_229        1 1 376 377 0=24 1=4 3=2 4=1 5=1 6=36864
PixelShuffle             DepthToSpace_230         1 1 377 378 0=2
Interp                   Resize_232               1 1 378 383 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_31             1 2 383 383_splitncnn_0 383_splitncnn_1
Crop                     Slice_237                1 1 383_splitncnn_1 388 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_244                1 1 383_splitncnn_0 395 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_245                  2 1 300_splitncnn_0 388 396 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_32             1 4 396 396_splitncnn_0 396_splitncnn_1 396_splitncnn_2 396_splitncnn_3
BinaryOp                 Add_246                  2 1 301_splitncnn_0 395 397
Split                    splitncnn_33             1 2 397 397_splitncnn_0 397_splitncnn_1
Crop                     Slice_251                1 1 396_splitncnn_3 402 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_252                  2 1 in0_splitncnn_1 402 403 0=6
Crop                     Slice_257                1 1 396_splitncnn_2 408 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_258                  2 1 in1_splitncnn_1 408 409 0=6
Crop                     Slice_263                1 1 403 414 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_268                1 1 409 419 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_269               4 1 414 419 133_splitncnn_0 397_splitncnn_1 420
Interp                   Resize_271               1 1 420 425 0=2
Interp                   Resize_273               1 1 396_splitncnn_1 430 0=2
BinaryOp                 Mul_275                  1 1 430 432 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_276                  1 1 432 435 0=3 1=1 2=1.000000e+00
Concat                   Concat_277               2 1 425 435 436
Convolution              Conv_278                 1 1 436 438 0=32 1=3 3=2 4=1 5=1 6=3456 9=2 -23310=1,2.000000e-01
Convolution              Conv_280                 1 1 438 440 0=64 1=3 3=2 4=1 5=1 6=18432 9=2 -23310=1,2.000000e-01
Split                    splitncnn_34             1 2 440 440_splitncnn_0 440_splitncnn_1
Convolution              Conv_282                 1 1 440_splitncnn_1 441 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_283                  2 1 441 block3.convblock.0.beta 442 0=2
BinaryOp                 Add_284                  2 1 442 440_splitncnn_0 443
ReLU                     LeakyRelu_285            1 1 443 444 0=2.000000e-01
Split                    splitncnn_35             1 2 444 444_splitncnn_0 444_splitncnn_1
Convolution              Conv_286                 1 1 444_splitncnn_1 445 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_287                  2 1 445 block3.convblock.1.beta 446 0=2
BinaryOp                 Add_288                  2 1 446 444_splitncnn_0 447
ReLU                     LeakyRelu_289            1 1 447 448 0=2.000000e-01
Split                    splitncnn_36             1 2 448 448_splitncnn_0 448_splitncnn_1
Convolution              Conv_290                 1 1 448_splitncnn_1 449 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_291                  2 1 449 block3.convblock.2.beta 450 0=2
BinaryOp                 Add_292                  2 1 450 448_splitncnn_0 451
ReLU                     LeakyRelu_293            1 1 451 452 0=2.000000e-01
Split                    splitncnn_37             1 2 452 452_splitncnn_0 452_splitncnn_1
Convolution              Conv_294                 1 1 452_splitncnn_1 453 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_295                  2 1 453 block3.convblock.3.beta 454 0=2
BinaryOp                 Add_296                  2 1 454 452_splitncnn_0 455
ReLU                     LeakyRelu_297            1 1 455 456 0=2.000000e-01
Split                    splitncnn_38             1 2 456 456_splitncnn_0 456_splitncnn_1
Convolution              Conv_298                 1 1 456_splitncnn_1 457 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_299                  2 1 457 block3.convblock.4.beta 458 0=2
BinaryOp                 Add_300                  2 1 458 456_splitncnn_0 459
ReLU                     LeakyRelu_301            1 1 459 460 0=2.000000e-01
Split                    splitncnn_39             1 2 460 460_splitncnn_0 460_splitncnn_1
Convolution              Conv_302                 1 1 460_splitncnn_1 461 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_303                  2 1 461 block3.convblock.5.beta 462 0=2
BinaryOp                 Add_304                  2 1 462 460_splitncnn_0 463
ReLU                     LeakyRelu_305            1 1 463 464 0=2.000000e-01
Split                    splitncnn_40             1 2 464 464_splitncnn_0 464_splitncnn_1
Convolution              Conv_306                 1 1 464_splitncnn_1 465 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_307                  2 1 465 block3.convblock.6.beta 466 0=2
BinaryOp                 Add_308                  2 1 466 464_splitncnn_0 467
ReLU                     LeakyRelu_309            1 1 467 468 0=2.000000e-01
Split                    splitncnn_41             1 2 468 468_splitncnn_0 468_splitncnn_1
Convolution              Conv_310                 1 1 468_splitncnn_1 469 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_311                  2 1 469 block3.convblock.7.beta 470 0=2
BinaryOp                 Add_312                  2 1 470 468_splitncnn_0 471
ReLU                     LeakyRelu_313            1 1 471 472 0=2.000000e-01
Deconvolution            ConvTranspose_314        1 1 472 473 0=24 1=4 3=2 4=1 5=1 6=24576
PixelShuffle             DepthToSpace_315         1 1 473 474 0=2
Interp                   Resize_317               1 1 474 479 0=2
Split                    splitncnn_42             1 2 479 479_splitncnn_0 479_splitncnn_1
Crop                     Slice_322                1 1 479_splitncnn_1 484 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_329                1 1 479_splitncnn_0 491 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_330                  2 1 396_splitncnn_0 484 492 0=1 -23301=2,1.000000e+00,1.000000e+00
Split                    splitncnn_43             1 2 492 492_splitncnn_0 492_splitncnn_1
BinaryOp                 Add_331                  2 1 397_splitncnn_0 491 493
Crop                     Slice_336                1 1 492_splitncnn_1 498 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_337                  2 1 in0_splitncnn_0 498 499 0=6
Crop                     Slice_342                1 1 492_splitncnn_0 504 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_343                  2 1 in1_splitncnn_0 504 505 0=6
Sigmoid                  Sigmoid_344              1 1 493 506
Split                    splitncnn_44             1 2 506 506_splitncnn_0 506_splitncnn_1
BinaryOp                 Mul_345                  2 1 499 506_splitncnn_1 507 0=2
BinaryOp                 Sub_347                  1 1 506_splitncnn_0 509 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_348                  2 1 505 509 510 0=2
BinaryOp                 Add_349                  2 1 507 510 out0
