7767517
518 639
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 9 in0 in0_splitncnn_0 in0_splitncnn_1 in0_splitncnn_2 in0_splitncnn_3 in0_splitncnn_4 in0_splitncnn_5 in0_splitncnn_6 in0_splitncnn_7 in0_splitncnn_8
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 9 in1 in1_splitncnn_0 in1_splitncnn_1 in1_splitncnn_2 in1_splitncnn_3 in1_splitncnn_4 in1_splitncnn_5 in1_splitncnn_6 in1_splitncnn_7 in1_splitncnn_8
Input                    in2                      0 1 in2
Concat                   Concat_0                 2 1 in0_splitncnn_8 in1_splitncnn_8 193
Crop                     Slice_5                  1 1 193 198 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_7                    1 1 198 200 0=2 1=1
BinaryOp                 Add_9                    1 1 200 202 1=1 2=1.000000e+00
BinaryOp                 Mul_10                   2 1 202 in2 203 0=2
Split                    splitncnn_0              1 8 203 203_splitncnn_0 203_splitncnn_1 203_splitncnn_2 203_splitncnn_3 203_splitncnn_4 203_splitncnn_5 203_splitncnn_6 203_splitncnn_7
Crop                     Slice_17                 1 1 in0_splitncnn_7 210 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_22                 1 1 in1_splitncnn_7 215 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_23                3 1 210 215 203_splitncnn_7 216
Interp                   Resize_25                1 1 216 221 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_26                  1 1 221 222 0=96 1=3 3=2 4=1 5=1 6=6048
PReLU                    PRelu_27                 1 1 222 224 0=96
Convolution              Conv_28                  1 1 224 225 0=192 1=3 3=2 4=1 5=1 6=165888
PReLU                    PRelu_29                 1 1 225 227 0=192
Split                    splitncnn_1              1 2 227 227_splitncnn_0 227_splitncnn_1
Convolution              Conv_30                  1 1 227_splitncnn_1 228 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_31                 1 1 228 230 0=192
Convolution              Conv_32                  1 1 230 231 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_33                 1 1 231 233 0=192
Convolution              Conv_34                  1 1 233 234 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_35                 1 1 234 236 0=192
Convolution              Conv_36                  1 1 236 237 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_37                 1 1 237 239 0=192
Convolution              Conv_38                  1 1 239 240 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_39                 1 1 240 242 0=192
Convolution              Conv_40                  1 1 242 243 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_41                 1 1 243 245 0=192
Convolution              Conv_42                  1 1 245 246 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_43                 1 1 246 248 0=192
Convolution              Conv_44                  1 1 248 249 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_45                 1 1 249 251 0=192
BinaryOp                 Add_46                   2 1 251 227_splitncnn_0 252
Deconvolution            ConvTranspose_47         1 1 252 253 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   Resize_49                1 1 253 258 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_2              1 2 258 258_splitncnn_0 258_splitncnn_1
Crop                     Slice_54                 1 1 258_splitncnn_1 263 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_56                   1 1 263 265 0=2 1=1 2=8.000000e+00
Crop                     Slice_63                 1 1 258_splitncnn_0 272 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_68                 1 1 in1_splitncnn_6 277 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_73                 1 1 in0_splitncnn_6 282 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_75                   1 1 203_splitncnn_6 284 0=7 1=1 2=1.000000e+00
Concat                   Concat_76                3 1 277 282 284 285
Interp                   Resize_78                1 1 285 290 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_79                  1 1 290 291 0=96 1=3 3=2 4=1 5=1 6=6048
PReLU                    PRelu_80                 1 1 291 293 0=96
Convolution              Conv_81                  1 1 293 294 0=192 1=3 3=2 4=1 5=1 6=165888
PReLU                    PRelu_82                 1 1 294 296 0=192
Split                    splitncnn_3              1 2 296 296_splitncnn_0 296_splitncnn_1
Convolution              Conv_83                  1 1 296_splitncnn_1 297 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_84                 1 1 297 299 0=192
Convolution              Conv_85                  1 1 299 300 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_86                 1 1 300 302 0=192
Convolution              Conv_87                  1 1 302 303 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_88                 1 1 303 305 0=192
Convolution              Conv_89                  1 1 305 306 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_90                 1 1 306 308 0=192
Convolution              Conv_91                  1 1 308 309 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_92                 1 1 309 311 0=192
Convolution              Conv_93                  1 1 311 312 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_94                 1 1 312 314 0=192
Convolution              Conv_95                  1 1 314 315 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_96                 1 1 315 317 0=192
Convolution              Conv_97                  1 1 317 318 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_98                 1 1 318 320 0=192
BinaryOp                 Add_99                   2 1 320 296_splitncnn_0 321
Deconvolution            ConvTranspose_100        1 1 321 322 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   Resize_102               1 1 322 327 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_4              1 2 327 327_splitncnn_0 327_splitncnn_1
Crop                     Slice_107                1 1 327_splitncnn_1 332 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_109                  1 1 332 334 0=2 1=1 2=8.000000e+00
BinaryOp                 Mul_111                  1 1 334 336 0=2 1=1 2=2.000000e+00
Split                    splitncnn_5              1 2 336 336_splitncnn_0 336_splitncnn_1
Crop                     Slice_116                1 1 327_splitncnn_0 341 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_121                1 1 336_splitncnn_1 346 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_126                1 1 336_splitncnn_0 351 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_127               2 1 346 351 352
Eltwise                  Add_128                  2 1 265 352 353 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_129                  1 1 353 356 0=3 1=1 2=2.000000e+00
Split                    splitncnn_6              1 6 356 356_splitncnn_0 356_splitncnn_1 356_splitncnn_2 356_splitncnn_3 356_splitncnn_4 356_splitncnn_5
UnaryOp                  Neg_130                  1 1 341 357 0=1
BinaryOp                 Add_131                  2 1 272 357 358
BinaryOp                 Div_132                  1 1 358 361 0=3 1=1 2=2.000000e+00
Split                    splitncnn_7              1 3 361 361_splitncnn_0 361_splitncnn_1 361_splitncnn_2
Crop                     Slice_137                1 1 356_splitncnn_5 366 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_138                  2 1 in0_splitncnn_5 366 367 0=6
Split                    splitncnn_8              1 2 367 367_splitncnn_0 367_splitncnn_1
Crop                     Slice_143                1 1 356_splitncnn_4 372 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_144                  2 1 in1_splitncnn_5 372 373 0=6
Split                    splitncnn_9              1 2 373 373_splitncnn_0 373_splitncnn_1
Crop                     Slice_149                1 1 367_splitncnn_1 378 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_154                1 1 373_splitncnn_1 383 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_155               4 1 378 383 203_splitncnn_5 361_splitncnn_2 384
Interp                   Resize_157               1 1 384 389 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_159               1 1 356_splitncnn_3 394 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_161                  1 1 394 396 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_162                  1 1 396 399 0=3 1=1 2=4.000000e+00
Concat                   Concat_163               2 1 389 399 400
Convolution              Conv_164                 1 1 400 401 0=64 1=3 3=2 4=1 5=1 6=6912
PReLU                    PRelu_165                1 1 401 403 0=64
Convolution              Conv_166                 1 1 403 404 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_167                1 1 404 406 0=128
Split                    splitncnn_10             1 2 406 406_splitncnn_0 406_splitncnn_1
Convolution              Conv_168                 1 1 406_splitncnn_1 407 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_169                1 1 407 409 0=128
Convolution              Conv_170                 1 1 409 410 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_171                1 1 410 412 0=128
Convolution              Conv_172                 1 1 412 413 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_173                1 1 413 415 0=128
Convolution              Conv_174                 1 1 415 416 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_175                1 1 416 418 0=128
Convolution              Conv_176                 1 1 418 419 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_177                1 1 419 421 0=128
Convolution              Conv_178                 1 1 421 422 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_179                1 1 422 424 0=128
Convolution              Conv_180                 1 1 424 425 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_181                1 1 425 427 0=128
Convolution              Conv_182                 1 1 427 428 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_183                1 1 428 430 0=128
BinaryOp                 Add_184                  2 1 430 406_splitncnn_0 431
Deconvolution            ConvTranspose_185        1 1 431 432 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   Resize_187               1 1 432 437 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_11             1 2 437 437_splitncnn_0 437_splitncnn_1
Crop                     Slice_192                1 1 437_splitncnn_1 442 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_194                  1 1 442 444 0=2 1=1 2=4.000000e+00
Crop                     Slice_201                1 1 437_splitncnn_0 451 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_206                1 1 373_splitncnn_0 456 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_211                1 1 367_splitncnn_0 461 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_213                  1 1 203_splitncnn_4 463 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_214                  1 1 361_splitncnn_1 464 0=1
Concat                   Concat_215               4 1 456 461 463 464 465
Crop                     Slice_220                1 1 356_splitncnn_2 470 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_225                1 1 356_splitncnn_1 475 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_226               2 1 470 475 476
Interp                   Resize_228               1 1 465 481 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_230               1 1 476 486 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_232                  1 1 486 488 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_233                  1 1 488 491 0=3 1=1 2=4.000000e+00
Concat                   Concat_234               2 1 481 491 492
Convolution              Conv_235                 1 1 492 493 0=64 1=3 3=2 4=1 5=1 6=6912
PReLU                    PRelu_236                1 1 493 495 0=64
Convolution              Conv_237                 1 1 495 496 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_238                1 1 496 498 0=128
Split                    splitncnn_12             1 2 498 498_splitncnn_0 498_splitncnn_1
Convolution              Conv_239                 1 1 498_splitncnn_1 499 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_240                1 1 499 501 0=128
Convolution              Conv_241                 1 1 501 502 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_242                1 1 502 504 0=128
Convolution              Conv_243                 1 1 504 505 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_244                1 1 505 507 0=128
Convolution              Conv_245                 1 1 507 508 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_246                1 1 508 510 0=128
Convolution              Conv_247                 1 1 510 511 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_248                1 1 511 513 0=128
Convolution              Conv_249                 1 1 513 514 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_250                1 1 514 516 0=128
Convolution              Conv_251                 1 1 516 517 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_252                1 1 517 519 0=128
Convolution              Conv_253                 1 1 519 520 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_254                1 1 520 522 0=128
BinaryOp                 Add_255                  2 1 522 498_splitncnn_0 523
Deconvolution            ConvTranspose_256        1 1 523 524 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   Resize_258               1 1 524 529 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_13             1 2 529 529_splitncnn_0 529_splitncnn_1
Crop                     Slice_263                1 1 529_splitncnn_1 534 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_265                  1 1 534 536 0=2 1=1 2=4.000000e+00
BinaryOp                 Mul_267                  1 1 536 538 0=2 1=1 2=2.000000e+00
Split                    splitncnn_14             1 2 538 538_splitncnn_0 538_splitncnn_1
Crop                     Slice_272                1 1 529_splitncnn_0 543 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_277                1 1 538_splitncnn_1 548 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_282                1 1 538_splitncnn_0 553 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_283               2 1 548 553 554
Eltwise                  Add_284                  2 1 444 554 555 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_285                  1 1 555 558 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_286                  1 1 543 559 0=1
BinaryOp                 Add_287                  2 1 451 559 560
BinaryOp                 Div_288                  1 1 560 563 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_289                  2 1 356_splitncnn_0 558 564
Split                    splitncnn_15             1 6 564 564_splitncnn_0 564_splitncnn_1 564_splitncnn_2 564_splitncnn_3 564_splitncnn_4 564_splitncnn_5
BinaryOp                 Add_290                  2 1 361_splitncnn_0 563 565
Split                    splitncnn_16             1 3 565 565_splitncnn_0 565_splitncnn_1 565_splitncnn_2
Crop                     Slice_295                1 1 564_splitncnn_5 570 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_296                  2 1 in0_splitncnn_4 570 571 0=6
Split                    splitncnn_17             1 2 571 571_splitncnn_0 571_splitncnn_1
Crop                     Slice_301                1 1 564_splitncnn_4 576 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_302                  2 1 in1_splitncnn_4 576 577 0=6
Split                    splitncnn_18             1 2 577 577_splitncnn_0 577_splitncnn_1
Crop                     Slice_307                1 1 571_splitncnn_1 582 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_312                1 1 577_splitncnn_1 587 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_313               4 1 582 587 203_splitncnn_3 565_splitncnn_2 588
Interp                   Resize_315               1 1 588 593 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_317               1 1 564_splitncnn_3 598 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_319                  1 1 598 600 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_320                  1 1 600 603 0=3 1=1 2=2.000000e+00
Concat                   Concat_321               2 1 593 603 604
Convolution              Conv_322                 1 1 604 605 0=48 1=3 3=2 4=1 5=1 6=5184
PReLU                    PRelu_323                1 1 605 607 0=48
Convolution              Conv_324                 1 1 607 608 0=96 1=3 3=2 4=1 5=1 6=41472
PReLU                    PRelu_325                1 1 608 610 0=96
Split                    splitncnn_19             1 2 610 610_splitncnn_0 610_splitncnn_1
Convolution              Conv_326                 1 1 610_splitncnn_1 611 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_327                1 1 611 613 0=96
Convolution              Conv_328                 1 1 613 614 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_329                1 1 614 616 0=96
Convolution              Conv_330                 1 1 616 617 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_331                1 1 617 619 0=96
Convolution              Conv_332                 1 1 619 620 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_333                1 1 620 622 0=96
Convolution              Conv_334                 1 1 622 623 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_335                1 1 623 625 0=96
Convolution              Conv_336                 1 1 625 626 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_337                1 1 626 628 0=96
Convolution              Conv_338                 1 1 628 629 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_339                1 1 629 631 0=96
Convolution              Conv_340                 1 1 631 632 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_341                1 1 632 634 0=96
BinaryOp                 Add_342                  2 1 634 610_splitncnn_0 635
Deconvolution            ConvTranspose_343        1 1 635 636 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   Resize_345               1 1 636 641 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_20             1 2 641 641_splitncnn_0 641_splitncnn_1
Crop                     Slice_350                1 1 641_splitncnn_1 646 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_352                  1 1 646 648 0=2 1=1 2=2.000000e+00
Crop                     Slice_359                1 1 641_splitncnn_0 655 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_364                1 1 577_splitncnn_0 660 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_369                1 1 571_splitncnn_0 665 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_371                  1 1 203_splitncnn_2 667 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_372                  1 1 565_splitncnn_1 668 0=1
Concat                   Concat_373               4 1 660 665 667 668 669
Crop                     Slice_378                1 1 564_splitncnn_2 674 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_383                1 1 564_splitncnn_1 679 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_384               2 1 674 679 680
Interp                   Resize_386               1 1 669 685 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_388               1 1 680 690 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_390                  1 1 690 692 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_391                  1 1 692 695 0=3 1=1 2=2.000000e+00
Concat                   Concat_392               2 1 685 695 696
Convolution              Conv_393                 1 1 696 697 0=48 1=3 3=2 4=1 5=1 6=5184
PReLU                    PRelu_394                1 1 697 699 0=48
Convolution              Conv_395                 1 1 699 700 0=96 1=3 3=2 4=1 5=1 6=41472
PReLU                    PRelu_396                1 1 700 702 0=96
Split                    splitncnn_21             1 2 702 702_splitncnn_0 702_splitncnn_1
Convolution              Conv_397                 1 1 702_splitncnn_1 703 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_398                1 1 703 705 0=96
Convolution              Conv_399                 1 1 705 706 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_400                1 1 706 708 0=96
Convolution              Conv_401                 1 1 708 709 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_402                1 1 709 711 0=96
Convolution              Conv_403                 1 1 711 712 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_404                1 1 712 714 0=96
Convolution              Conv_405                 1 1 714 715 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_406                1 1 715 717 0=96
Convolution              Conv_407                 1 1 717 718 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_408                1 1 718 720 0=96
Convolution              Conv_409                 1 1 720 721 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_410                1 1 721 723 0=96
Convolution              Conv_411                 1 1 723 724 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_412                1 1 724 726 0=96
BinaryOp                 Add_413                  2 1 726 702_splitncnn_0 727
Deconvolution            ConvTranspose_414        1 1 727 728 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   Resize_416               1 1 728 733 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_22             1 2 733 733_splitncnn_0 733_splitncnn_1
Crop                     Slice_421                1 1 733_splitncnn_1 738 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_423                  1 1 738 740 0=2 1=1 2=2.000000e+00
BinaryOp                 Mul_425                  1 1 740 742 0=2 1=1 2=2.000000e+00
Split                    splitncnn_23             1 2 742 742_splitncnn_0 742_splitncnn_1
Crop                     Slice_430                1 1 733_splitncnn_0 747 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_435                1 1 742_splitncnn_1 752 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_440                1 1 742_splitncnn_0 757 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_441               2 1 752 757 758
Eltwise                  Add_442                  2 1 648 758 759 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_443                  1 1 759 762 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_444                  1 1 747 763 0=1
BinaryOp                 Add_445                  2 1 655 763 764
BinaryOp                 Div_446                  1 1 764 767 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_447                  2 1 564_splitncnn_0 762 768
Split                    splitncnn_24             1 6 768 768_splitncnn_0 768_splitncnn_1 768_splitncnn_2 768_splitncnn_3 768_splitncnn_4 768_splitncnn_5
BinaryOp                 Add_448                  2 1 565_splitncnn_0 767 769
Split                    splitncnn_25             1 3 769 769_splitncnn_0 769_splitncnn_1 769_splitncnn_2
Crop                     Slice_453                1 1 768_splitncnn_5 774 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_454                  2 1 in0_splitncnn_3 774 775 0=6
Split                    splitncnn_26             1 2 775 775_splitncnn_0 775_splitncnn_1
Crop                     Slice_459                1 1 768_splitncnn_4 780 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_460                  2 1 in1_splitncnn_3 780 781 0=6
Split                    splitncnn_27             1 2 781 781_splitncnn_0 781_splitncnn_1
Crop                     Slice_465                1 1 775_splitncnn_1 786 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_470                1 1 781_splitncnn_1 791 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_471               4 1 786 791 203_splitncnn_1 769_splitncnn_2 792
Interp                   Resize_473               1 1 792 797 0=2
Interp                   Resize_475               1 1 768_splitncnn_3 802 0=2
BinaryOp                 Mul_477                  1 1 802 804 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_478                  1 1 804 807 0=3 1=1 2=1.000000e+00
Concat                   Concat_479               2 1 797 807 808
Convolution              Conv_480                 1 1 808 809 0=32 1=3 3=2 4=1 5=1 6=3456
PReLU                    PRelu_481                1 1 809 811 0=32
Convolution              Conv_482                 1 1 811 812 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_483                1 1 812 814 0=64
Split                    splitncnn_28             1 2 814 814_splitncnn_0 814_splitncnn_1
Convolution              Conv_484                 1 1 814_splitncnn_1 815 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_485                1 1 815 817 0=64
Convolution              Conv_486                 1 1 817 818 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_487                1 1 818 820 0=64
Convolution              Conv_488                 1 1 820 821 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_489                1 1 821 823 0=64
Convolution              Conv_490                 1 1 823 824 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_491                1 1 824 826 0=64
Convolution              Conv_492                 1 1 826 827 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_493                1 1 827 829 0=64
Convolution              Conv_494                 1 1 829 830 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_495                1 1 830 832 0=64
Convolution              Conv_496                 1 1 832 833 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_497                1 1 833 835 0=64
Convolution              Conv_498                 1 1 835 836 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_499                1 1 836 838 0=64
BinaryOp                 Add_500                  2 1 838 814_splitncnn_0 839
Deconvolution            ConvTranspose_501        1 1 839 840 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   Resize_503               1 1 840 845 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_29             1 2 845 845_splitncnn_0 845_splitncnn_1
Crop                     Slice_508                1 1 845_splitncnn_1 850 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_510                  1 1 850 852 0=2 1=1 2=1.000000e+00
Crop                     Slice_517                1 1 845_splitncnn_0 859 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_522                1 1 781_splitncnn_0 864 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_527                1 1 775_splitncnn_0 869 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_529                  1 1 203_splitncnn_0 871 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_530                  1 1 769_splitncnn_1 872 0=1
Concat                   Concat_531               4 1 864 869 871 872 873
Crop                     Slice_536                1 1 768_splitncnn_2 878 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_541                1 1 768_splitncnn_1 883 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_542               2 1 878 883 884
Interp                   Resize_544               1 1 873 889 0=2
Interp                   Resize_546               1 1 884 894 0=2
BinaryOp                 Mul_548                  1 1 894 896 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_549                  1 1 896 899 0=3 1=1 2=1.000000e+00
Concat                   Concat_550               2 1 889 899 900
Convolution              Conv_551                 1 1 900 901 0=32 1=3 3=2 4=1 5=1 6=3456
PReLU                    PRelu_552                1 1 901 903 0=32
Convolution              Conv_553                 1 1 903 904 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_554                1 1 904 906 0=64
Split                    splitncnn_30             1 2 906 906_splitncnn_0 906_splitncnn_1
Convolution              Conv_555                 1 1 906_splitncnn_1 907 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_556                1 1 907 909 0=64
Convolution              Conv_557                 1 1 909 910 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_558                1 1 910 912 0=64
Convolution              Conv_559                 1 1 912 913 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_560                1 1 913 915 0=64
Convolution              Conv_561                 1 1 915 916 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_562                1 1 916 918 0=64
Convolution              Conv_563                 1 1 918 919 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_564                1 1 919 921 0=64
Convolution              Conv_565                 1 1 921 922 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_566                1 1 922 924 0=64
Convolution              Conv_567                 1 1 924 925 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_568                1 1 925 927 0=64
Convolution              Conv_569                 1 1 927 928 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_570                1 1 928 930 0=64
BinaryOp                 Add_571                  2 1 930 906_splitncnn_0 931
Deconvolution            ConvTranspose_572        1 1 931 932 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   Resize_574               1 1 932 937 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_31             1 2 937 937_splitncnn_0 937_splitncnn_1
Crop                     Slice_579                1 1 937_splitncnn_1 942 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_581                  1 1 942 944 0=2 1=1 2=1.000000e+00
BinaryOp                 Mul_583                  1 1 944 946 0=2 1=1 2=2.000000e+00
Split                    splitncnn_32             1 2 946 946_splitncnn_0 946_splitncnn_1
Crop                     Slice_588                1 1 937_splitncnn_0 951 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_593                1 1 946_splitncnn_1 956 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_598                1 1 946_splitncnn_0 961 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_599               2 1 956 961 962
Eltwise                  Add_600                  2 1 852 962 963 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_601                  1 1 963 966 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_602                  1 1 951 967 0=1
BinaryOp                 Add_603                  2 1 859 967 968
BinaryOp                 Div_604                  1 1 968 971 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_605                  2 1 768_splitncnn_0 966 972
Split                    splitncnn_33             1 5 972 972_splitncnn_0 972_splitncnn_1 972_splitncnn_2 972_splitncnn_3 972_splitncnn_4
BinaryOp                 Add_606                  2 1 769_splitncnn_0 971 973
Split                    splitncnn_34             1 2 973 973_splitncnn_0 973_splitncnn_1
Crop                     Slice_611                1 1 972_splitncnn_4 978 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_612                  2 1 in0_splitncnn_2 978 979 0=6
Split                    splitncnn_35             1 2 979 979_splitncnn_0 979_splitncnn_1
Crop                     Slice_617                1 1 972_splitncnn_3 984 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_618                  2 1 in1_splitncnn_2 984 985 0=6
Split                    splitncnn_36             1 2 985 985_splitncnn_0 985_splitncnn_1
Sigmoid                  Sigmoid_619              1 1 973_splitncnn_1 986
Split                    splitncnn_37             1 2 986 986_splitncnn_0 986_splitncnn_1
BinaryOp                 Mul_620                  2 1 979_splitncnn_1 986_splitncnn_1 987 0=2
BinaryOp                 Sub_622                  1 1 986_splitncnn_0 989 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_623                  2 1 985_splitncnn_1 989 990 0=2
BinaryOp                 Add_624                  2 1 987 990 991
Crop                     Slice_629                1 1 972_splitncnn_2 996 -23309=1,0 -23310=1,2 -23311=1,0
Convolution              Conv_630                 1 1 in0_splitncnn_1 997 0=16 1=3 3=2 4=1 5=1 6=432
PReLU                    PRelu_631                1 1 997 999 0=16
Convolution              Conv_632                 1 1 999 1000 0=16 1=3 4=1 5=1 6=2304
PReLU                    PRelu_633                1 1 1000 1002 0=16
Split                    splitncnn_38             1 2 1002 1002_splitncnn_0 1002_splitncnn_1
Interp                   Resize_635               1 1 996 1007 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_637                  1 1 1007 1009 0=2 1=1 2=5.000000e-01
Split                    splitncnn_39             1 8 1009 1009_splitncnn_0 1009_splitncnn_1 1009_splitncnn_2 1009_splitncnn_3 1009_splitncnn_4 1009_splitncnn_5 1009_splitncnn_6 1009_splitncnn_7
Concat                   Concat_638               8 1 1009_splitncnn_7 1009_splitncnn_6 1009_splitncnn_5 1009_splitncnn_4 1009_splitncnn_3 1009_splitncnn_2 1009_splitncnn_1 1009_splitncnn_0 1010
Split                    splitncnn_40             1 8 1010 1010_splitncnn_0 1010_splitncnn_1 1010_splitncnn_2 1010_splitncnn_3 1010_splitncnn_4 1010_splitncnn_5 1010_splitncnn_6 1010_splitncnn_7
Concat                   Concat_639               8 1 1010_splitncnn_7 1010_splitncnn_6 1010_splitncnn_5 1010_splitncnn_4 1010_splitncnn_3 1010_splitncnn_2 1010_splitncnn_1 1010_splitncnn_0 1011
Split                    splitncnn_41             1 2 1011 1011_splitncnn_0 1011_splitncnn_1
Crop                     Slice_644                1 1 1011_splitncnn_1 1016 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_645                  2 1 1002_splitncnn_1 1016 1017 0=6
Convolution              Conv_646                 1 1 1002_splitncnn_0 1018 0=32 1=3 3=2 4=1 5=1 6=4608
PReLU                    PRelu_647                1 1 1018 1020 0=32
Convolution              Conv_648                 1 1 1020 1021 0=32 1=3 4=1 5=1 6=9216
PReLU                    PRelu_649                1 1 1021 1023 0=32
Split                    splitncnn_42             1 2 1023 1023_splitncnn_0 1023_splitncnn_1
Interp                   Resize_651               1 1 1011_splitncnn_0 1028 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_653                  1 1 1028 1030 0=2 1=1 2=5.000000e-01
Split                    splitncnn_43             1 2 1030 1030_splitncnn_0 1030_splitncnn_1
Crop                     Slice_658                1 1 1030_splitncnn_1 1035 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_659                  2 1 1023_splitncnn_1 1035 1036 0=6
Convolution              Conv_660                 1 1 1023_splitncnn_0 1037 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_661                1 1 1037 1039 0=64
Convolution              Conv_662                 1 1 1039 1040 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_663                1 1 1040 1042 0=64
Split                    splitncnn_44             1 2 1042 1042_splitncnn_0 1042_splitncnn_1
Interp                   Resize_665               1 1 1030_splitncnn_0 1047 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_667                  1 1 1047 1049 0=2 1=1 2=5.000000e-01
Split                    splitncnn_45             1 2 1049 1049_splitncnn_0 1049_splitncnn_1
Crop                     Slice_672                1 1 1049_splitncnn_1 1054 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_673                  2 1 1042_splitncnn_1 1054 1055 0=6
Convolution              Conv_674                 1 1 1042_splitncnn_0 1056 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_675                1 1 1056 1058 0=128
Convolution              Conv_676                 1 1 1058 1059 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_677                1 1 1059 1061 0=128
Interp                   Resize_679               1 1 1049_splitncnn_0 1066 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_681                  1 1 1066 1068 0=2 1=1 2=5.000000e-01
Crop                     Slice_686                1 1 1068 1073 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_687                  2 1 1061 1073 1074 0=6
Crop                     Slice_692                1 1 972_splitncnn_1 1079 -23309=1,2 -23310=1,4 -23311=1,0
Convolution              Conv_693                 1 1 in1_splitncnn_1 1080 0=16 1=3 3=2 4=1 5=1 6=432
PReLU                    PRelu_694                1 1 1080 1082 0=16
Convolution              Conv_695                 1 1 1082 1083 0=16 1=3 4=1 5=1 6=2304
PReLU                    PRelu_696                1 1 1083 1085 0=16
Split                    splitncnn_46             1 2 1085 1085_splitncnn_0 1085_splitncnn_1
Interp                   Resize_698               1 1 1079 1090 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_700                  1 1 1090 1092 0=2 1=1 2=5.000000e-01
Split                    splitncnn_47             1 8 1092 1092_splitncnn_0 1092_splitncnn_1 1092_splitncnn_2 1092_splitncnn_3 1092_splitncnn_4 1092_splitncnn_5 1092_splitncnn_6 1092_splitncnn_7
Concat                   Concat_701               8 1 1092_splitncnn_7 1092_splitncnn_6 1092_splitncnn_5 1092_splitncnn_4 1092_splitncnn_3 1092_splitncnn_2 1092_splitncnn_1 1092_splitncnn_0 1093
Split                    splitncnn_48             1 8 1093 1093_splitncnn_0 1093_splitncnn_1 1093_splitncnn_2 1093_splitncnn_3 1093_splitncnn_4 1093_splitncnn_5 1093_splitncnn_6 1093_splitncnn_7
Concat                   Concat_702               8 1 1093_splitncnn_7 1093_splitncnn_6 1093_splitncnn_5 1093_splitncnn_4 1093_splitncnn_3 1093_splitncnn_2 1093_splitncnn_1 1093_splitncnn_0 1094
Split                    splitncnn_49             1 2 1094 1094_splitncnn_0 1094_splitncnn_1
Crop                     Slice_707                1 1 1094_splitncnn_1 1099 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_708                  2 1 1085_splitncnn_1 1099 1100 0=6
Convolution              Conv_709                 1 1 1085_splitncnn_0 1101 0=32 1=3 3=2 4=1 5=1 6=4608
PReLU                    PRelu_710                1 1 1101 1103 0=32
Convolution              Conv_711                 1 1 1103 1104 0=32 1=3 4=1 5=1 6=9216
PReLU                    PRelu_712                1 1 1104 1106 0=32
Split                    splitncnn_50             1 2 1106 1106_splitncnn_0 1106_splitncnn_1
Interp                   Resize_714               1 1 1094_splitncnn_0 1111 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_716                  1 1 1111 1113 0=2 1=1 2=5.000000e-01
Split                    splitncnn_51             1 2 1113 1113_splitncnn_0 1113_splitncnn_1
Crop                     Slice_721                1 1 1113_splitncnn_1 1118 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_722                  2 1 1106_splitncnn_1 1118 1119 0=6
Convolution              Conv_723                 1 1 1106_splitncnn_0 1120 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_724                1 1 1120 1122 0=64
Convolution              Conv_725                 1 1 1122 1123 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_726                1 1 1123 1125 0=64
Split                    splitncnn_52             1 2 1125 1125_splitncnn_0 1125_splitncnn_1
Interp                   Resize_728               1 1 1113_splitncnn_0 1130 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_730                  1 1 1130 1132 0=2 1=1 2=5.000000e-01
Split                    splitncnn_53             1 2 1132 1132_splitncnn_0 1132_splitncnn_1
Crop                     Slice_735                1 1 1132_splitncnn_1 1137 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_736                  2 1 1125_splitncnn_1 1137 1138 0=6
Convolution              Conv_737                 1 1 1125_splitncnn_0 1139 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_738                1 1 1139 1141 0=128
Convolution              Conv_739                 1 1 1141 1142 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_740                1 1 1142 1144 0=128
Interp                   Resize_742               1 1 1132_splitncnn_0 1149 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_744                  1 1 1149 1151 0=2 1=1 2=5.000000e-01
Crop                     Slice_749                1 1 1151 1156 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_750                  2 1 1144 1156 1157 0=6
Concat                   Concat_751               6 1 in0_splitncnn_0 in1_splitncnn_0 979_splitncnn_0 985_splitncnn_0 973_splitncnn_0 972_splitncnn_0 1158
Convolution              Conv_752                 1 1 1158 1159 0=32 1=3 3=2 4=1 5=1 6=4896
PReLU                    PRelu_753                1 1 1159 1161 0=32
Convolution              Conv_754                 1 1 1161 1162 0=32 1=3 4=1 5=1 6=9216
PReLU                    PRelu_755                1 1 1162 1164 0=32
Split                    splitncnn_54             1 2 1164 1164_splitncnn_0 1164_splitncnn_1
Concat                   Concat_756               3 1 1164_splitncnn_1 1017 1100 1165
Convolution              Conv_757                 1 1 1165 1166 0=64 1=3 3=2 4=1 5=1 6=36864
PReLU                    PRelu_758                1 1 1166 1168 0=64
Convolution              Conv_759                 1 1 1168 1169 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_760                1 1 1169 1171 0=64
Split                    splitncnn_55             1 2 1171 1171_splitncnn_0 1171_splitncnn_1
Concat                   Concat_761               3 1 1171_splitncnn_1 1036 1119 1172
Convolution              Conv_762                 1 1 1172 1173 0=128 1=3 3=2 4=1 5=1 6=147456
PReLU                    PRelu_763                1 1 1173 1175 0=128
Convolution              Conv_764                 1 1 1175 1176 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_765                1 1 1176 1178 0=128
Split                    splitncnn_56             1 2 1178 1178_splitncnn_0 1178_splitncnn_1
Concat                   Concat_766               3 1 1178_splitncnn_1 1055 1138 1179
Convolution              Conv_767                 1 1 1179 1180 0=256 1=3 3=2 4=1 5=1 6=589824
PReLU                    PRelu_768                1 1 1180 1182 0=256
Convolution              Conv_769                 1 1 1182 1183 0=256 1=3 4=1 5=1 6=589824
PReLU                    PRelu_770                1 1 1183 1185 0=256
Concat                   Concat_771               3 1 1185 1074 1157 1186
Deconvolution            ConvTranspose_772        1 1 1186 1187 0=128 1=4 3=2 4=1 5=1 6=1048576
PReLU                    PRelu_773                1 1 1187 1189 0=128
Concat                   Concat_774               2 1 1189 1178_splitncnn_0 1190
Deconvolution            ConvTranspose_775        1 1 1190 1191 0=64 1=4 3=2 4=1 5=1 6=262144
PReLU                    PRelu_776                1 1 1191 1193 0=64
Concat                   Concat_777               2 1 1193 1171_splitncnn_0 1194
Deconvolution            ConvTranspose_778        1 1 1194 1195 0=32 1=4 3=2 4=1 5=1 6=65536
PReLU                    PRelu_779                1 1 1195 1197 0=32
Concat                   Concat_780               2 1 1197 1164_splitncnn_0 1198
Deconvolution            ConvTranspose_781        1 1 1198 1199 0=16 1=4 3=2 4=1 5=1 6=16384
PReLU                    PRelu_782                1 1 1199 1201 0=16
Convolution              Conv_783                 1 1 1201 1203 0=3 1=3 4=1 5=1 6=432 9=4
Crop                     Slice_789                1 1 1203 1208 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Mul_791                  1 1 1208 1210 0=2 1=1 2=2.000000e+00
BinaryOp                 Sub_793                  1 1 1210 1212 0=1 1=1 2=1.000000e+00
BinaryOp                 Add_794                  2 1 991 1212 1213
Clip                     Clip_795                 1 1 1213 out0 0=0.000000e+00 1=1.000000e+00
