7767517
188 229
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 9 in0 in0_splitncnn_0 in0_splitncnn_1 in0_splitncnn_2 in0_splitncnn_3 in0_splitncnn_4 in0_splitncnn_5 in0_splitncnn_6 in0_splitncnn_7 in0_splitncnn_8
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 9 in1 in1_splitncnn_0 in1_splitncnn_1 in1_splitncnn_2 in1_splitncnn_3 in1_splitncnn_4 in1_splitncnn_5 in1_splitncnn_6 in1_splitncnn_7 in1_splitncnn_8
Input                    in2                      0 1 in2
Concat                   Concat_0                 2 1 in0_splitncnn_8 in1_splitncnn_8 131
Crop                     Slice_5                  1 1 131 136 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_7                    1 1 136 138 0=2 1=1
BinaryOp                 Add_9                    1 1 138 140 1=1 2=1.000000e+00
BinaryOp                 Mul_10                   2 1 140 in2 141 0=2
Split                    splitncnn_0              1 4 141 141_splitncnn_0 141_splitncnn_1 141_splitncnn_2 141_splitncnn_3
Crop                     Slice_16                 1 1 in0_splitncnn_7 147 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_21                 1 1 in1_splitncnn_7 152 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_22                3 1 147 152 141_splitncnn_3 153
Interp                   Resize_24                1 1 153 158 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_25                  1 1 158 159 0=50 1=3 3=2 4=1 5=1 6=3150
PReLU                    PRelu_26                 1 1 159 161 0=50
Convolution              Conv_27                  1 1 161 162 0=100 1=3 3=2 4=1 5=1 6=45000
PReLU                    PRelu_28                 1 1 162 164 0=100
Split                    splitncnn_1              1 2 164 164_splitncnn_0 164_splitncnn_1
Convolution              Conv_29                  1 1 164_splitncnn_1 165 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_30                 1 1 165 167 0=100
Convolution              Conv_31                  1 1 167 168 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_32                 1 1 168 170 0=100
Convolution              Conv_33                  1 1 170 171 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_34                 1 1 171 173 0=100
Convolution              Conv_35                  1 1 173 174 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_36                 1 1 174 176 0=100
Convolution              Conv_37                  1 1 176 177 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_38                 1 1 177 179 0=100
Convolution              Conv_39                  1 1 179 180 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_40                 1 1 180 182 0=100
Convolution              Conv_41                  1 1 182 183 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_42                 1 1 183 185 0=100
Convolution              Conv_43                  1 1 185 186 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_44                 1 1 186 188 0=100
BinaryOp                 Add_45                   2 1 188 164_splitncnn_0 189
Deconvolution            ConvTranspose_46         1 1 189 190 0=5 1=4 3=2 4=1 5=1 6=8000
Interp                   Resize_48                1 1 190 195 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_2              1 2 195 195_splitncnn_0 195_splitncnn_1
Crop                     Slice_53                 1 1 195_splitncnn_1 200 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_55                   1 1 200 202 0=2 1=1 2=8.000000e+00
BinaryOp                 Mul_57                   1 1 202 204 0=2 1=1 2=2.000000e+00
Split                    splitncnn_3              1 4 204 204_splitncnn_0 204_splitncnn_1 204_splitncnn_2 204_splitncnn_3
Crop                     Slice_62                 1 1 195_splitncnn_0 209 -23309=1,4 -23310=1,5 -23311=1,0
Split                    splitncnn_4              1 2 209 209_splitncnn_0 209_splitncnn_1
Crop                     Slice_67                 1 1 204_splitncnn_3 214 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_68                   2 1 in0_splitncnn_6 214 215 0=6
Crop                     Slice_73                 1 1 204_splitncnn_2 220 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_74                   2 1 in1_splitncnn_6 220 221 0=6
Crop                     Slice_79                 1 1 in0_splitncnn_5 226 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_84                 1 1 in1_splitncnn_5 231 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_89                 1 1 215 236 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_94                 1 1 221 241 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_95                6 1 226 231 141_splitncnn_2 236 241 209_splitncnn_1 242
Interp                   Resize_97                1 1 242 247 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_99                1 1 204_splitncnn_1 252 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Div_102                  1 1 252 257 0=3 1=1 2=4.000000e+00
Concat                   Concat_103               2 1 247 257 258
Convolution              Conv_104                 1 1 258 259 0=50 1=3 3=2 4=1 5=1 6=8100
PReLU                    PRelu_105                1 1 259 261 0=50
Convolution              Conv_106                 1 1 261 262 0=100 1=3 3=2 4=1 5=1 6=45000
PReLU                    PRelu_107                1 1 262 264 0=100
Split                    splitncnn_5              1 2 264 264_splitncnn_0 264_splitncnn_1
Convolution              Conv_108                 1 1 264_splitncnn_1 265 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_109                1 1 265 267 0=100
Convolution              Conv_110                 1 1 267 268 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_111                1 1 268 270 0=100
Convolution              Conv_112                 1 1 270 271 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_113                1 1 271 273 0=100
Convolution              Conv_114                 1 1 273 274 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_115                1 1 274 276 0=100
Convolution              Conv_116                 1 1 276 277 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_117                1 1 277 279 0=100
Convolution              Conv_118                 1 1 279 280 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_119                1 1 280 282 0=100
Convolution              Conv_120                 1 1 282 283 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_121                1 1 283 285 0=100
Convolution              Conv_122                 1 1 285 286 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_123                1 1 286 288 0=100
BinaryOp                 Add_124                  2 1 288 264_splitncnn_0 289
Deconvolution            ConvTranspose_125        1 1 289 290 0=5 1=4 3=2 4=1 5=1 6=8000
Interp                   Resize_127               1 1 290 295 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_6              1 2 295 295_splitncnn_0 295_splitncnn_1
Crop                     Slice_132                1 1 295_splitncnn_1 300 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_134                  1 1 300 302 0=2 1=1 2=4.000000e+00
Crop                     Slice_141                1 1 295_splitncnn_0 309 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_142                  2 1 204_splitncnn_0 302 310 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_7              1 4 310 310_splitncnn_0 310_splitncnn_1 310_splitncnn_2 310_splitncnn_3
BinaryOp                 Add_143                  2 1 209_splitncnn_0 309 311
Split                    splitncnn_8              1 2 311 311_splitncnn_0 311_splitncnn_1
Crop                     Slice_148                1 1 310_splitncnn_3 316 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_149                  2 1 in0_splitncnn_4 316 317 0=6
Crop                     Slice_154                1 1 310_splitncnn_2 322 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_155                  2 1 in1_splitncnn_4 322 323 0=6
Crop                     Slice_160                1 1 in0_splitncnn_3 328 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_165                1 1 in1_splitncnn_3 333 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_170                1 1 317 338 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_175                1 1 323 343 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_176               6 1 328 333 141_splitncnn_1 338 343 311_splitncnn_1 344
Interp                   Resize_178               1 1 344 349 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_180               1 1 310_splitncnn_1 354 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Div_183                  1 1 354 359 0=3 1=1 2=2.000000e+00
Concat                   Concat_184               2 1 349 359 360
Convolution              Conv_185                 1 1 360 361 0=50 1=3 3=2 4=1 5=1 6=8100
PReLU                    PRelu_186                1 1 361 363 0=50
Convolution              Conv_187                 1 1 363 364 0=100 1=3 3=2 4=1 5=1 6=45000
PReLU                    PRelu_188                1 1 364 366 0=100
Split                    splitncnn_9              1 2 366 366_splitncnn_0 366_splitncnn_1
Convolution              Conv_189                 1 1 366_splitncnn_1 367 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_190                1 1 367 369 0=100
Convolution              Conv_191                 1 1 369 370 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_192                1 1 370 372 0=100
Convolution              Conv_193                 1 1 372 373 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_194                1 1 373 375 0=100
Convolution              Conv_195                 1 1 375 376 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_196                1 1 376 378 0=100
Convolution              Conv_197                 1 1 378 379 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_198                1 1 379 381 0=100
Convolution              Conv_199                 1 1 381 382 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_200                1 1 382 384 0=100
Convolution              Conv_201                 1 1 384 385 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_202                1 1 385 387 0=100
Convolution              Conv_203                 1 1 387 388 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_204                1 1 388 390 0=100
BinaryOp                 Add_205                  2 1 390 366_splitncnn_0 391
Deconvolution            ConvTranspose_206        1 1 391 392 0=5 1=4 3=2 4=1 5=1 6=8000
Interp                   Resize_208               1 1 392 397 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_10             1 2 397 397_splitncnn_0 397_splitncnn_1
Crop                     Slice_213                1 1 397_splitncnn_1 402 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_215                  1 1 402 404 0=2 1=1 2=2.000000e+00
Crop                     Slice_222                1 1 397_splitncnn_0 411 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_223                  2 1 310_splitncnn_0 404 412 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_11             1 4 412 412_splitncnn_0 412_splitncnn_1 412_splitncnn_2 412_splitncnn_3
BinaryOp                 Add_224                  2 1 311_splitncnn_0 411 413
Split                    splitncnn_12             1 2 413 413_splitncnn_0 413_splitncnn_1
Crop                     Slice_229                1 1 412_splitncnn_3 418 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_230                  2 1 in0_splitncnn_2 418 419 0=6
Crop                     Slice_235                1 1 412_splitncnn_2 424 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_236                  2 1 in1_splitncnn_2 424 425 0=6
Crop                     Slice_241                1 1 in0_splitncnn_1 430 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_246                1 1 in1_splitncnn_1 435 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_251                1 1 419 440 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_256                1 1 425 445 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_257               6 1 430 435 141_splitncnn_0 440 445 413_splitncnn_1 446
Interp                   Resize_259               1 1 446 451 0=2
Interp                   Resize_261               1 1 412_splitncnn_1 456 0=2
Concat                   Concat_265               2 1 451 456 462
Convolution              Conv_266                 1 1 462 463 0=50 1=3 3=2 4=1 5=1 6=8100
PReLU                    PRelu_267                1 1 463 465 0=50
Convolution              Conv_268                 1 1 465 466 0=100 1=3 3=2 4=1 5=1 6=45000
PReLU                    PRelu_269                1 1 466 468 0=100
Split                    splitncnn_13             1 2 468 468_splitncnn_0 468_splitncnn_1
Convolution              Conv_270                 1 1 468_splitncnn_1 469 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_271                1 1 469 471 0=100
Convolution              Conv_272                 1 1 471 472 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_273                1 1 472 474 0=100
Convolution              Conv_274                 1 1 474 475 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_275                1 1 475 477 0=100
Convolution              Conv_276                 1 1 477 478 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_277                1 1 478 480 0=100
Convolution              Conv_278                 1 1 480 481 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_279                1 1 481 483 0=100
Convolution              Conv_280                 1 1 483 484 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_281                1 1 484 486 0=100
Convolution              Conv_282                 1 1 486 487 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_283                1 1 487 489 0=100
Convolution              Conv_284                 1 1 489 490 0=100 1=3 4=1 5=1 6=90000
PReLU                    PRelu_285                1 1 490 492 0=100
BinaryOp                 Add_286                  2 1 492 468_splitncnn_0 493
Deconvolution            ConvTranspose_287        1 1 493 494 0=5 1=4 3=2 4=1 5=1 6=8000
Interp                   Resize_289               1 1 494 499 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_14             1 2 499 499_splitncnn_0 499_splitncnn_1
Crop                     Slice_294                1 1 499_splitncnn_1 504 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_303                1 1 499_splitncnn_0 513 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_304                  2 1 412_splitncnn_0 504 514 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_15             1 2 514 514_splitncnn_0 514_splitncnn_1
BinaryOp                 Add_305                  2 1 413_splitncnn_0 513 515
Crop                     Slice_310                1 1 514_splitncnn_1 520 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_311                  2 1 in0_splitncnn_0 520 521 0=6
Crop                     Slice_316                1 1 514_splitncnn_0 526 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_317                  2 1 in1_splitncnn_0 526 527 0=6
Sigmoid                  Sigmoid_318              1 1 515 528
Split                    splitncnn_16             1 2 528 528_splitncnn_0 528_splitncnn_1
BinaryOp                 Mul_319                  2 1 521 528_splitncnn_1 529 0=2
BinaryOp                 Sub_321                  1 1 528_splitncnn_0 531 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_322                  2 1 527 531 532 0=2
BinaryOp                 Add_323                  2 1 529 532 out0
