7767517
317 393
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 7 in0 in0_splitncnn_0 in0_splitncnn_1 in0_splitncnn_2 in0_splitncnn_3 in0_splitncnn_4 in0_splitncnn_5 in0_splitncnn_6
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 6 in1 in1_splitncnn_0 in1_splitncnn_1 in1_splitncnn_2 in1_splitncnn_3 in1_splitncnn_4 in1_splitncnn_5
Input                    in2                      0 1 in2
MemoryData               block0.convblock.0.beta  0 1 block0.convblock.0.beta 0=1 1=1 2=256
MemoryData               block0.convblock.1.beta  0 1 block0.convblock.1.beta 0=1 1=1 2=256
MemoryData               block0.convblock.2.beta  0 1 block0.convblock.2.beta 0=1 1=1 2=256
MemoryData               block0.convblock.3.beta  0 1 block0.convblock.3.beta 0=1 1=1 2=256
MemoryData               block0.convblock.4.beta  0 1 block0.convblock.4.beta 0=1 1=1 2=256
MemoryData               block0.convblock.5.beta  0 1 block0.convblock.5.beta 0=1 1=1 2=256
MemoryData               block0.convblock.6.beta  0 1 block0.convblock.6.beta 0=1 1=1 2=256
MemoryData               block0.convblock.7.beta  0 1 block0.convblock.7.beta 0=1 1=1 2=256
MemoryData               block1.convblock.0.beta  0 1 block1.convblock.0.beta 0=1 1=1 2=192
MemoryData               block1.convblock.1.beta  0 1 block1.convblock.1.beta 0=1 1=1 2=192
MemoryData               block1.convblock.2.beta  0 1 block1.convblock.2.beta 0=1 1=1 2=192
MemoryData               block1.convblock.3.beta  0 1 block1.convblock.3.beta 0=1 1=1 2=192
MemoryData               block1.convblock.4.beta  0 1 block1.convblock.4.beta 0=1 1=1 2=192
MemoryData               block1.convblock.5.beta  0 1 block1.convblock.5.beta 0=1 1=1 2=192
MemoryData               block1.convblock.6.beta  0 1 block1.convblock.6.beta 0=1 1=1 2=192
MemoryData               block1.convblock.7.beta  0 1 block1.convblock.7.beta 0=1 1=1 2=192
MemoryData               block2.convblock.0.beta  0 1 block2.convblock.0.beta 0=1 1=1 2=96
MemoryData               block2.convblock.1.beta  0 1 block2.convblock.1.beta 0=1 1=1 2=96
MemoryData               block2.convblock.2.beta  0 1 block2.convblock.2.beta 0=1 1=1 2=96
MemoryData               block2.convblock.3.beta  0 1 block2.convblock.3.beta 0=1 1=1 2=96
MemoryData               block2.convblock.4.beta  0 1 block2.convblock.4.beta 0=1 1=1 2=96
MemoryData               block2.convblock.5.beta  0 1 block2.convblock.5.beta 0=1 1=1 2=96
MemoryData               block2.convblock.6.beta  0 1 block2.convblock.6.beta 0=1 1=1 2=96
MemoryData               block2.convblock.7.beta  0 1 block2.convblock.7.beta 0=1 1=1 2=96
MemoryData               block3.convblock.0.beta  0 1 block3.convblock.0.beta 0=1 1=1 2=48
MemoryData               block3.convblock.1.beta  0 1 block3.convblock.1.beta 0=1 1=1 2=48
MemoryData               block3.convblock.2.beta  0 1 block3.convblock.2.beta 0=1 1=1 2=48
MemoryData               block3.convblock.3.beta  0 1 block3.convblock.3.beta 0=1 1=1 2=48
MemoryData               block3.convblock.4.beta  0 1 block3.convblock.4.beta 0=1 1=1 2=48
MemoryData               block3.convblock.5.beta  0 1 block3.convblock.5.beta 0=1 1=1 2=48
MemoryData               block3.convblock.6.beta  0 1 block3.convblock.6.beta 0=1 1=1 2=48
MemoryData               block3.convblock.7.beta  0 1 block3.convblock.7.beta 0=1 1=1 2=48
Crop                     Slice_4                  1 1 in0_splitncnn_6 135 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_6                    1 1 135 137 0=2 1=1
BinaryOp                 Add_8                    1 1 137 139 1=1 2=1.000000e+00
BinaryOp                 Mul_9                    2 1 139 in2 140 0=2
Split                    splitncnn_0              1 4 140 140_splitncnn_0 140_splitncnn_1 140_splitncnn_2 140_splitncnn_3
Crop                     Slice_15                 1 1 in0_splitncnn_5 146 -23309=1,0 -23310=1,3 -23311=1,0
Clip                     Clip_16                  1 1 146 151 0=0.000000e+00 1=1.000000e+00
Convolution              Conv_17                  1 1 151 153 0=32 1=3 3=2 4=1 5=1 6=864 9=2 -23310=1,2.000000e-01
Convolution              Conv_19                  1 1 153 155 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,2.000000e-01
Convolution              Conv_21                  1 1 155 157 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,2.000000e-01
Deconvolution            ConvTranspose_23         1 1 157 158 0=8 1=4 3=2 4=1 5=1 6=4096
Split                    splitncnn_1              1 4 158 158_splitncnn_0 158_splitncnn_1 158_splitncnn_2 158_splitncnn_3
Crop                     Slice_28                 1 1 in1_splitncnn_5 163 -23309=1,0 -23310=1,3 -23311=1,0
Clip                     Clip_29                  1 1 163 168 0=0.000000e+00 1=1.000000e+00
Convolution              Conv_30                  1 1 168 170 0=32 1=3 3=2 4=1 5=1 6=864 9=2 -23310=1,2.000000e-01
Convolution              Conv_32                  1 1 170 172 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,2.000000e-01
Convolution              Conv_34                  1 1 172 174 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,2.000000e-01
Deconvolution            ConvTranspose_36         1 1 174 175 0=8 1=4 3=2 4=1 5=1 6=4096
Split                    splitncnn_2              1 4 175 175_splitncnn_0 175_splitncnn_1 175_splitncnn_2 175_splitncnn_3
Crop                     Slice_41                 1 1 in0_splitncnn_4 180 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_46                 1 1 in1_splitncnn_4 185 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_47                5 1 180 185 158_splitncnn_3 175_splitncnn_3 140_splitncnn_3 186
Interp                   Resize_49                1 1 186 191 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_50                  1 1 191 193 0=128 1=3 3=2 4=1 5=1 6=26496 9=2 -23310=1,2.000000e-01
Convolution              Conv_52                  1 1 193 195 0=256 1=3 3=2 4=1 5=1 6=294912 9=2 -23310=1,2.000000e-01
Split                    splitncnn_3              1 2 195 195_splitncnn_0 195_splitncnn_1
Convolution              Conv_54                  1 1 195_splitncnn_1 196 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_55                   2 1 196 block0.convblock.0.beta 197 0=2
BinaryOp                 Add_56                   2 1 197 195_splitncnn_0 198
ReLU                     LeakyRelu_57             1 1 198 199 0=2.000000e-01
Split                    splitncnn_4              1 2 199 199_splitncnn_0 199_splitncnn_1
Convolution              Conv_58                  1 1 199_splitncnn_1 200 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_59                   2 1 200 block0.convblock.1.beta 201 0=2
BinaryOp                 Add_60                   2 1 201 199_splitncnn_0 202
ReLU                     LeakyRelu_61             1 1 202 203 0=2.000000e-01
Split                    splitncnn_5              1 2 203 203_splitncnn_0 203_splitncnn_1
Convolution              Conv_62                  1 1 203_splitncnn_1 204 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_63                   2 1 204 block0.convblock.2.beta 205 0=2
BinaryOp                 Add_64                   2 1 205 203_splitncnn_0 206
ReLU                     LeakyRelu_65             1 1 206 207 0=2.000000e-01
Split                    splitncnn_6              1 2 207 207_splitncnn_0 207_splitncnn_1
Convolution              Conv_66                  1 1 207_splitncnn_1 208 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_67                   2 1 208 block0.convblock.3.beta 209 0=2
BinaryOp                 Add_68                   2 1 209 207_splitncnn_0 210
ReLU                     LeakyRelu_69             1 1 210 211 0=2.000000e-01
Split                    splitncnn_7              1 2 211 211_splitncnn_0 211_splitncnn_1
Convolution              Conv_70                  1 1 211_splitncnn_1 212 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_71                   2 1 212 block0.convblock.4.beta 213 0=2
BinaryOp                 Add_72                   2 1 213 211_splitncnn_0 214
ReLU                     LeakyRelu_73             1 1 214 215 0=2.000000e-01
Split                    splitncnn_8              1 2 215 215_splitncnn_0 215_splitncnn_1
Convolution              Conv_74                  1 1 215_splitncnn_1 216 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_75                   2 1 216 block0.convblock.5.beta 217 0=2
BinaryOp                 Add_76                   2 1 217 215_splitncnn_0 218
ReLU                     LeakyRelu_77             1 1 218 219 0=2.000000e-01
Split                    splitncnn_9              1 2 219 219_splitncnn_0 219_splitncnn_1
Convolution              Conv_78                  1 1 219_splitncnn_1 220 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_79                   2 1 220 block0.convblock.6.beta 221 0=2
BinaryOp                 Add_80                   2 1 221 219_splitncnn_0 222
ReLU                     LeakyRelu_81             1 1 222 223 0=2.000000e-01
Split                    splitncnn_10             1 2 223 223_splitncnn_0 223_splitncnn_1
Convolution              Conv_82                  1 1 223_splitncnn_1 224 0=256 1=3 4=1 5=1 6=589824
BinaryOp                 Mul_83                   2 1 224 block0.convblock.7.beta 225 0=2
BinaryOp                 Add_84                   2 1 225 223_splitncnn_0 226
ReLU                     LeakyRelu_85             1 1 226 227 0=2.000000e-01
Deconvolution            ConvTranspose_86         1 1 227 228 0=52 1=4 3=2 4=1 5=1 6=212992
PixelShuffle             DepthToSpace_87          1 1 228 229 0=2
Interp                   Resize_89                1 1 229 234 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_11             1 3 234 234_splitncnn_0 234_splitncnn_1 234_splitncnn_2
Crop                     Slice_94                 1 1 234_splitncnn_2 239 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_96                   1 1 239 241 0=2 1=1 2=8.000000e+00
Split                    splitncnn_12             1 6 241 241_splitncnn_0 241_splitncnn_1 241_splitncnn_2 241_splitncnn_3 241_splitncnn_4 241_splitncnn_5
Crop                     Slice_101                1 1 234_splitncnn_1 246 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_106                1 1 234_splitncnn_0 251 -23309=1,5 -23310=1,2147483647 -23311=1,0
Crop                     Slice_111                1 1 241_splitncnn_5 256 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_112                  2 1 in0_splitncnn_3 256 257 0=6
Crop                     Slice_117                1 1 241_splitncnn_4 262 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_118                  2 1 in1_splitncnn_3 262 263 0=6
Crop                     Slice_123                1 1 241_splitncnn_3 268 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_124                  2 1 158_splitncnn_2 268 269 0=6
Crop                     Slice_129                1 1 241_splitncnn_2 274 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_130                  2 1 175_splitncnn_2 274 275 0=6
Crop                     Slice_135                1 1 257 280 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_140                1 1 263 285 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_141               7 1 280 285 269 275 140_splitncnn_2 246 251 286
Interp                   Resize_143               1 1 286 291 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_145               1 1 241_splitncnn_1 296 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Div_146                  1 1 296 299 0=3 1=1 2=4.000000e+00
Concat                   Concat_147               2 1 291 299 300
Convolution              Conv_148                 1 1 300 302 0=96 1=3 3=2 4=1 5=1 6=31104 9=2 -23310=1,2.000000e-01
Convolution              Conv_150                 1 1 302 304 0=192 1=3 3=2 4=1 5=1 6=165888 9=2 -23310=1,2.000000e-01
Split                    splitncnn_13             1 2 304 304_splitncnn_0 304_splitncnn_1
Convolution              Conv_152                 1 1 304_splitncnn_1 305 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_153                  2 1 305 block1.convblock.0.beta 306 0=2
BinaryOp                 Add_154                  2 1 306 304_splitncnn_0 307
ReLU                     LeakyRelu_155            1 1 307 308 0=2.000000e-01
Split                    splitncnn_14             1 2 308 308_splitncnn_0 308_splitncnn_1
Convolution              Conv_156                 1 1 308_splitncnn_1 309 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_157                  2 1 309 block1.convblock.1.beta 310 0=2
BinaryOp                 Add_158                  2 1 310 308_splitncnn_0 311
ReLU                     LeakyRelu_159            1 1 311 312 0=2.000000e-01
Split                    splitncnn_15             1 2 312 312_splitncnn_0 312_splitncnn_1
Convolution              Conv_160                 1 1 312_splitncnn_1 313 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_161                  2 1 313 block1.convblock.2.beta 314 0=2
BinaryOp                 Add_162                  2 1 314 312_splitncnn_0 315
ReLU                     LeakyRelu_163            1 1 315 316 0=2.000000e-01
Split                    splitncnn_16             1 2 316 316_splitncnn_0 316_splitncnn_1
Convolution              Conv_164                 1 1 316_splitncnn_1 317 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_165                  2 1 317 block1.convblock.3.beta 318 0=2
BinaryOp                 Add_166                  2 1 318 316_splitncnn_0 319
ReLU                     LeakyRelu_167            1 1 319 320 0=2.000000e-01
Split                    splitncnn_17             1 2 320 320_splitncnn_0 320_splitncnn_1
Convolution              Conv_168                 1 1 320_splitncnn_1 321 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_169                  2 1 321 block1.convblock.4.beta 322 0=2
BinaryOp                 Add_170                  2 1 322 320_splitncnn_0 323
ReLU                     LeakyRelu_171            1 1 323 324 0=2.000000e-01
Split                    splitncnn_18             1 2 324 324_splitncnn_0 324_splitncnn_1
Convolution              Conv_172                 1 1 324_splitncnn_1 325 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_173                  2 1 325 block1.convblock.5.beta 326 0=2
BinaryOp                 Add_174                  2 1 326 324_splitncnn_0 327
ReLU                     LeakyRelu_175            1 1 327 328 0=2.000000e-01
Split                    splitncnn_19             1 2 328 328_splitncnn_0 328_splitncnn_1
Convolution              Conv_176                 1 1 328_splitncnn_1 329 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_177                  2 1 329 block1.convblock.6.beta 330 0=2
BinaryOp                 Add_178                  2 1 330 328_splitncnn_0 331
ReLU                     LeakyRelu_179            1 1 331 332 0=2.000000e-01
Split                    splitncnn_20             1 2 332 332_splitncnn_0 332_splitncnn_1
Convolution              Conv_180                 1 1 332_splitncnn_1 333 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_181                  2 1 333 block1.convblock.7.beta 334 0=2
BinaryOp                 Add_182                  2 1 334 332_splitncnn_0 335
ReLU                     LeakyRelu_183            1 1 335 336 0=2.000000e-01
Deconvolution            ConvTranspose_184        1 1 336 337 0=52 1=4 3=2 4=1 5=1 6=159744
PixelShuffle             DepthToSpace_185         1 1 337 338 0=2
Interp                   Resize_187               1 1 338 343 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_21             1 3 343 343_splitncnn_0 343_splitncnn_1 343_splitncnn_2
Crop                     Slice_192                1 1 343_splitncnn_2 348 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_199                1 1 343_splitncnn_1 355 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_204                1 1 343_splitncnn_0 360 -23309=1,5 -23310=1,2147483647 -23311=1,0
Eltwise                  Add_205                  2 1 241_splitncnn_0 348 361 0=1 -23301=2,1.000000e+00,4.000000e+00
Split                    splitncnn_22             1 6 361 361_splitncnn_0 361_splitncnn_1 361_splitncnn_2 361_splitncnn_3 361_splitncnn_4 361_splitncnn_5
Crop                     Slice_210                1 1 361_splitncnn_5 366 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_211                  2 1 in0_splitncnn_2 366 367 0=6
Crop                     Slice_216                1 1 361_splitncnn_4 372 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_217                  2 1 in1_splitncnn_2 372 373 0=6
Crop                     Slice_222                1 1 361_splitncnn_3 378 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_223                  2 1 158_splitncnn_1 378 379 0=6
Crop                     Slice_228                1 1 361_splitncnn_2 384 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_229                  2 1 175_splitncnn_1 384 385 0=6
Crop                     Slice_234                1 1 367 390 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_239                1 1 373 395 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_240               7 1 390 395 379 385 140_splitncnn_1 355 360 396
Interp                   Resize_242               1 1 396 401 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_244               1 1 361_splitncnn_1 406 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Div_245                  1 1 406 409 0=3 1=1 2=2.000000e+00
Concat                   Concat_246               2 1 401 409 410
Convolution              Conv_247                 1 1 410 412 0=48 1=3 3=2 4=1 5=1 6=15552 9=2 -23310=1,2.000000e-01
Convolution              Conv_249                 1 1 412 414 0=96 1=3 3=2 4=1 5=1 6=41472 9=2 -23310=1,2.000000e-01
Split                    splitncnn_23             1 2 414 414_splitncnn_0 414_splitncnn_1
Convolution              Conv_251                 1 1 414_splitncnn_1 415 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_252                  2 1 415 block2.convblock.0.beta 416 0=2
BinaryOp                 Add_253                  2 1 416 414_splitncnn_0 417
ReLU                     LeakyRelu_254            1 1 417 418 0=2.000000e-01
Split                    splitncnn_24             1 2 418 418_splitncnn_0 418_splitncnn_1
Convolution              Conv_255                 1 1 418_splitncnn_1 419 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_256                  2 1 419 block2.convblock.1.beta 420 0=2
BinaryOp                 Add_257                  2 1 420 418_splitncnn_0 421
ReLU                     LeakyRelu_258            1 1 421 422 0=2.000000e-01
Split                    splitncnn_25             1 2 422 422_splitncnn_0 422_splitncnn_1
Convolution              Conv_259                 1 1 422_splitncnn_1 423 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_260                  2 1 423 block2.convblock.2.beta 424 0=2
BinaryOp                 Add_261                  2 1 424 422_splitncnn_0 425
ReLU                     LeakyRelu_262            1 1 425 426 0=2.000000e-01
Split                    splitncnn_26             1 2 426 426_splitncnn_0 426_splitncnn_1
Convolution              Conv_263                 1 1 426_splitncnn_1 427 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_264                  2 1 427 block2.convblock.3.beta 428 0=2
BinaryOp                 Add_265                  2 1 428 426_splitncnn_0 429
ReLU                     LeakyRelu_266            1 1 429 430 0=2.000000e-01
Split                    splitncnn_27             1 2 430 430_splitncnn_0 430_splitncnn_1
Convolution              Conv_267                 1 1 430_splitncnn_1 431 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_268                  2 1 431 block2.convblock.4.beta 432 0=2
BinaryOp                 Add_269                  2 1 432 430_splitncnn_0 433
ReLU                     LeakyRelu_270            1 1 433 434 0=2.000000e-01
Split                    splitncnn_28             1 2 434 434_splitncnn_0 434_splitncnn_1
Convolution              Conv_271                 1 1 434_splitncnn_1 435 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_272                  2 1 435 block2.convblock.5.beta 436 0=2
BinaryOp                 Add_273                  2 1 436 434_splitncnn_0 437
ReLU                     LeakyRelu_274            1 1 437 438 0=2.000000e-01
Split                    splitncnn_29             1 2 438 438_splitncnn_0 438_splitncnn_1
Convolution              Conv_275                 1 1 438_splitncnn_1 439 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_276                  2 1 439 block2.convblock.6.beta 440 0=2
BinaryOp                 Add_277                  2 1 440 438_splitncnn_0 441
ReLU                     LeakyRelu_278            1 1 441 442 0=2.000000e-01
Split                    splitncnn_30             1 2 442 442_splitncnn_0 442_splitncnn_1
Convolution              Conv_279                 1 1 442_splitncnn_1 443 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_280                  2 1 443 block2.convblock.7.beta 444 0=2
BinaryOp                 Add_281                  2 1 444 442_splitncnn_0 445
ReLU                     LeakyRelu_282            1 1 445 446 0=2.000000e-01
Deconvolution            ConvTranspose_283        1 1 446 447 0=52 1=4 3=2 4=1 5=1 6=79872
PixelShuffle             DepthToSpace_284         1 1 447 448 0=2
Interp                   Resize_286               1 1 448 453 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_31             1 3 453 453_splitncnn_0 453_splitncnn_1 453_splitncnn_2
Crop                     Slice_291                1 1 453_splitncnn_2 458 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_298                1 1 453_splitncnn_1 465 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_303                1 1 453_splitncnn_0 470 -23309=1,5 -23310=1,2147483647 -23311=1,0
Eltwise                  Add_304                  2 1 361_splitncnn_0 458 471 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_32             1 6 471 471_splitncnn_0 471_splitncnn_1 471_splitncnn_2 471_splitncnn_3 471_splitncnn_4 471_splitncnn_5
Crop                     Slice_309                1 1 471_splitncnn_5 476 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_310                  2 1 in0_splitncnn_1 476 477 0=6
Crop                     Slice_315                1 1 471_splitncnn_4 482 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_316                  2 1 in1_splitncnn_1 482 483 0=6
Crop                     Slice_321                1 1 471_splitncnn_3 488 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_322                  2 1 158_splitncnn_0 488 489 0=6
Crop                     Slice_327                1 1 471_splitncnn_2 494 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_328                  2 1 175_splitncnn_0 494 495 0=6
Crop                     Slice_333                1 1 477 500 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_338                1 1 483 505 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_339               7 1 500 505 489 495 140_splitncnn_0 465 470 506
Interp                   Resize_341               1 1 506 511 0=2
Interp                   Resize_343               1 1 471_splitncnn_1 516 0=2
Concat                   Concat_345               2 1 511 516 520
Convolution              Conv_346                 1 1 520 522 0=24 1=3 3=2 4=1 5=1 6=7776 9=2 -23310=1,2.000000e-01
Convolution              Conv_348                 1 1 522 524 0=48 1=3 3=2 4=1 5=1 6=10368 9=2 -23310=1,2.000000e-01
Split                    splitncnn_33             1 2 524 524_splitncnn_0 524_splitncnn_1
Convolution              Conv_350                 1 1 524_splitncnn_1 525 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_351                  2 1 525 block3.convblock.0.beta 526 0=2
BinaryOp                 Add_352                  2 1 526 524_splitncnn_0 527
ReLU                     LeakyRelu_353            1 1 527 528 0=2.000000e-01
Split                    splitncnn_34             1 2 528 528_splitncnn_0 528_splitncnn_1
Convolution              Conv_354                 1 1 528_splitncnn_1 529 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_355                  2 1 529 block3.convblock.1.beta 530 0=2
BinaryOp                 Add_356                  2 1 530 528_splitncnn_0 531
ReLU                     LeakyRelu_357            1 1 531 532 0=2.000000e-01
Split                    splitncnn_35             1 2 532 532_splitncnn_0 532_splitncnn_1
Convolution              Conv_358                 1 1 532_splitncnn_1 533 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_359                  2 1 533 block3.convblock.2.beta 534 0=2
BinaryOp                 Add_360                  2 1 534 532_splitncnn_0 535
ReLU                     LeakyRelu_361            1 1 535 536 0=2.000000e-01
Split                    splitncnn_36             1 2 536 536_splitncnn_0 536_splitncnn_1
Convolution              Conv_362                 1 1 536_splitncnn_1 537 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_363                  2 1 537 block3.convblock.3.beta 538 0=2
BinaryOp                 Add_364                  2 1 538 536_splitncnn_0 539
ReLU                     LeakyRelu_365            1 1 539 540 0=2.000000e-01
Split                    splitncnn_37             1 2 540 540_splitncnn_0 540_splitncnn_1
Convolution              Conv_366                 1 1 540_splitncnn_1 541 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_367                  2 1 541 block3.convblock.4.beta 542 0=2
BinaryOp                 Add_368                  2 1 542 540_splitncnn_0 543
ReLU                     LeakyRelu_369            1 1 543 544 0=2.000000e-01
Split                    splitncnn_38             1 2 544 544_splitncnn_0 544_splitncnn_1
Convolution              Conv_370                 1 1 544_splitncnn_1 545 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_371                  2 1 545 block3.convblock.5.beta 546 0=2
BinaryOp                 Add_372                  2 1 546 544_splitncnn_0 547
ReLU                     LeakyRelu_373            1 1 547 548 0=2.000000e-01
Split                    splitncnn_39             1 2 548 548_splitncnn_0 548_splitncnn_1
Convolution              Conv_374                 1 1 548_splitncnn_1 549 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_375                  2 1 549 block3.convblock.6.beta 550 0=2
BinaryOp                 Add_376                  2 1 550 548_splitncnn_0 551
ReLU                     LeakyRelu_377            1 1 551 552 0=2.000000e-01
Split                    splitncnn_40             1 2 552 552_splitncnn_0 552_splitncnn_1
Convolution              Conv_378                 1 1 552_splitncnn_1 553 0=48 1=3 4=1 5=1 6=20736
BinaryOp                 Mul_379                  2 1 553 block3.convblock.7.beta 554 0=2
BinaryOp                 Add_380                  2 1 554 552_splitncnn_0 555
ReLU                     LeakyRelu_381            1 1 555 556 0=2.000000e-01
Deconvolution            ConvTranspose_382        1 1 556 557 0=52 1=4 3=2 4=1 5=1 6=39936
PixelShuffle             DepthToSpace_383         1 1 557 558 0=2
Interp                   Resize_385               1 1 558 563 0=2
Split                    splitncnn_41             1 2 563 563_splitncnn_0 563_splitncnn_1
Crop                     Slice_390                1 1 563_splitncnn_1 568 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_397                1 1 563_splitncnn_0 575 -23309=1,4 -23310=1,5 -23311=1,0
BinaryOp                 Add_398                  2 1 471_splitncnn_0 568 576
Split                    splitncnn_42             1 2 576 576_splitncnn_0 576_splitncnn_1
Crop                     Slice_403                1 1 576_splitncnn_1 581 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_404                  2 1 in0_splitncnn_0 581 582 0=6
Crop                     Slice_409                1 1 576_splitncnn_0 587 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_410                  2 1 in1_splitncnn_0 587 588 0=6
Sigmoid                  Sigmoid_411              1 1 575 589
Split                    splitncnn_43             1 2 589 589_splitncnn_0 589_splitncnn_1
BinaryOp                 Mul_412                  2 1 582 589_splitncnn_1 590 0=2
BinaryOp                 Sub_414                  1 1 589_splitncnn_0 592 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_415                  2 1 588 592 593 0=2
BinaryOp                 Add_416                  2 1 590 593 out0
