7767517
189 224
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Concat                   Concat_0                 2 1 in0 in1 onnx::Slice_193
Split                    splitncnn_0              1 3 onnx::Slice_193 onnx::Slice_193_splitncnn_0 onnx::Slice_193_splitncnn_1 onnx::Slice_193_splitncnn_2
Crop                     Slice_5                  1 1 onnx::Slice_193_splitncnn_2 img0 -23309=1,0 -23310=1,3 -23311=1,0
Split                    splitncnn_1              1 5 img0 img0_splitncnn_0 img0_splitncnn_1 img0_splitncnn_2 img0_splitncnn_3 img0_splitncnn_4
Crop                     Slice_10                 1 1 onnx::Slice_193_splitncnn_1 img1 -23309=1,3 -23310=1,2147483647 -23311=1,0
Split                    splitncnn_2              1 5 img1 img1_splitncnn_0 img1_splitncnn_1 img1_splitncnn_2 img1_splitncnn_3 img1_splitncnn_4
Crop                     Slice_15                 1 1 onnx::Slice_193_splitncnn_0 onnx::Mul_208 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_17                   1 1 onnx::Mul_208 onnx::Add_210 0=2 1=1
BinaryOp                 Add_19                   1 1 onnx::Add_210 onnx::Mul_212 1=1 2=1.000000e+00
BinaryOp                 Mul_20                   2 1 onnx::Mul_212 in2 onnx::Concat_213 0=2
Split                    splitncnn_3              1 4 onnx::Concat_213 onnx::Concat_213_splitncnn_0 onnx::Concat_213_splitncnn_1 onnx::Concat_213_splitncnn_2 onnx::Concat_213_splitncnn_3
Crop                     Slice_25                 1 1 img0_splitncnn_4 onnx::Concat_218 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_30                 1 1 img1_splitncnn_4 onnx::Concat_223 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_31                3 1 onnx::Concat_218 onnx::Concat_223 onnx::Concat_213_splitncnn_3 x
Interp                   Resize_32                1 1 x input.1 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_33                  1 1 input.1 onnx::PRelu_230 0=96 1=3 3=2 4=1 5=1 6=6048
PReLU                    PRelu_34                 1 1 onnx::PRelu_230 input.3 0=96
Convolution              Conv_35                  1 1 input.3 onnx::PRelu_234 0=192 1=3 3=2 4=1 5=1 6=165888
PReLU                    PRelu_36                 1 1 onnx::PRelu_234 input.7 0=192
Split                    splitncnn_4              1 2 input.7 input.7_splitncnn_0 input.7_splitncnn_1
Convolution              Conv_37                  1 1 input.7_splitncnn_1 onnx::PRelu_238 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_38                 1 1 onnx::PRelu_238 input.11 0=192
Convolution              Conv_39                  1 1 input.11 onnx::PRelu_242 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_40                 1 1 onnx::PRelu_242 input.15 0=192
Convolution              Conv_41                  1 1 input.15 onnx::PRelu_246 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_42                 1 1 onnx::PRelu_246 input.19 0=192
Convolution              Conv_43                  1 1 input.19 onnx::PRelu_250 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_44                 1 1 onnx::PRelu_250 input.23 0=192
Convolution              Conv_45                  1 1 input.23 onnx::PRelu_254 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_46                 1 1 onnx::PRelu_254 input.27 0=192
Convolution              Conv_47                  1 1 input.27 onnx::PRelu_258 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_48                 1 1 onnx::PRelu_258 input.31 0=192
Convolution              Conv_49                  1 1 input.31 onnx::PRelu_262 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_50                 1 1 onnx::PRelu_262 input.35 0=192
Convolution              Conv_51                  1 1 input.35 onnx::PRelu_266 0=192 1=3 4=1 5=1 6=331776
PReLU                    PRelu_52                 1 1 onnx::PRelu_266 onnx::Add_269 0=192
BinaryOp                 Add_53                   2 1 onnx::Add_269 input.7_splitncnn_0 onnx::ConvTranspose_270
Deconvolution            ConvTranspose_54         1 1 onnx::ConvTranspose_270 tmp 0=5 1=4 3=2 4=1 5=1 6=15360
Interp                   Resize_55                1 1 tmp onnx::Slice_276 0=2 1=1.600000e+01 2=1.600000e+01
Split                    splitncnn_5              1 2 onnx::Slice_276 onnx::Slice_276_splitncnn_0 onnx::Slice_276_splitncnn_1
Crop                     Slice_60                 1 1 onnx::Slice_276_splitncnn_1 onnx::Mul_281 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_62                   1 1 onnx::Mul_281 onnx::Mul_283 0=2 1=1 2=8.000000e+00
BinaryOp                 Mul_64                   1 1 onnx::Mul_283 flow 0=2 1=1 2=2.000000e+00
Split                    splitncnn_6              1 4 flow flow_splitncnn_0 flow_splitncnn_1 flow_splitncnn_2 flow_splitncnn_3
Crop                     Slice_69                 1 1 onnx::Slice_276_splitncnn_0 onnx::Concat_290 -23309=1,4 -23310=1,5 -23311=1,0
Split                    splitncnn_7              1 2 onnx::Concat_290 onnx::Concat_290_splitncnn_0 onnx::Concat_290_splitncnn_1
Crop                     Slice_74                 1 1 flow_splitncnn_3 onnx::Pow_295 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_0                   2 1 img0_splitncnn_3 onnx::Pow_295 onnx::Slice_296 0=6
Crop                     Slice_80                 1 1 flow_splitncnn_2 onnx::Pow_301 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_1                   2 1 img1_splitncnn_3 onnx::Pow_301 onnx::Slice_302 0=6
Crop                     Slice_86                 1 1 onnx::Slice_296 onnx::Concat_307 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_91                 1 1 onnx::Slice_302 onnx::Concat_312 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_92                4 1 onnx::Concat_307 onnx::Concat_312 onnx::Concat_213_splitncnn_2 onnx::Concat_290_splitncnn_1 x.3
Interp                   Resize_93                1 1 x.3 onnx::Concat_318 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_94                1 1 flow_splitncnn_1 onnx::Mul_323 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_96                   1 1 onnx::Mul_323 onnx::Div_325 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_98                   1 1 onnx::Div_325 onnx::Concat_327 0=3 1=1 2=4.000000e+00
Concat                   Concat_99                2 1 onnx::Concat_318 onnx::Concat_327 input.39
Convolution              Conv_100                 1 1 input.39 onnx::PRelu_329 0=64 1=3 3=2 4=1 5=1 6=6912
PReLU                    PRelu_101                1 1 onnx::PRelu_329 input.43 0=64
Convolution              Conv_102                 1 1 input.43 onnx::PRelu_333 0=128 1=3 3=2 4=1 5=1 6=73728
PReLU                    PRelu_103                1 1 onnx::PRelu_333 input.47 0=128
Split                    splitncnn_8              1 2 input.47 input.47_splitncnn_0 input.47_splitncnn_1
Convolution              Conv_104                 1 1 input.47_splitncnn_1 onnx::PRelu_337 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_105                1 1 onnx::PRelu_337 input.51 0=128
Convolution              Conv_106                 1 1 input.51 onnx::PRelu_341 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_107                1 1 onnx::PRelu_341 input.55 0=128
Convolution              Conv_108                 1 1 input.55 onnx::PRelu_345 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_109                1 1 onnx::PRelu_345 input.59 0=128
Convolution              Conv_110                 1 1 input.59 onnx::PRelu_349 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_111                1 1 onnx::PRelu_349 input.63 0=128
Convolution              Conv_112                 1 1 input.63 onnx::PRelu_353 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_113                1 1 onnx::PRelu_353 input.67 0=128
Convolution              Conv_114                 1 1 input.67 onnx::PRelu_357 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_115                1 1 onnx::PRelu_357 input.71 0=128
Convolution              Conv_116                 1 1 input.71 onnx::PRelu_361 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_117                1 1 onnx::PRelu_361 input.75 0=128
Convolution              Conv_118                 1 1 input.75 onnx::PRelu_365 0=128 1=3 4=1 5=1 6=147456
PReLU                    PRelu_119                1 1 onnx::PRelu_365 onnx::Add_368 0=128
BinaryOp                 Add_120                  2 1 onnx::Add_368 input.47_splitncnn_0 onnx::ConvTranspose_369
Deconvolution            ConvTranspose_121        1 1 onnx::ConvTranspose_369 tmp.3 0=5 1=4 3=2 4=1 5=1 6=10240
Interp                   Resize_122               1 1 tmp.3 onnx::Slice_375 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_9              1 2 onnx::Slice_375 onnx::Slice_375_splitncnn_0 onnx::Slice_375_splitncnn_1
Crop                     Slice_127                1 1 onnx::Slice_375_splitncnn_1 onnx::Mul_380 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_129                  1 1 onnx::Mul_380 onnx::Mul_382 0=2 1=1 2=4.000000e+00
Crop                     Slice_136                1 1 onnx::Slice_375_splitncnn_0 onnx::Add_389 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_137                  2 1 flow_splitncnn_0 onnx::Mul_382 flow.3 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_10             1 4 flow.3 flow.3_splitncnn_0 flow.3_splitncnn_1 flow.3_splitncnn_2 flow.3_splitncnn_3
BinaryOp                 Add_138                  2 1 onnx::Concat_290_splitncnn_0 onnx::Add_389 onnx::Concat_391
Split                    splitncnn_11             1 2 onnx::Concat_391 onnx::Concat_391_splitncnn_0 onnx::Concat_391_splitncnn_1
Crop                     Slice_143                1 1 flow.3_splitncnn_3 onnx::Pow_396 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_3                   2 1 img0_splitncnn_2 onnx::Pow_396 onnx::Slice_397 0=6
Crop                     Slice_149                1 1 flow.3_splitncnn_2 onnx::Pow_402 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_2                   2 1 img1_splitncnn_2 onnx::Pow_402 onnx::Slice_403 0=6
Crop                     Slice_155                1 1 onnx::Slice_397 onnx::Concat_408 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_160                1 1 onnx::Slice_403 onnx::Concat_413 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_161               4 1 onnx::Concat_408 onnx::Concat_413 onnx::Concat_213_splitncnn_1 onnx::Concat_391_splitncnn_1 x.7
Interp                   Resize_162               1 1 x.7 onnx::Concat_419 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_163               1 1 flow.3_splitncnn_1 onnx::Mul_424 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_165                  1 1 onnx::Mul_424 onnx::Div_426 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_167                  1 1 onnx::Div_426 onnx::Concat_428 0=3 1=1 2=2.000000e+00
Concat                   Concat_168               2 1 onnx::Concat_419 onnx::Concat_428 input.79
Convolution              Conv_169                 1 1 input.79 onnx::PRelu_430 0=48 1=3 3=2 4=1 5=1 6=5184
PReLU                    PRelu_170                1 1 onnx::PRelu_430 input.83 0=48
Convolution              Conv_171                 1 1 input.83 onnx::PRelu_434 0=96 1=3 3=2 4=1 5=1 6=41472
PReLU                    PRelu_172                1 1 onnx::PRelu_434 input.87 0=96
Split                    splitncnn_12             1 2 input.87 input.87_splitncnn_0 input.87_splitncnn_1
Convolution              Conv_173                 1 1 input.87_splitncnn_1 onnx::PRelu_438 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_174                1 1 onnx::PRelu_438 input.91 0=96
Convolution              Conv_175                 1 1 input.91 onnx::PRelu_442 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_176                1 1 onnx::PRelu_442 input.95 0=96
Convolution              Conv_177                 1 1 input.95 onnx::PRelu_446 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_178                1 1 onnx::PRelu_446 input.99 0=96
Convolution              Conv_179                 1 1 input.99 onnx::PRelu_450 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_180                1 1 onnx::PRelu_450 input.103 0=96
Convolution              Conv_181                 1 1 input.103 onnx::PRelu_454 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_182                1 1 onnx::PRelu_454 input.107 0=96
Convolution              Conv_183                 1 1 input.107 onnx::PRelu_458 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_184                1 1 onnx::PRelu_458 input.111 0=96
Convolution              Conv_185                 1 1 input.111 onnx::PRelu_462 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_186                1 1 onnx::PRelu_462 input.115 0=96
Convolution              Conv_187                 1 1 input.115 onnx::PRelu_466 0=96 1=3 4=1 5=1 6=82944
PReLU                    PRelu_188                1 1 onnx::PRelu_466 onnx::Add_469 0=96
BinaryOp                 Add_189                  2 1 onnx::Add_469 input.87_splitncnn_0 onnx::ConvTranspose_470
Deconvolution            ConvTranspose_190        1 1 onnx::ConvTranspose_470 tmp.7 0=5 1=4 3=2 4=1 5=1 6=7680
Interp                   Resize_191               1 1 tmp.7 onnx::Slice_476 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_13             1 2 onnx::Slice_476 onnx::Slice_476_splitncnn_0 onnx::Slice_476_splitncnn_1
Crop                     Slice_196                1 1 onnx::Slice_476_splitncnn_1 onnx::Mul_481 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_198                  1 1 onnx::Mul_481 onnx::Mul_483 0=2 1=1 2=2.000000e+00
Crop                     Slice_205                1 1 onnx::Slice_476_splitncnn_0 onnx::Add_490 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_206                  2 1 flow.3_splitncnn_0 onnx::Mul_483 flow.7 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_14             1 4 flow.7 flow.7_splitncnn_0 flow.7_splitncnn_1 flow.7_splitncnn_2 flow.7_splitncnn_3
BinaryOp                 Add_207                  2 1 onnx::Concat_391_splitncnn_0 onnx::Add_490 onnx::Concat_492
Split                    splitncnn_15             1 2 onnx::Concat_492 onnx::Concat_492_splitncnn_0 onnx::Concat_492_splitncnn_1
Crop                     Slice_212                1 1 flow.7_splitncnn_3 onnx::Pow_497 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_5                   2 1 img0_splitncnn_1 onnx::Pow_497 onnx::Slice_498 0=6
Crop                     Slice_218                1 1 flow.7_splitncnn_2 onnx::Pow_503 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_4                   2 1 img1_splitncnn_1 onnx::Pow_503 onnx::Slice_504 0=6
Crop                     Slice_224                1 1 onnx::Slice_498 onnx::Concat_509 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_229                1 1 onnx::Slice_504 onnx::Concat_514 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_230               4 1 onnx::Concat_509 onnx::Concat_514 onnx::Concat_213_splitncnn_0 onnx::Concat_492_splitncnn_1 x.11
Interp                   Resize_231               1 1 x.11 onnx::Concat_520 0=2
Interp                   Resize_232               1 1 flow.7_splitncnn_1 onnx::Mul_525 0=2
BinaryOp                 Mul_234                  1 1 onnx::Mul_525 onnx::Div_527 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_236                  1 1 onnx::Div_527 onnx::Concat_529 0=3 1=1 2=1.000000e+00
Concat                   Concat_237               2 1 onnx::Concat_520 onnx::Concat_529 input.119
Convolution              Conv_238                 1 1 input.119 onnx::PRelu_531 0=32 1=3 3=2 4=1 5=1 6=3456
PReLU                    PRelu_239                1 1 onnx::PRelu_531 input.123 0=32
Convolution              Conv_240                 1 1 input.123 onnx::PRelu_535 0=64 1=3 3=2 4=1 5=1 6=18432
PReLU                    PRelu_241                1 1 onnx::PRelu_535 input.127 0=64
Split                    splitncnn_16             1 2 input.127 input.127_splitncnn_0 input.127_splitncnn_1
Convolution              Conv_242                 1 1 input.127_splitncnn_1 onnx::PRelu_539 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_243                1 1 onnx::PRelu_539 input.131 0=64
Convolution              Conv_244                 1 1 input.131 onnx::PRelu_543 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_245                1 1 onnx::PRelu_543 input.135 0=64
Convolution              Conv_246                 1 1 input.135 onnx::PRelu_547 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_247                1 1 onnx::PRelu_547 input.139 0=64
Convolution              Conv_248                 1 1 input.139 onnx::PRelu_551 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_249                1 1 onnx::PRelu_551 input.143 0=64
Convolution              Conv_250                 1 1 input.143 onnx::PRelu_555 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_251                1 1 onnx::PRelu_555 input.147 0=64
Convolution              Conv_252                 1 1 input.147 onnx::PRelu_559 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_253                1 1 onnx::PRelu_559 input.151 0=64
Convolution              Conv_254                 1 1 input.151 onnx::PRelu_563 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_255                1 1 onnx::PRelu_563 input.155 0=64
Convolution              Conv_256                 1 1 input.155 onnx::PRelu_567 0=64 1=3 4=1 5=1 6=36864
PReLU                    PRelu_257                1 1 onnx::PRelu_567 onnx::Add_570 0=64
BinaryOp                 Add_258                  2 1 onnx::Add_570 input.127_splitncnn_0 onnx::ConvTranspose_571
Deconvolution            ConvTranspose_259        1 1 onnx::ConvTranspose_571 tmp.11 0=5 1=4 3=2 4=1 5=1 6=5120
Interp                   Resize_260               1 1 tmp.11 onnx::Slice_577 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_17             1 2 onnx::Slice_577 onnx::Slice_577_splitncnn_0 onnx::Slice_577_splitncnn_1
Crop                     Slice_265                1 1 onnx::Slice_577_splitncnn_1 onnx::Mul_582 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_272                1 1 onnx::Slice_577_splitncnn_0 onnx::Add_589 -23309=1,4 -23310=1,5 -23311=1,0
Eltwise                  Add_273                  2 1 flow.7_splitncnn_0 onnx::Mul_582 onnx::Slice_590 0=1 -23301=2,1.000000e+00,2.000000e+00
Split                    splitncnn_18             1 2 onnx::Slice_590 onnx::Slice_590_splitncnn_0 onnx::Slice_590_splitncnn_1
BinaryOp                 Add_274                  2 1 onnx::Concat_492_splitncnn_0 onnx::Add_589 onnx::Sigmoid_591
Crop                     Slice_279                1 1 onnx::Slice_590_splitncnn_1 onnx::Pow_596 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                warp_7                   2 1 img0_splitncnn_0 onnx::Pow_596 onnx::Mul_597 0=6
Crop                     Slice_285                1 1 onnx::Slice_590_splitncnn_0 onnx::Pow_602 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                warp_6                   2 1 img1_splitncnn_0 onnx::Pow_602 onnx::Mul_603 0=6
Sigmoid                  Sigmoid_287              1 1 onnx::Sigmoid_591 onnx::Mul_604
Split                    splitncnn_19             1 2 onnx::Mul_604 onnx::Mul_604_splitncnn_0 onnx::Mul_604_splitncnn_1
BinaryOp                 Mul_288                  2 1 onnx::Mul_597 onnx::Mul_604_splitncnn_1 onnx::Add_605 0=2
BinaryOp                 Sub_290                  1 1 onnx::Mul_604_splitncnn_0 onnx::Mul_607 0=7 1=1 2=1.000000e+00
BinaryOp                 Mul_291                  2 1 onnx::Mul_603 onnx::Mul_607 onnx::Add_608 0=2
BinaryOp                 Add_292                  2 1 onnx::Add_605 onnx::Add_608 out0
