7767517
612 768
Input                    in0                      0 1 in0
Split                    splitncnn_input0         1 7 in0 in0_splitncnn_0 in0_splitncnn_1 in0_splitncnn_2 in0_splitncnn_3 in0_splitncnn_4 in0_splitncnn_5 in0_splitncnn_6
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 7 in1 in1_splitncnn_0 in1_splitncnn_1 in1_splitncnn_2 in1_splitncnn_3 in1_splitncnn_4 in1_splitncnn_5 in1_splitncnn_6
Input                    in2                      0 1 in2
MemoryData               block0.convblock.0.beta  0 1 block0.convblock.0.beta 0=1 1=1 2=192
Split                    splitncnn_0              1 2 block0.convblock.0.beta block0.convblock.0.beta_splitncnn_0 block0.convblock.0.beta_splitncnn_1
MemoryData               block0.convblock.1.beta  0 1 block0.convblock.1.beta 0=1 1=1 2=192
Split                    splitncnn_1              1 2 block0.convblock.1.beta block0.convblock.1.beta_splitncnn_0 block0.convblock.1.beta_splitncnn_1
MemoryData               block0.convblock.2.beta  0 1 block0.convblock.2.beta 0=1 1=1 2=192
Split                    splitncnn_2              1 2 block0.convblock.2.beta block0.convblock.2.beta_splitncnn_0 block0.convblock.2.beta_splitncnn_1
MemoryData               block0.convblock.3.beta  0 1 block0.convblock.3.beta 0=1 1=1 2=192
Split                    splitncnn_3              1 2 block0.convblock.3.beta block0.convblock.3.beta_splitncnn_0 block0.convblock.3.beta_splitncnn_1
MemoryData               block0.convblock.4.beta  0 1 block0.convblock.4.beta 0=1 1=1 2=192
Split                    splitncnn_4              1 2 block0.convblock.4.beta block0.convblock.4.beta_splitncnn_0 block0.convblock.4.beta_splitncnn_1
MemoryData               block0.convblock.5.beta  0 1 block0.convblock.5.beta 0=1 1=1 2=192
Split                    splitncnn_5              1 2 block0.convblock.5.beta block0.convblock.5.beta_splitncnn_0 block0.convblock.5.beta_splitncnn_1
MemoryData               block0.convblock.6.beta  0 1 block0.convblock.6.beta 0=1 1=1 2=192
Split                    splitncnn_6              1 2 block0.convblock.6.beta block0.convblock.6.beta_splitncnn_0 block0.convblock.6.beta_splitncnn_1
MemoryData               block0.convblock.7.beta  0 1 block0.convblock.7.beta 0=1 1=1 2=192
Split                    splitncnn_7              1 2 block0.convblock.7.beta block0.convblock.7.beta_splitncnn_0 block0.convblock.7.beta_splitncnn_1
MemoryData               block1.convblock.0.beta  0 1 block1.convblock.0.beta 0=1 1=1 2=128
Split                    splitncnn_8              1 2 block1.convblock.0.beta block1.convblock.0.beta_splitncnn_0 block1.convblock.0.beta_splitncnn_1
MemoryData               block1.convblock.1.beta  0 1 block1.convblock.1.beta 0=1 1=1 2=128
Split                    splitncnn_9              1 2 block1.convblock.1.beta block1.convblock.1.beta_splitncnn_0 block1.convblock.1.beta_splitncnn_1
MemoryData               block1.convblock.2.beta  0 1 block1.convblock.2.beta 0=1 1=1 2=128
Split                    splitncnn_10             1 2 block1.convblock.2.beta block1.convblock.2.beta_splitncnn_0 block1.convblock.2.beta_splitncnn_1
MemoryData               block1.convblock.3.beta  0 1 block1.convblock.3.beta 0=1 1=1 2=128
Split                    splitncnn_11             1 2 block1.convblock.3.beta block1.convblock.3.beta_splitncnn_0 block1.convblock.3.beta_splitncnn_1
MemoryData               block1.convblock.4.beta  0 1 block1.convblock.4.beta 0=1 1=1 2=128
Split                    splitncnn_12             1 2 block1.convblock.4.beta block1.convblock.4.beta_splitncnn_0 block1.convblock.4.beta_splitncnn_1
MemoryData               block1.convblock.5.beta  0 1 block1.convblock.5.beta 0=1 1=1 2=128
Split                    splitncnn_13             1 2 block1.convblock.5.beta block1.convblock.5.beta_splitncnn_0 block1.convblock.5.beta_splitncnn_1
MemoryData               block1.convblock.6.beta  0 1 block1.convblock.6.beta 0=1 1=1 2=128
Split                    splitncnn_14             1 2 block1.convblock.6.beta block1.convblock.6.beta_splitncnn_0 block1.convblock.6.beta_splitncnn_1
MemoryData               block1.convblock.7.beta  0 1 block1.convblock.7.beta 0=1 1=1 2=128
Split                    splitncnn_15             1 2 block1.convblock.7.beta block1.convblock.7.beta_splitncnn_0 block1.convblock.7.beta_splitncnn_1
MemoryData               block2.convblock.0.beta  0 1 block2.convblock.0.beta 0=1 1=1 2=96
Split                    splitncnn_16             1 2 block2.convblock.0.beta block2.convblock.0.beta_splitncnn_0 block2.convblock.0.beta_splitncnn_1
MemoryData               block2.convblock.1.beta  0 1 block2.convblock.1.beta 0=1 1=1 2=96
Split                    splitncnn_17             1 2 block2.convblock.1.beta block2.convblock.1.beta_splitncnn_0 block2.convblock.1.beta_splitncnn_1
MemoryData               block2.convblock.2.beta  0 1 block2.convblock.2.beta 0=1 1=1 2=96
Split                    splitncnn_18             1 2 block2.convblock.2.beta block2.convblock.2.beta_splitncnn_0 block2.convblock.2.beta_splitncnn_1
MemoryData               block2.convblock.3.beta  0 1 block2.convblock.3.beta 0=1 1=1 2=96
Split                    splitncnn_19             1 2 block2.convblock.3.beta block2.convblock.3.beta_splitncnn_0 block2.convblock.3.beta_splitncnn_1
MemoryData               block2.convblock.4.beta  0 1 block2.convblock.4.beta 0=1 1=1 2=96
Split                    splitncnn_20             1 2 block2.convblock.4.beta block2.convblock.4.beta_splitncnn_0 block2.convblock.4.beta_splitncnn_1
MemoryData               block2.convblock.5.beta  0 1 block2.convblock.5.beta 0=1 1=1 2=96
Split                    splitncnn_21             1 2 block2.convblock.5.beta block2.convblock.5.beta_splitncnn_0 block2.convblock.5.beta_splitncnn_1
MemoryData               block2.convblock.6.beta  0 1 block2.convblock.6.beta 0=1 1=1 2=96
Split                    splitncnn_22             1 2 block2.convblock.6.beta block2.convblock.6.beta_splitncnn_0 block2.convblock.6.beta_splitncnn_1
MemoryData               block2.convblock.7.beta  0 1 block2.convblock.7.beta 0=1 1=1 2=96
Split                    splitncnn_23             1 2 block2.convblock.7.beta block2.convblock.7.beta_splitncnn_0 block2.convblock.7.beta_splitncnn_1
MemoryData               block3.convblock.0.beta  0 1 block3.convblock.0.beta 0=1 1=1 2=64
Split                    splitncnn_24             1 2 block3.convblock.0.beta block3.convblock.0.beta_splitncnn_0 block3.convblock.0.beta_splitncnn_1
MemoryData               block3.convblock.1.beta  0 1 block3.convblock.1.beta 0=1 1=1 2=64
Split                    splitncnn_25             1 2 block3.convblock.1.beta block3.convblock.1.beta_splitncnn_0 block3.convblock.1.beta_splitncnn_1
MemoryData               block3.convblock.2.beta  0 1 block3.convblock.2.beta 0=1 1=1 2=64
Split                    splitncnn_26             1 2 block3.convblock.2.beta block3.convblock.2.beta_splitncnn_0 block3.convblock.2.beta_splitncnn_1
MemoryData               block3.convblock.3.beta  0 1 block3.convblock.3.beta 0=1 1=1 2=64
Split                    splitncnn_27             1 2 block3.convblock.3.beta block3.convblock.3.beta_splitncnn_0 block3.convblock.3.beta_splitncnn_1
MemoryData               block3.convblock.4.beta  0 1 block3.convblock.4.beta 0=1 1=1 2=64
Split                    splitncnn_28             1 2 block3.convblock.4.beta block3.convblock.4.beta_splitncnn_0 block3.convblock.4.beta_splitncnn_1
MemoryData               block3.convblock.5.beta  0 1 block3.convblock.5.beta 0=1 1=1 2=64
Split                    splitncnn_29             1 2 block3.convblock.5.beta block3.convblock.5.beta_splitncnn_0 block3.convblock.5.beta_splitncnn_1
MemoryData               block3.convblock.6.beta  0 1 block3.convblock.6.beta 0=1 1=1 2=64
Split                    splitncnn_30             1 2 block3.convblock.6.beta block3.convblock.6.beta_splitncnn_0 block3.convblock.6.beta_splitncnn_1
MemoryData               block3.convblock.7.beta  0 1 block3.convblock.7.beta 0=1 1=1 2=64
Split                    splitncnn_31             1 2 block3.convblock.7.beta block3.convblock.7.beta_splitncnn_0 block3.convblock.7.beta_splitncnn_1
Concat                   Concat_0                 2 1 in0_splitncnn_6 in1_splitncnn_6 123
Crop                     Slice_5                  1 1 123 128 -23309=1,0 -23310=1,1 -23311=1,0
BinaryOp                 Mul_7                    1 1 128 130 0=2 1=1
BinaryOp                 Add_9                    1 1 130 132 1=1 2=1.000000e+00
BinaryOp                 Mul_10                   2 1 132 in2 133 0=2
Split                    splitncnn_32             1 8 133 133_splitncnn_0 133_splitncnn_1 133_splitncnn_2 133_splitncnn_3 133_splitncnn_4 133_splitncnn_5 133_splitncnn_6 133_splitncnn_7
Crop                     Slice_16                 1 1 in0_splitncnn_5 139 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_21                 1 1 in1_splitncnn_5 144 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_22                3 1 139 144 133_splitncnn_7 145
Interp                   Resize_24                1 1 145 150 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_25                  1 1 150 152 0=96 1=3 3=2 4=1 5=1 6=6048 9=2 -23310=1,2.000000e-01
Convolution              Conv_27                  1 1 152 154 0=192 1=3 3=2 4=1 5=1 6=165888 9=2 -23310=1,2.000000e-01
Split                    splitncnn_33             1 2 154 154_splitncnn_0 154_splitncnn_1
Convolution              Conv_29                  1 1 154_splitncnn_1 155 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_30                   2 1 155 block0.convblock.0.beta_splitncnn_1 156 0=2
BinaryOp                 Add_31                   2 1 156 154_splitncnn_0 157
ReLU                     LeakyRelu_32             1 1 157 158 0=2.000000e-01
Split                    splitncnn_34             1 2 158 158_splitncnn_0 158_splitncnn_1
Convolution              Conv_33                  1 1 158_splitncnn_1 159 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_34                   2 1 159 block0.convblock.1.beta_splitncnn_1 160 0=2
BinaryOp                 Add_35                   2 1 160 158_splitncnn_0 161
ReLU                     LeakyRelu_36             1 1 161 162 0=2.000000e-01
Split                    splitncnn_35             1 2 162 162_splitncnn_0 162_splitncnn_1
Convolution              Conv_37                  1 1 162_splitncnn_1 163 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_38                   2 1 163 block0.convblock.2.beta_splitncnn_1 164 0=2
BinaryOp                 Add_39                   2 1 164 162_splitncnn_0 165
ReLU                     LeakyRelu_40             1 1 165 166 0=2.000000e-01
Split                    splitncnn_36             1 2 166 166_splitncnn_0 166_splitncnn_1
Convolution              Conv_41                  1 1 166_splitncnn_1 167 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_42                   2 1 167 block0.convblock.3.beta_splitncnn_1 168 0=2
BinaryOp                 Add_43                   2 1 168 166_splitncnn_0 169
ReLU                     LeakyRelu_44             1 1 169 170 0=2.000000e-01
Split                    splitncnn_37             1 2 170 170_splitncnn_0 170_splitncnn_1
Convolution              Conv_45                  1 1 170_splitncnn_1 171 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_46                   2 1 171 block0.convblock.4.beta_splitncnn_1 172 0=2
BinaryOp                 Add_47                   2 1 172 170_splitncnn_0 173
ReLU                     LeakyRelu_48             1 1 173 174 0=2.000000e-01
Split                    splitncnn_38             1 2 174 174_splitncnn_0 174_splitncnn_1
Convolution              Conv_49                  1 1 174_splitncnn_1 175 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_50                   2 1 175 block0.convblock.5.beta_splitncnn_1 176 0=2
BinaryOp                 Add_51                   2 1 176 174_splitncnn_0 177
ReLU                     LeakyRelu_52             1 1 177 178 0=2.000000e-01
Split                    splitncnn_39             1 2 178 178_splitncnn_0 178_splitncnn_1
Convolution              Conv_53                  1 1 178_splitncnn_1 179 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_54                   2 1 179 block0.convblock.6.beta_splitncnn_1 180 0=2
BinaryOp                 Add_55                   2 1 180 178_splitncnn_0 181
ReLU                     LeakyRelu_56             1 1 181 182 0=2.000000e-01
Split                    splitncnn_40             1 2 182 182_splitncnn_0 182_splitncnn_1
Convolution              Conv_57                  1 1 182_splitncnn_1 183 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_58                   2 1 183 block0.convblock.7.beta_splitncnn_1 184 0=2
BinaryOp                 Add_59                   2 1 184 182_splitncnn_0 185
ReLU                     LeakyRelu_60             1 1 185 186 0=2.000000e-01
Deconvolution            ConvTranspose_61         1 1 186 187 0=24 1=4 3=2 4=1 5=1 6=73728
PixelShuffle             DepthToSpace_62          1 1 187 188 0=2
Interp                   Resize_64                1 1 188 193 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_41             1 2 193 193_splitncnn_0 193_splitncnn_1
Crop                     Slice_69                 1 1 193_splitncnn_1 198 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_76                 1 1 193_splitncnn_0 205 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_81                 1 1 in1_splitncnn_4 210 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_86                 1 1 in0_splitncnn_4 215 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_88                   1 1 133_splitncnn_6 217 0=7 1=1 2=1.000000e+00
Concat                   Concat_89                3 1 210 215 217 218
Interp                   Resize_91                1 1 218 223 0=2 1=1.250000e-01 2=1.250000e-01
Convolution              Conv_92                  1 1 223 225 0=96 1=3 3=2 4=1 5=1 6=6048 9=2 -23310=1,2.000000e-01
Convolution              Conv_94                  1 1 225 227 0=192 1=3 3=2 4=1 5=1 6=165888 9=2 -23310=1,2.000000e-01
Split                    splitncnn_42             1 2 227 227_splitncnn_0 227_splitncnn_1
Convolution              Conv_96                  1 1 227_splitncnn_1 228 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_97                   2 1 228 block0.convblock.0.beta_splitncnn_0 229 0=2
BinaryOp                 Add_98                   2 1 229 227_splitncnn_0 230
ReLU                     LeakyRelu_99             1 1 230 231 0=2.000000e-01
Split                    splitncnn_43             1 2 231 231_splitncnn_0 231_splitncnn_1
Convolution              Conv_100                 1 1 231_splitncnn_1 232 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_101                  2 1 232 block0.convblock.1.beta_splitncnn_0 233 0=2
BinaryOp                 Add_102                  2 1 233 231_splitncnn_0 234
ReLU                     LeakyRelu_103            1 1 234 235 0=2.000000e-01
Split                    splitncnn_44             1 2 235 235_splitncnn_0 235_splitncnn_1
Convolution              Conv_104                 1 1 235_splitncnn_1 236 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_105                  2 1 236 block0.convblock.2.beta_splitncnn_0 237 0=2
BinaryOp                 Add_106                  2 1 237 235_splitncnn_0 238
ReLU                     LeakyRelu_107            1 1 238 239 0=2.000000e-01
Split                    splitncnn_45             1 2 239 239_splitncnn_0 239_splitncnn_1
Convolution              Conv_108                 1 1 239_splitncnn_1 240 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_109                  2 1 240 block0.convblock.3.beta_splitncnn_0 241 0=2
BinaryOp                 Add_110                  2 1 241 239_splitncnn_0 242
ReLU                     LeakyRelu_111            1 1 242 243 0=2.000000e-01
Split                    splitncnn_46             1 2 243 243_splitncnn_0 243_splitncnn_1
Convolution              Conv_112                 1 1 243_splitncnn_1 244 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_113                  2 1 244 block0.convblock.4.beta_splitncnn_0 245 0=2
BinaryOp                 Add_114                  2 1 245 243_splitncnn_0 246
ReLU                     LeakyRelu_115            1 1 246 247 0=2.000000e-01
Split                    splitncnn_47             1 2 247 247_splitncnn_0 247_splitncnn_1
Convolution              Conv_116                 1 1 247_splitncnn_1 248 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_117                  2 1 248 block0.convblock.5.beta_splitncnn_0 249 0=2
BinaryOp                 Add_118                  2 1 249 247_splitncnn_0 250
ReLU                     LeakyRelu_119            1 1 250 251 0=2.000000e-01
Split                    splitncnn_48             1 2 251 251_splitncnn_0 251_splitncnn_1
Convolution              Conv_120                 1 1 251_splitncnn_1 252 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_121                  2 1 252 block0.convblock.6.beta_splitncnn_0 253 0=2
BinaryOp                 Add_122                  2 1 253 251_splitncnn_0 254
ReLU                     LeakyRelu_123            1 1 254 255 0=2.000000e-01
Split                    splitncnn_49             1 2 255 255_splitncnn_0 255_splitncnn_1
Convolution              Conv_124                 1 1 255_splitncnn_1 256 0=192 1=3 4=1 5=1 6=331776
BinaryOp                 Mul_125                  2 1 256 block0.convblock.7.beta_splitncnn_0 257 0=2
BinaryOp                 Add_126                  2 1 257 255_splitncnn_0 258
ReLU                     LeakyRelu_127            1 1 258 259 0=2.000000e-01
Deconvolution            ConvTranspose_128        1 1 259 260 0=24 1=4 3=2 4=1 5=1 6=73728
PixelShuffle             DepthToSpace_129         1 1 260 261 0=2
Interp                   Resize_131               1 1 261 266 0=2 1=8.000000e+00 2=8.000000e+00
Split                    splitncnn_50             1 2 266 266_splitncnn_0 266_splitncnn_1
Crop                     Slice_136                1 1 266_splitncnn_1 271 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_138                  1 1 271 273 0=2 1=1 2=8.000000e+00
Split                    splitncnn_51             1 2 273 273_splitncnn_0 273_splitncnn_1
Crop                     Slice_143                1 1 266_splitncnn_0 278 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_148                1 1 273_splitncnn_1 283 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_153                1 1 273_splitncnn_0 288 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_154               2 1 283 288 289
Eltwise                  Add_155                  2 1 198 289 290 0=1 -23301=2,8.000000e+00,1.000000e+00
BinaryOp                 Div_156                  1 1 290 293 0=3 1=1 2=2.000000e+00
Split                    splitncnn_52             1 6 293 293_splitncnn_0 293_splitncnn_1 293_splitncnn_2 293_splitncnn_3 293_splitncnn_4 293_splitncnn_5
UnaryOp                  Neg_157                  1 1 278 294 0=1
BinaryOp                 Add_158                  2 1 205 294 295
BinaryOp                 Div_159                  1 1 295 298 0=3 1=1 2=2.000000e+00
Split                    splitncnn_53             1 3 298 298_splitncnn_0 298_splitncnn_1 298_splitncnn_2
Crop                     Slice_164                1 1 293_splitncnn_5 303 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_165                  2 1 in0_splitncnn_3 303 304 0=6
Split                    splitncnn_54             1 2 304 304_splitncnn_0 304_splitncnn_1
Crop                     Slice_170                1 1 293_splitncnn_4 309 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_171                  2 1 in1_splitncnn_3 309 310 0=6
Split                    splitncnn_55             1 2 310 310_splitncnn_0 310_splitncnn_1
Crop                     Slice_176                1 1 304_splitncnn_1 315 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_181                1 1 310_splitncnn_1 320 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_182               4 1 315 320 133_splitncnn_5 298_splitncnn_2 321
Interp                   Resize_184               1 1 321 326 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_186               1 1 293_splitncnn_3 331 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_188                  1 1 331 333 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_189                  1 1 333 336 0=3 1=1 2=4.000000e+00
Concat                   Concat_190               2 1 326 336 337
Convolution              Conv_191                 1 1 337 339 0=64 1=3 3=2 4=1 5=1 6=6912 9=2 -23310=1,2.000000e-01
Convolution              Conv_193                 1 1 339 341 0=128 1=3 3=2 4=1 5=1 6=73728 9=2 -23310=1,2.000000e-01
Split                    splitncnn_56             1 2 341 341_splitncnn_0 341_splitncnn_1
Convolution              Conv_195                 1 1 341_splitncnn_1 342 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_196                  2 1 342 block1.convblock.0.beta_splitncnn_1 343 0=2
BinaryOp                 Add_197                  2 1 343 341_splitncnn_0 344
ReLU                     LeakyRelu_198            1 1 344 345 0=2.000000e-01
Split                    splitncnn_57             1 2 345 345_splitncnn_0 345_splitncnn_1
Convolution              Conv_199                 1 1 345_splitncnn_1 346 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_200                  2 1 346 block1.convblock.1.beta_splitncnn_1 347 0=2
BinaryOp                 Add_201                  2 1 347 345_splitncnn_0 348
ReLU                     LeakyRelu_202            1 1 348 349 0=2.000000e-01
Split                    splitncnn_58             1 2 349 349_splitncnn_0 349_splitncnn_1
Convolution              Conv_203                 1 1 349_splitncnn_1 350 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_204                  2 1 350 block1.convblock.2.beta_splitncnn_1 351 0=2
BinaryOp                 Add_205                  2 1 351 349_splitncnn_0 352
ReLU                     LeakyRelu_206            1 1 352 353 0=2.000000e-01
Split                    splitncnn_59             1 2 353 353_splitncnn_0 353_splitncnn_1
Convolution              Conv_207                 1 1 353_splitncnn_1 354 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_208                  2 1 354 block1.convblock.3.beta_splitncnn_1 355 0=2
BinaryOp                 Add_209                  2 1 355 353_splitncnn_0 356
ReLU                     LeakyRelu_210            1 1 356 357 0=2.000000e-01
Split                    splitncnn_60             1 2 357 357_splitncnn_0 357_splitncnn_1
Convolution              Conv_211                 1 1 357_splitncnn_1 358 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_212                  2 1 358 block1.convblock.4.beta_splitncnn_1 359 0=2
BinaryOp                 Add_213                  2 1 359 357_splitncnn_0 360
ReLU                     LeakyRelu_214            1 1 360 361 0=2.000000e-01
Split                    splitncnn_61             1 2 361 361_splitncnn_0 361_splitncnn_1
Convolution              Conv_215                 1 1 361_splitncnn_1 362 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_216                  2 1 362 block1.convblock.5.beta_splitncnn_1 363 0=2
BinaryOp                 Add_217                  2 1 363 361_splitncnn_0 364
ReLU                     LeakyRelu_218            1 1 364 365 0=2.000000e-01
Split                    splitncnn_62             1 2 365 365_splitncnn_0 365_splitncnn_1
Convolution              Conv_219                 1 1 365_splitncnn_1 366 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_220                  2 1 366 block1.convblock.6.beta_splitncnn_1 367 0=2
BinaryOp                 Add_221                  2 1 367 365_splitncnn_0 368
ReLU                     LeakyRelu_222            1 1 368 369 0=2.000000e-01
Split                    splitncnn_63             1 2 369 369_splitncnn_0 369_splitncnn_1
Convolution              Conv_223                 1 1 369_splitncnn_1 370 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_224                  2 1 370 block1.convblock.7.beta_splitncnn_1 371 0=2
BinaryOp                 Add_225                  2 1 371 369_splitncnn_0 372
ReLU                     LeakyRelu_226            1 1 372 373 0=2.000000e-01
Deconvolution            ConvTranspose_227        1 1 373 374 0=24 1=4 3=2 4=1 5=1 6=49152
PixelShuffle             DepthToSpace_228         1 1 374 375 0=2
Interp                   Resize_230               1 1 375 380 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_64             1 2 380 380_splitncnn_0 380_splitncnn_1
Crop                     Slice_235                1 1 380_splitncnn_1 385 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_242                1 1 380_splitncnn_0 392 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_247                1 1 310_splitncnn_0 397 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_252                1 1 304_splitncnn_0 402 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_254                  1 1 133_splitncnn_4 404 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_255                  1 1 298_splitncnn_1 405 0=1
Concat                   Concat_256               4 1 397 402 404 405 406
Crop                     Slice_261                1 1 293_splitncnn_2 411 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_266                1 1 293_splitncnn_1 416 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_267               2 1 411 416 417
Interp                   Resize_269               1 1 406 422 0=2 1=2.500000e-01 2=2.500000e-01
Interp                   Resize_271               1 1 417 427 0=2 1=2.500000e-01 2=2.500000e-01
BinaryOp                 Mul_273                  1 1 427 429 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_274                  1 1 429 432 0=3 1=1 2=4.000000e+00
Concat                   Concat_275               2 1 422 432 433
Convolution              Conv_276                 1 1 433 435 0=64 1=3 3=2 4=1 5=1 6=6912 9=2 -23310=1,2.000000e-01
Convolution              Conv_278                 1 1 435 437 0=128 1=3 3=2 4=1 5=1 6=73728 9=2 -23310=1,2.000000e-01
Split                    splitncnn_65             1 2 437 437_splitncnn_0 437_splitncnn_1
Convolution              Conv_280                 1 1 437_splitncnn_1 438 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_281                  2 1 438 block1.convblock.0.beta_splitncnn_0 439 0=2
BinaryOp                 Add_282                  2 1 439 437_splitncnn_0 440
ReLU                     LeakyRelu_283            1 1 440 441 0=2.000000e-01
Split                    splitncnn_66             1 2 441 441_splitncnn_0 441_splitncnn_1
Convolution              Conv_284                 1 1 441_splitncnn_1 442 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_285                  2 1 442 block1.convblock.1.beta_splitncnn_0 443 0=2
BinaryOp                 Add_286                  2 1 443 441_splitncnn_0 444
ReLU                     LeakyRelu_287            1 1 444 445 0=2.000000e-01
Split                    splitncnn_67             1 2 445 445_splitncnn_0 445_splitncnn_1
Convolution              Conv_288                 1 1 445_splitncnn_1 446 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_289                  2 1 446 block1.convblock.2.beta_splitncnn_0 447 0=2
BinaryOp                 Add_290                  2 1 447 445_splitncnn_0 448
ReLU                     LeakyRelu_291            1 1 448 449 0=2.000000e-01
Split                    splitncnn_68             1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution              Conv_292                 1 1 449_splitncnn_1 450 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_293                  2 1 450 block1.convblock.3.beta_splitncnn_0 451 0=2
BinaryOp                 Add_294                  2 1 451 449_splitncnn_0 452
ReLU                     LeakyRelu_295            1 1 452 453 0=2.000000e-01
Split                    splitncnn_69             1 2 453 453_splitncnn_0 453_splitncnn_1
Convolution              Conv_296                 1 1 453_splitncnn_1 454 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_297                  2 1 454 block1.convblock.4.beta_splitncnn_0 455 0=2
BinaryOp                 Add_298                  2 1 455 453_splitncnn_0 456
ReLU                     LeakyRelu_299            1 1 456 457 0=2.000000e-01
Split                    splitncnn_70             1 2 457 457_splitncnn_0 457_splitncnn_1
Convolution              Conv_300                 1 1 457_splitncnn_1 458 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_301                  2 1 458 block1.convblock.5.beta_splitncnn_0 459 0=2
BinaryOp                 Add_302                  2 1 459 457_splitncnn_0 460
ReLU                     LeakyRelu_303            1 1 460 461 0=2.000000e-01
Split                    splitncnn_71             1 2 461 461_splitncnn_0 461_splitncnn_1
Convolution              Conv_304                 1 1 461_splitncnn_1 462 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_305                  2 1 462 block1.convblock.6.beta_splitncnn_0 463 0=2
BinaryOp                 Add_306                  2 1 463 461_splitncnn_0 464
ReLU                     LeakyRelu_307            1 1 464 465 0=2.000000e-01
Split                    splitncnn_72             1 2 465 465_splitncnn_0 465_splitncnn_1
Convolution              Conv_308                 1 1 465_splitncnn_1 466 0=128 1=3 4=1 5=1 6=147456
BinaryOp                 Mul_309                  2 1 466 block1.convblock.7.beta_splitncnn_0 467 0=2
BinaryOp                 Add_310                  2 1 467 465_splitncnn_0 468
ReLU                     LeakyRelu_311            1 1 468 469 0=2.000000e-01
Deconvolution            ConvTranspose_312        1 1 469 470 0=24 1=4 3=2 4=1 5=1 6=49152
PixelShuffle             DepthToSpace_313         1 1 470 471 0=2
Interp                   Resize_315               1 1 471 476 0=2 1=4.000000e+00 2=4.000000e+00
Split                    splitncnn_73             1 2 476 476_splitncnn_0 476_splitncnn_1
Crop                     Slice_320                1 1 476_splitncnn_1 481 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_322                  1 1 481 483 0=2 1=1 2=4.000000e+00
Split                    splitncnn_74             1 2 483 483_splitncnn_0 483_splitncnn_1
Crop                     Slice_327                1 1 476_splitncnn_0 488 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_332                1 1 483_splitncnn_1 493 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_337                1 1 483_splitncnn_0 498 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_338               2 1 493 498 499
Eltwise                  Add_339                  2 1 385 499 500 0=1 -23301=2,4.000000e+00,1.000000e+00
BinaryOp                 Div_340                  1 1 500 503 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_341                  1 1 488 504 0=1
BinaryOp                 Add_342                  2 1 392 504 505
BinaryOp                 Div_343                  1 1 505 508 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_344                  2 1 293_splitncnn_0 503 509
Split                    splitncnn_75             1 6 509 509_splitncnn_0 509_splitncnn_1 509_splitncnn_2 509_splitncnn_3 509_splitncnn_4 509_splitncnn_5
BinaryOp                 Add_345                  2 1 298_splitncnn_0 508 510
Split                    splitncnn_76             1 3 510 510_splitncnn_0 510_splitncnn_1 510_splitncnn_2
Crop                     Slice_350                1 1 509_splitncnn_5 515 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_351                  2 1 in0_splitncnn_2 515 516 0=6
Split                    splitncnn_77             1 2 516 516_splitncnn_0 516_splitncnn_1
Crop                     Slice_356                1 1 509_splitncnn_4 521 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_357                  2 1 in1_splitncnn_2 521 522 0=6
Split                    splitncnn_78             1 2 522 522_splitncnn_0 522_splitncnn_1
Crop                     Slice_362                1 1 516_splitncnn_1 527 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_367                1 1 522_splitncnn_1 532 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_368               4 1 527 532 133_splitncnn_3 510_splitncnn_2 533
Interp                   Resize_370               1 1 533 538 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_372               1 1 509_splitncnn_3 543 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_374                  1 1 543 545 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_375                  1 1 545 548 0=3 1=1 2=2.000000e+00
Concat                   Concat_376               2 1 538 548 549
Convolution              Conv_377                 1 1 549 551 0=48 1=3 3=2 4=1 5=1 6=5184 9=2 -23310=1,2.000000e-01
Convolution              Conv_379                 1 1 551 553 0=96 1=3 3=2 4=1 5=1 6=41472 9=2 -23310=1,2.000000e-01
Split                    splitncnn_79             1 2 553 553_splitncnn_0 553_splitncnn_1
Convolution              Conv_381                 1 1 553_splitncnn_1 554 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_382                  2 1 554 block2.convblock.0.beta_splitncnn_1 555 0=2
BinaryOp                 Add_383                  2 1 555 553_splitncnn_0 556
ReLU                     LeakyRelu_384            1 1 556 557 0=2.000000e-01
Split                    splitncnn_80             1 2 557 557_splitncnn_0 557_splitncnn_1
Convolution              Conv_385                 1 1 557_splitncnn_1 558 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_386                  2 1 558 block2.convblock.1.beta_splitncnn_1 559 0=2
BinaryOp                 Add_387                  2 1 559 557_splitncnn_0 560
ReLU                     LeakyRelu_388            1 1 560 561 0=2.000000e-01
Split                    splitncnn_81             1 2 561 561_splitncnn_0 561_splitncnn_1
Convolution              Conv_389                 1 1 561_splitncnn_1 562 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_390                  2 1 562 block2.convblock.2.beta_splitncnn_1 563 0=2
BinaryOp                 Add_391                  2 1 563 561_splitncnn_0 564
ReLU                     LeakyRelu_392            1 1 564 565 0=2.000000e-01
Split                    splitncnn_82             1 2 565 565_splitncnn_0 565_splitncnn_1
Convolution              Conv_393                 1 1 565_splitncnn_1 566 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_394                  2 1 566 block2.convblock.3.beta_splitncnn_1 567 0=2
BinaryOp                 Add_395                  2 1 567 565_splitncnn_0 568
ReLU                     LeakyRelu_396            1 1 568 569 0=2.000000e-01
Split                    splitncnn_83             1 2 569 569_splitncnn_0 569_splitncnn_1
Convolution              Conv_397                 1 1 569_splitncnn_1 570 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_398                  2 1 570 block2.convblock.4.beta_splitncnn_1 571 0=2
BinaryOp                 Add_399                  2 1 571 569_splitncnn_0 572
ReLU                     LeakyRelu_400            1 1 572 573 0=2.000000e-01
Split                    splitncnn_84             1 2 573 573_splitncnn_0 573_splitncnn_1
Convolution              Conv_401                 1 1 573_splitncnn_1 574 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_402                  2 1 574 block2.convblock.5.beta_splitncnn_1 575 0=2
BinaryOp                 Add_403                  2 1 575 573_splitncnn_0 576
ReLU                     LeakyRelu_404            1 1 576 577 0=2.000000e-01
Split                    splitncnn_85             1 2 577 577_splitncnn_0 577_splitncnn_1
Convolution              Conv_405                 1 1 577_splitncnn_1 578 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_406                  2 1 578 block2.convblock.6.beta_splitncnn_1 579 0=2
BinaryOp                 Add_407                  2 1 579 577_splitncnn_0 580
ReLU                     LeakyRelu_408            1 1 580 581 0=2.000000e-01
Split                    splitncnn_86             1 2 581 581_splitncnn_0 581_splitncnn_1
Convolution              Conv_409                 1 1 581_splitncnn_1 582 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_410                  2 1 582 block2.convblock.7.beta_splitncnn_1 583 0=2
BinaryOp                 Add_411                  2 1 583 581_splitncnn_0 584
ReLU                     LeakyRelu_412            1 1 584 585 0=2.000000e-01
Deconvolution            ConvTranspose_413        1 1 585 586 0=24 1=4 3=2 4=1 5=1 6=36864
PixelShuffle             DepthToSpace_414         1 1 586 587 0=2
Interp                   Resize_416               1 1 587 592 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_87             1 2 592 592_splitncnn_0 592_splitncnn_1
Crop                     Slice_421                1 1 592_splitncnn_1 597 -23309=1,0 -23310=1,4 -23311=1,0
Crop                     Slice_428                1 1 592_splitncnn_0 604 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_433                1 1 522_splitncnn_0 609 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_438                1 1 516_splitncnn_0 614 -23309=1,0 -23310=1,3 -23311=1,0
BinaryOp                 Sub_440                  1 1 133_splitncnn_2 616 0=7 1=1 2=1.000000e+00
UnaryOp                  Neg_441                  1 1 510_splitncnn_1 617 0=1
Concat                   Concat_442               4 1 609 614 616 617 618
Crop                     Slice_447                1 1 509_splitncnn_2 623 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_452                1 1 509_splitncnn_1 628 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_453               2 1 623 628 629
Interp                   Resize_455               1 1 618 634 0=2 1=5.000000e-01 2=5.000000e-01
Interp                   Resize_457               1 1 629 639 0=2 1=5.000000e-01 2=5.000000e-01
BinaryOp                 Mul_459                  1 1 639 641 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_460                  1 1 641 644 0=3 1=1 2=2.000000e+00
Concat                   Concat_461               2 1 634 644 645
Convolution              Conv_462                 1 1 645 647 0=48 1=3 3=2 4=1 5=1 6=5184 9=2 -23310=1,2.000000e-01
Convolution              Conv_464                 1 1 647 649 0=96 1=3 3=2 4=1 5=1 6=41472 9=2 -23310=1,2.000000e-01
Split                    splitncnn_88             1 2 649 649_splitncnn_0 649_splitncnn_1
Convolution              Conv_466                 1 1 649_splitncnn_1 650 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_467                  2 1 650 block2.convblock.0.beta_splitncnn_0 651 0=2
BinaryOp                 Add_468                  2 1 651 649_splitncnn_0 652
ReLU                     LeakyRelu_469            1 1 652 653 0=2.000000e-01
Split                    splitncnn_89             1 2 653 653_splitncnn_0 653_splitncnn_1
Convolution              Conv_470                 1 1 653_splitncnn_1 654 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_471                  2 1 654 block2.convblock.1.beta_splitncnn_0 655 0=2
BinaryOp                 Add_472                  2 1 655 653_splitncnn_0 656
ReLU                     LeakyRelu_473            1 1 656 657 0=2.000000e-01
Split                    splitncnn_90             1 2 657 657_splitncnn_0 657_splitncnn_1
Convolution              Conv_474                 1 1 657_splitncnn_1 658 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_475                  2 1 658 block2.convblock.2.beta_splitncnn_0 659 0=2
BinaryOp                 Add_476                  2 1 659 657_splitncnn_0 660
ReLU                     LeakyRelu_477            1 1 660 661 0=2.000000e-01
Split                    splitncnn_91             1 2 661 661_splitncnn_0 661_splitncnn_1
Convolution              Conv_478                 1 1 661_splitncnn_1 662 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_479                  2 1 662 block2.convblock.3.beta_splitncnn_0 663 0=2
BinaryOp                 Add_480                  2 1 663 661_splitncnn_0 664
ReLU                     LeakyRelu_481            1 1 664 665 0=2.000000e-01
Split                    splitncnn_92             1 2 665 665_splitncnn_0 665_splitncnn_1
Convolution              Conv_482                 1 1 665_splitncnn_1 666 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_483                  2 1 666 block2.convblock.4.beta_splitncnn_0 667 0=2
BinaryOp                 Add_484                  2 1 667 665_splitncnn_0 668
ReLU                     LeakyRelu_485            1 1 668 669 0=2.000000e-01
Split                    splitncnn_93             1 2 669 669_splitncnn_0 669_splitncnn_1
Convolution              Conv_486                 1 1 669_splitncnn_1 670 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_487                  2 1 670 block2.convblock.5.beta_splitncnn_0 671 0=2
BinaryOp                 Add_488                  2 1 671 669_splitncnn_0 672
ReLU                     LeakyRelu_489            1 1 672 673 0=2.000000e-01
Split                    splitncnn_94             1 2 673 673_splitncnn_0 673_splitncnn_1
Convolution              Conv_490                 1 1 673_splitncnn_1 674 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_491                  2 1 674 block2.convblock.6.beta_splitncnn_0 675 0=2
BinaryOp                 Add_492                  2 1 675 673_splitncnn_0 676
ReLU                     LeakyRelu_493            1 1 676 677 0=2.000000e-01
Split                    splitncnn_95             1 2 677 677_splitncnn_0 677_splitncnn_1
Convolution              Conv_494                 1 1 677_splitncnn_1 678 0=96 1=3 4=1 5=1 6=82944
BinaryOp                 Mul_495                  2 1 678 block2.convblock.7.beta_splitncnn_0 679 0=2
BinaryOp                 Add_496                  2 1 679 677_splitncnn_0 680
ReLU                     LeakyRelu_497            1 1 680 681 0=2.000000e-01
Deconvolution            ConvTranspose_498        1 1 681 682 0=24 1=4 3=2 4=1 5=1 6=36864
PixelShuffle             DepthToSpace_499         1 1 682 683 0=2
Interp                   Resize_501               1 1 683 688 0=2 1=2.000000e+00 2=2.000000e+00
Split                    splitncnn_96             1 2 688 688_splitncnn_0 688_splitncnn_1
Crop                     Slice_506                1 1 688_splitncnn_1 693 -23309=1,0 -23310=1,4 -23311=1,0
BinaryOp                 Mul_508                  1 1 693 695 0=2 1=1 2=2.000000e+00
Split                    splitncnn_97             1 2 695 695_splitncnn_0 695_splitncnn_1
Crop                     Slice_513                1 1 688_splitncnn_0 700 -23309=1,4 -23310=1,5 -23311=1,0
Crop                     Slice_518                1 1 695_splitncnn_1 705 -23309=1,2 -23310=1,4 -23311=1,0
Crop                     Slice_523                1 1 695_splitncnn_0 710 -23309=1,0 -23310=1,2 -23311=1,0
Concat                   Concat_524               2 1 705 710 711
Eltwise                  Add_525                  2 1 597 711 712 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 Div_526                  1 1 712 715 0=3 1=1 2=2.000000e+00
UnaryOp                  Neg_527                  1 1 700 716 0=1
BinaryOp                 Add_528                  2 1 604 716 717
BinaryOp                 Div_529                  1 1 717 720 0=3 1=1 2=2.000000e+00
BinaryOp                 Add_530                  2 1 509_splitncnn_0 715 721
Split                    splitncnn_98             1 6 721 721_splitncnn_0 721_splitncnn_1 721_splitncnn_2 721_splitncnn_3 721_splitncnn_4 721_splitncnn_5
BinaryOp                 Add_531                  2 1 510_splitncnn_0 720 722
Split                    splitncnn_99             1 3 722 722_splitncnn_0 722_splitncnn_1 722_splitncnn_2
Crop                     Slice_536                1 1 721_splitncnn_5 727 -23309=1,0 -23310=1,2 -23311=1,0
rife.Warp                 warp_537                  2 1 in0_splitncnn_1 727 728 0=6
Split                    splitncnn_100            1 2 728 728_splitncnn_0 728_splitncnn_1
Crop                     Slice_542                1 1 721_splitncnn_4 733 -23309=1,2 -23310=1,4 -23311=1,0
rife.Warp                 warp_543                  2 1 in1_splitncnn_1 733 734 0=6
Split                    splitncnn_101            1 2 734 734_splitncnn_0 734_splitncnn_1
Crop                     Slice_548                1 1 728_splitncnn_1 739 -23309=1,0 -23310=1,3 -23311=1,0
Crop                     Slice_553                1 1 734_splitncnn_1 744 -23309=1,0 -23310=1,3 -23311=1,0
Concat                   Concat_554               4 1 739 744 133_splitncnn_1 722_splitncnn_2 745
Interp                   Resize_556               1 1 745 750 0=2
Interp                   Resize_558               1 1 721_splitncnn_3 755 0=2
BinaryOp                 Mul_560                  1 1 755 757 0=2 1=1 2=1.000000e+00
BinaryOp                 Div_561                  1 1 757 760 0=3 1=1 2=1.000000e+00
Concat                   Concat_562               2 1 750 760 761
Convolution              Conv_563                 1 1 761 763 0=32 1=3 3=2 4=1 5=1 6=3456 9=2 -23310=1,2.000000e-01
Convolution              Conv_565                 1 1 763 765 0=64 1=3 3=2 4=1 5=1 6=18432 9=2 -23310=1,2.000000e-01
Split                    splitncnn_102            1 2 765 765_splitncnn_0 765_splitncnn_1
Convolution              Conv_567                 1 1 765_splitncnn_1 766 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_568                  2 1 766 block3.convblock.0.beta_splitncnn_1 767 0=2
BinaryOp                 Add_569                  2 1 767 765_splitncnn_0 768
ReLU                     LeakyRelu_570            1 1 768 769 0=2.000000e-01
Split                    splitncnn_103            1 2 769 769_splitncnn_0 769_splitncnn_1
Convolution              Conv_571                 1 1 769_splitncnn_1 770 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_572                  2 1 770 block3.convblock.1.beta_splitncnn_1 771 0=2
BinaryOp                 Add_573                  2 1 771 769_splitncnn_0 772
ReLU                     LeakyRelu_574            1 1 772 773 0=2.000000e-01
Split                    splitncnn_104            1 2 773 773_splitncnn_0 773_splitncnn_1
Convolution              Conv_575                 1 1 773_splitncnn_1 774 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_576                  2 1 774 block3.convblock.2.beta_splitncnn_1 775 0=2
BinaryOp                 Add_577                  2 1 775 773_splitncnn_0 776
ReLU                     LeakyRelu_578            1 1 776 777 0=2.000000e-01
Split                    splitncnn_105            1 2 777 777_splitncnn_0 777_splitncnn_1
Convolution              Conv_579                 1 1 777_splitncnn_1 778 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_580                  2 1 778 block3.convblock.3.beta_splitncnn_1 779 0=2
BinaryOp                 Add_581                  2 1 779 777_splitncnn_0 780
ReLU                     LeakyRelu_582            1 1 780 781 0=2.000000e-01
Split                    splitncnn_106            1 2 781 781_splitncnn_0 781_splitncnn_1
Convolution              Conv_583                 1 1 781_splitncnn_1 782 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_584                  2 1 782 block3.convblock.4.beta_splitncnn_1 783 0=2
BinaryOp                 Add_585                  2 1 783 781_splitncnn_0 784
ReLU                     LeakyRelu_586            1 1 784 785 0=2.000000e-01
Split                    splitncnn_107            1 2 785 785_splitncnn_0 785_splitncnn_1
Convolution              Conv_587                 1 1 785_splitncnn_1 786 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_588                  2 1 786 block3.convblock.5.beta_splitncnn_1 787 0=2
BinaryOp                 Add_589                  2 1 787 785_splitncnn_0 788
ReLU                     LeakyRelu_590            1 1 788 789 0=2.000000e-01
Split                    splitncnn_108            1 2 789 789_splitncnn_0 789_splitncnn_1
Convolution              Conv_591                 1 1 789_splitncnn_1 790 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_592                  2 1 790 block3.convblock.6.beta_splitncnn_1 791 0=2
BinaryOp                 Add_593                  2 1 791 789_splitncnn_0 792
ReLU                     LeakyRelu_594            1 1 792 793 0=2.000000e-01
Split                    splitncnn_109            1 2 793 793_splitncnn_0 793_splitncnn_1
Convolution              Conv_595                 1 1 793_splitncnn_1 794 0=64 1=3 4=1 5=1 6=36864
BinaryOp                 Mul_596                  2 1 794 block3.convblock.7.beta_splitncnn_1 795 0=2
BinaryOp                 Add_597                  2 1 795 793_splitncnn_0 796
ReLU                     LeakyRelu_598            1 1 796 797 0=2.000000e-01
Deconvolution            ConvTranspose_599        1 1 797 798 0=24 1=4 3=2 4=1 5=1 6=24576
PixelShuffle             DepthToSpace_600         1 1 798 799 0=2
Interp                   Resize_602               1 1 799 804 0=2
Split                    splitncnn_110            1 2 804 804_splitncnn_0 804_splitncnn_1
